import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity } from 'src/entities';
import {
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { AssetsService } from 'src/assets_service/assets.service';
import { VisualizationService } from '../visualization.service';
@Injectable()
export class Alcohol {
  constructor(private vis: VisualizationService) {}

  async template(
    doc: PDFKit.PDFDocument,
    service: AssetsService,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    try {
      header(doc, firstname, lastname, service);
      title(doc, service, result.assessmentName);
      info(
        doc,
        service,
        exam.assessment.author,
        exam.assessment.description,
        exam.assessment.measure,
        exam.assessment.usage,
        undefined,
        true,
      );
      doc.font(fontBold).fontSize(13).text('Оршил').moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          '“Бид яагаад эрүүл мэнд, амь насанд аюул учруулж буйг мэддэг ч архийг хэтрүүлэн хэрэглэсээр байдаг юм бол?” гэж та өмнө нь гайхаж байсан уу?\n\nАрхи, согтууруулах ундааг хэрэглэх үед тархинд “аз жаргалын даавар” гэж нэрлэгддэг сэтгэл хөдлөлийг зохицуулах үүрэгтэй допамин болон серотонин дааврууд ялгардаг. Серотонин даавар нь сэтгэл санааг тайвшруулж, тайван мэдрэмж төрүүлдэг бол харин допамин нь урам зоригтой, өдөөгдсөн, таатай мэдрэмжийг төрүүлдэг байна.\n\nХүмүүс архи, согтууруулах ундааг ихэвчлэн стресс тайлах, таашаал авах, хөөрөлд орох, бусадтай нүүр хагарах гэж хэрэглэдэг. Архи, согтууруулах ундаа нь стресс, өвдөлт, сөрөг сэтгэл хөдлөлийг түр зуур намдааж, тааламжтай мэдрэмж төрүүлдэг хэдий  ч архины нөлөө буурах үед эдгээр сөрөг мэдрэмжүүд буцаад илүү хүчтэй илэрдэг. Өмнө нь үүссэн таатай мэдрэмжүүдийг дахин авахын тулд хүмүүс архийг архийг дахин уухыг хүсэж, улмаар хортой дадал зуршилтай болдог байна. Нэгэнт ийм дадал, зуршил тогтсон, архинаас хамааралтай, донтолттой болсон бол цаашид архинаас гарах, хэрэглээгээ зогсоох нь улам төвөгтэй болно. Архи хэрэглэж эхлэх нас эрт байх тусмаа архинд донтох магадлал нэмэгддэг. Мөн архийг их тунгаар байн байн уухад архинд донтох эмгэг илүү хурдан үүсдэг байна.',
          marginX,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Архи, согтууруулах ундааны хортой нөлөө',
      );

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Дэлхий дахинд нас баралт, өвчлөлийн нэг томоохон шалтгаанд архи, согтууруулах ундааны хэтрүүлэн хэрэглээ ордог. Архи, согтууруулах ундаа нь хүний биед олон төрлийн хортой, сөрөг нөлөө, нөлөөллүүдийг үзүүлдэг. Тухайлбал:',
          { align: 'justify' },
        )
        .moveDown(0.5);

      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Зүрх судасны өвчин үүсгэж, тархинд цус харвалт, зүрхний шигдээсний эрсдэлийг нэмэгдүүлдэг',
            'Хоол боловсруулах тогтолцоо, элэгний өвчин (элэг өөхлөх, хатуурах, элэгний хавдар)',
            'Сэтгэц, зан үйлд сөргөөр нөлөөлж, хүчирхийлэл, осол гэмтэл, амиа хорлолтыг нэмэгдүүлдэг',
            'Дархлааны тогтолцоог сулруулдаг',
            'Жирэмсэн үед хэрэглэвэл ургийн гаж хөгжил үүсгэх эрсдэлтэй (Дэлгэрэнгүй мэдээллийг дараах зургаас харна уу)',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(0.5);
      doc.image(service.getAsset(`icons/alcohol1`), marginX, doc.y, {
        width: doc.page.width - marginX * 2,
      });

      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Тестийн хэрэглээ, анхаарах зүйлс',
      );
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Хөгжүүлэлт: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Архи, согтууруулах ундааны хэрэглээг үнэлдэг олон төрлийн асуумж, үнэлгээний хэрэгслүүдийг судлаачид хөгжүүлсэн байдаг. Бидний одоо ашиглаж буй тест нь Дэлхийн Эрүүл Мэндийн Байгууллагын мэргэжилтнүүдийн боловсруулсан тест юм (WHO AUDIT) юм. Энэхүү тест нь олон улсад өргөн хэрэглэгддэг, найдвартай байдал болон үнэн зөв чанар нь олон судалгаагаар баталгаажсан стандарт аргад тооцогддог.\n\nМанай улсад Сэтгэцийн Эрүүл Мэндийн Үндэсний Төв (СЭМҮТ)-ийн эмч, судлаачид Монгол хувилбарыг нь хөгжүүлж, олон жилийн туршид практикт ашиглаж байна. Бид энэхүү тестийг СЭМҮТ-ийн судлаач нарын зөвшөөрөлтэйгөөр ашиглаж байгаа бөгөөд нэмэлт хөгжүүлэлтийг хийж гүйцэтгэсэн болно.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc.font(fontBold).fontSize(12).text('Анхаарах: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Уг тестийг мэргэжлийн сэтгэл засалч, сэтгэцийн эмчийн хяналт, зөвшөөрөлгүйгээр ямар ч нөхцөлд сэтгэл зүй болон сэтгэц судлалын оношилгоо, эмчилгээ хийх, зөвлөгөө өгөх байдлаар ашиглахад зориулаагүй! Зөвхөн эмчилгээ, үйлчилгээ эрхлэх зөвшөөрөлтэй, нарийн мэргэжлийн эмч л сэтгэцийн эмгэгийг оношилно. ',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fontSize(13)
        .text('Тестийн оноог зөв тайлбарлах')
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Уг сорил нь 10 асуулттай, 0-ээс 4 хүртэлх оноотой харгалзах сонголтуудтай. Нийт оноог тооцохдоо асуулт тус бүрт харгалзах оноог хооронд нь нэмнэ. Нийт 0–ээс 40 хүртэлх оноо авах боломжтой, оноо өндөр байх тусам архины хамаарал илүү хүчтэй байгааг илтгэнэ. Тухайлбал: Хэрэв та тест бөглөөд 13 оноо авсан бол энэ нь “Архи хэрэглэгч буюу аюултай хэрэглээний түвшин”-г зааж байгаа юм. Онооны системийн тайлбарыг дараах хүснэгтээс дэлгэрэнгүй харна уу.',
          { align: 'justify' },
        )
        .moveDown(1);

      const tableData = [
        ['Нийт оноо', 'Ангилал/тайлбар'],
        ['0 оноо', 'Согтууруулах ундаа огт хэрэглэдэггүй'],
        ['1-7 оноо', 'Архины хэрэглээний эрсдэл багатай'],
        ['8-15 оноо', 'Архи хэрэглэгч буюу аюултай хэрэглээний түвшин'],
        [
          '16-19 оноо',
          'Архи хэтрүүлэн хэрэглэгч буюу хортой үр дагавар өгөхүйц хэрэглээний түвшин',
        ],
        ['20-40 оноо', 'Архины хамааралтай гэж сэжиглэх түвшин'],
      ];

      const tableWidth = doc.page.width - 2 * marginX;
      const colWidths = [tableWidth * 0.3, tableWidth * 0.7]; // 30% / 70%
      const rowHeights = [18, 18, 18, 18, 36, 18];

      let startX = marginX;
      let currentY = doc.y;

      for (let row = 0; row < tableData.length; row++) {
        let x = startX;
        const rowHeight = rowHeights[row];

        for (let col = 0; col < tableData[row].length; col++) {
          const colWidth = colWidths[col];
          const text = tableData[row][col];

          doc
            .rect(x, currentY, colWidth, rowHeight)
            .strokeColor('black')
            .stroke();

          doc
            .font(row === 0 ? fontBold : fontNormal)
            .fontSize(12)
            .fillColor('black');

          const textHeight = doc.heightOfString(text, {
            width: colWidth - 10,
            align: 'center',
          });

          const textY = currentY + (rowHeight - textHeight) / 2;

          doc.text(text, x + 5, textY + 2, {
            width: colWidth - 10,
            align: 'center',
          });

          x += colWidth;
        }

        currentY += rowHeight;
      }

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Сорилын үр дүн');

      const results = [
        {
          name: 'Согтууруулах ундаа огт хэрэглэдэггүй',
          description:
            'Танд архи, согтууруулах ундааны хэрэглээтэй холбоотой ямар нэгэн асуудалтай байхгүйг илтгэж байна.\n\nАрхи, согтууруулах ундаа хэрэглэх дадал, зуршил маш амархан тогтож,  архины хамааралт байдал цаашид улам даамжрах эрсдэлтэй байдаг тул аль болох согтууруулах ундаа хэрэглэхгүй байх, хэрэглээгээ цаашид нэмэгдүүлэхгүй байхыг зөвлөж байна. Архи, согтууруулах ундааг хэрэглэхгүй байх, бага хэрэглэх нь та өөрийн эрүүл мэнддээ анхаарч, ирээдүйн амьдралдаа хийж буй хамгийн сайн хөрөнгө оруулалт юм.',
        },
        {
          name: 'Архины хэрэглээний эрсдэл багатай',
          description:
            'Танд архи, согтууруулах ундааны хэрэглээтэй холбоотой эрсдэл үүсэх магадлал харьцангуй бага байна.\n\nТаны архи, согтууруулах ундааны хэрэглээ одоогийн түвшнээс нэмэгдвэл аюултай хэрэглээний түвшинд шилжиж, эрүүл мэндэд хортой үр дагаврууд гарах, архинаас хамааралтай болох зэрэг эрсдэлүүд үүсэх аюултай байна.\n\nАрхи, согтууруулах ундаа хэрэглэх дадал, зуршил маш амархан тогтож,  архины хамааралт байдал цаашид улам даамжрах эрсдэлтэй байдаг тул аль болох согтууруулах ундаа хэрэглэхгүй байх, хэрэглээгээ цаашид нэмэгдүүлэхгүй байхыг зөвлөж байна. Архи, согтууруулах ундааг хэрэглэхгүй байх, бага хэрэглэх нь та өөрийн эрүүл мэнддээ анхаарч, ирээдүйн амьдралдаа хийж буй хамгийн сайн хөрөнгө оруулалт юм.',
        },
        {
          name: 'Архи хэрэглэгч буюу аюултай хэрэглээний түвшин',
          description:
            'Архи, согтууруулах ундааны хэт их хэрэглээ нь таны хувийн амьдрал болон эрүүл мэндэд ноцтой сөрөг үр нөлөө үзүүлэх, эрсдэл үүсгэх аюултай түвшинд хүрсэн байна. Энэ түвшний хэтрүүлэн хэрэглээ нь осол, гэмтэлд өртөх эрсдэлийг нэмэгдүүлэхээс эхлээд хүний биеийн олон чухал эд эрхтэн, эрхтэн тогтолцоонд сөргөөр нөлөөлж, хүнд өвчин эмгэг үүсгэх эрсдэлтэй. Та хэдийгээр санал нийлэхгүй байж болох ч энэ бол бодит үнэн бөгөөд өөрийн хэрэглээгээ эргэн харах, тунгаах цаг болсон байж магадгүй юм.\n\nТа цаашид эмч, сэтгэл зүйчээс согтууруулах ундааны хэрэглээгээ хэрхэн бууруулах талаар богино хугацааны зөвлөгөө, мэдээлэл авах нь зүйтэй. Энэ түвшинд архи, согтууруулах ундааг хэрэглэдэг хүмүүсийн ихэнх нь энгийн, практик аргуудыг ашиглан амжилттай хэрэглээгээ бууруулж чаддаг.\n\nАрхи, согтууруулах ундаа хэрэглэх дадал, зуршил маш амархан тогтож,  архины хамааралт байдал цаашид улам даамжрах эрсдэлтэй байдаг тул аль болох согтууруулах ундаа хэрэглэхгүй байх, хэрэглээгээ цаашид нэмэгдүүлэхгүй байхыг зөвлөж байна. Архи, согтууруулах ундааг хэрэглэхгүй байх, бага хэрэглэх нь та өөрийн эрүүл мэнддээ анхаарч, ирээдүйн амьдралдаа хийж буй хамгийн сайн хөрөнгө оруулалт юм.',
        },
        {
          name: 'Архи хэтрүүлэн хэрэглэгч буюу хортой үр дагавар өгөхүйц хэрэглээний түвшин',
          description:
            'Архи, согтууруулах ундааны хэт их хэрэглээ нь таны хувийн амьдрал болон эрүүл мэндэд ноцтой сөрөг үр нөлөө үзүүлэх, эрсдэл үүсгэх аюултай түвшинд хүрсэн байна. Энэ түвшний хэтрүүлэн хэрэглээ нь осол, гэмтэлд өртөх эрсдэлийг нэмэгдүүлэхээс эхлээд хүний биеийн олон чухал эд эрхтэн, эрхтэн тогтолцоонд сөргөөр нөлөөлж, хүнд өвчин эмгэг үүсгэх эрсдэлтэй. Та хэдийгээр санал нийлэхгүй байж болох ч энэ бол бодит үнэн бөгөөд өөрийн хэрэглээгээ эргэн харах, тунгаах цаг болсон байж магадгүй юм.\n\nТа цаашид эмч, сэтгэл зүйчээс согтууруулах ундааны хэрэглээгээ хэрхэн бууруулах талаар зөвлөгөө, мэдээлэл, тусламж үйлчилгээ авч, хяналтад орох шаардлагатай. Энэ түвшинд архи, согтууруулах ундааг хэрэглэдэг хүмүүсийн ихэнх нь богино хугацаанд зөвлөгөө авсны дараагаар хэрэглээгээ амжилттай бууруулж чаддаг.\n\nАрхи, согтууруулах ундаа хэрэглэх дадал, зуршил маш амархан тогтож,  архины хамааралт байдал цаашид улам даамжрах эрсдэлтэй байдаг тул аль болох согтууруулах ундаа хэрэглэхгүй байх, хэрэглээгээ цаашид нэмэгдүүлэхгүй байхыг зөвлөж байна. Архи, согтууруулах ундааг хэрэглэхгүй байх, бага хэрэглэх нь та өөрийн эрүүл мэнддээ анхаарч, ирээдүйн амьдралдаа хийж буй хамгийн сайн хөрөнгө оруулалт юм.',
        },
        {
          name: 'Архины хамааралтай гэж сэжиглэх түвшин',
          description:
            'Архи, согтууруулах ундааны хэт их хэрэглээ нь таны хувийн амьдрал болон эрүүл мэндэд ноцтой сөрөг үр нөлөө үзүүлэх, эрсдэл үүсгэх аюултай түвшинд хүрсэн, та архинаас хамааралтай болсон байж магадгүй байна. Энэ түвшний хэтрүүлэн хэрэглээ нь осол, гэмтэлд өртөх эрсдэлийг нэмэгдүүлэхээс эхлээд хүний биеийн олон чухал эд эрхтэн, эрхтэн тогтолцоонд сөргөөр нөлөөлж, хүнд өвчин эмгэг үүсгэх эрсдэлтэй. Та хэдийгээр санал нийлэхгүй байж болох ч энэ бол бодит үнэн бөгөөд өөрийн хэрэглээгээ эргэн харах, тунгаах цаг болсон байж магадгүй юм.\n\nАрхи, согтууруулах ундаа хэрэглэх дадал, зуршил маш амархан тогтож,  архины хамааралт байдал цаашид улам даамжрах эрсдэлтэй байдаг тул аль болох согтууруулах ундаа хэрэглэхгүй байх, хэрэглээгээ цаашид нэмэгдүүлэхгүй байхыг зөвлөж байна. Архи, согтууруулах ундааг хэрэглэхгүй байх, бага хэрэглэх нь та өөрийн эрүүл мэнддээ анхаарч, ирээдүйн амьдралдаа хийж буй хамгийн сайн хөрөнгө оруулалт юм.',
        },
      ];

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text('Таны үнэлгээний оноо ', marginX, doc.y, {
          continued: true,
        })
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(result.point.toString(), doc.x, doc.y - 3, { continued: true })
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(' буюу ', marginX, doc.y + 3, {
          continued: true,
        })
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(`${result.result.toString().toUpperCase()}`, doc.x, doc.y - 3, {
          continued: true,
        })
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text('-(ий)г илтгэж байна. ', marginX, doc.y + 3, {
          continued: false,
        })
        .moveDown(1);

      doc.x = marginX;

      doc
        .font(fontBold)
        .fontSize(12)
        .fillColor(colors.black)
        .text('Таны авсан оноо: ' + ' ', { continued: true })
        .font('fontBlack')
        .fillColor(colors.orange)
        .text(String(result.point), { continued: true })
        .fillColor(colors.black)
        .text('/' + String(40));

      doc.moveDown(-0.8);

      const buffer = await this.vis.bar(result.point, 40, 45, '');

      doc
        .image(buffer, {
          width: doc.page.width - marginX * 2,
          height: (130 / 1800) * (doc.page.width - marginX * 2),
        })
        .moveDown(3);

      const desc = results.find((res) => res.name === result.result);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(desc.description, startX, doc.y, {
          align: 'justify',
        })
        .moveDown(1);
      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Нэмэлт мэдээлэл, зөвлөмж');
      doc
        .font(fontBold)

        .fontSize(13)
        .fillColor(colors.black)
        .text(
          'Архи, согтууруулах ундааны хэрэглээний зохистой хэмжээ, стандарт хэрэглээ',
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Энэ нь ямар нэгэн өвчин эмгэггүй, эрүүл насанд хүрсэн хүн архи, согтууруулах ундааг 24 цагийн дотор хэрэглэж болох дээд хэмжээ юм. Учир нь эрүүл, насанд хүрсэн хүний элэг 1 цагийн дотор 10 гр спиртийг цэвэршүүлэн, хоргүйжүүлж, энэ нь 10-12 цагийн дараа гүйцэд биеэс бүрэн гадагшилдаг байна. Тэгвэл бид ихэвчлэн стандарт буюу аюулгүйн хэрэглээний хэмжээг давуулан биелүүлж байдаг. Жишээ нь: Та дотнын 1 найзтайгаа 1 шил /0.5литр/ цагаан архийг 2 цагийн дотор хувааж уужээ. Тэгвэл 2 хүн 10 хоногийнхоо хэрэгцээг нэг дор ууж, биеэ хордуулж байна гэсэн үг. ',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc.image(service.getAsset(`icons/alcohol2`), marginX, doc.y, {
        width: doc.page.width - marginX * 2,
      });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Архины зохистой хэрэглээ буюу стандарт хэмжээ нь архи согтууруулах ундааны спиртийн агууламжаас хамаарч хэмжээ нь өөр өөр байдаг. Стандарт уултын хэмжээ нь 1 удаад буюу 24 цаг дотор ууж хэрэглэхэд аюулгүй хэмжээ гэдгийг дахин сануулъя. Та найз нөхөд, ах дүүстэйгээ сархад зооглох болбол архи согтууруулах ундааныхаа төрлийг сонгон зохистой хэмжээгээр 1 удаа л захиалга хийж бага багаар шимэн таалан хэрэглэх нь хамгийн зөв зохистой, аюулгүй хэмжээ гэдгийг санаарай. Та дээрх зохистой уулт буюу стандарт хэмжээг хэтрүүлэн хэрэглэсний улмаас олон эрхтэн системийн хэвийн үйл ажиллагаа алдагдаж 60 гаруй эмгэг өөрчлөлтүүдийг бий болгоно.',
          marginX,
          doc.y + 360,
          { align: 'justify' },
        )
        .moveDown(1);
      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Нэмэлт мэдээлэл, зөвлөмж');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Архи, согтууруулах ундааны хэрэглээгээ бууруулах, хянахын тулд:',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Архи, согтууруулах ундааны хэрэглээгээ тооцоолох, тоо хэмжээг хэмжих, хянах',
            'Согтууруулах ундааны хэрэглэх давтамжаа багасгах, хэрэглээ хоорондын хугацааг уртасгах',
            'Согтууруулах ундаа хэрэглэх үедээ спирт агуулаагүй ус, ундаа сайн уух',
            'Архи, согтууруулах ундааны өмнө хоол, унд идэх',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(1);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Та сэтгэл тавгүй архи уумаар байгаа үедээ дараах аргуудаас хэрэглээд үзээрэй:',
          marginX,
          doc.y,
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Өнөөдөр л уухгүй гэж хойшлуул',
            'Дотнын танд тусалж чадах, таныг ойлгодог хэн нэгэнтэй ярилц',
            'Амьсгалын дасгал хий, өөрийгөө амраа',
            'Ямар нэгэн дасгал хөдөлгөөн, биеийн хүч шаардсан ажил хий',
            'Та архи ууснаар гэр бүл, ойр дотнын хүмүүсээ үргэлжийн сэтгэлийн зовлон, сэтгэл санааны хямралд оруулж байдаг гэдгийг санаарай.',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(1);

      doc.x = marginX;
      doc
        .font(fontBold)

        .fontSize(13)
        .fillColor(colors.black)
        .text('Эх сурвалж, ашигласан материал')
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'National Institute on Alcohol Abuse and Alcoholism. (2021). The cycle of alcohol addiction. National Institutes of Health. https://www.niaaa.nih.gov/publications/cycle-alcohol-addiction\n\nAUDITScreen.org (2026).. Reduce your drinking. https://auditscreen.org/reduce-your-drinking/',
          { align: 'justify' },
        );
      footer(doc);
    } catch (error) {
      console.log('alcohol', error);
    }
  }
}
