// import { Injectable } from '@nestjs/common';
// import { ExamEntity } from 'src/app/exam/entities/exam.entity';
// import { ResultDetailEntity } from 'src/app/exam/entities/result.detail.entity';
// import { ResultEntity } from 'src/app/exam/entities/result.entity';
// import {
//   colors,
//   fontBold,
//   fontNormal,
//   footer,
//   header,
//   info,
//   lh,
//   marginX,
//   title,
// } from 'src/app/exam/reports/formatter';
// import { SinglePdf } from 'src/app/exam/reports/single.pdf';
// @Injectable()
// export class Bigfive {
//   constructor(private single: SinglePdf) {}

//   public result(v: string) {
//     let res = {
//       name: '',
//       name_mn: '',
//       key: '',
//       description: '',
//       color: '',
//       fill: '',
//       icon: '',
//       image: '',
//       skills: '',
//       insight: '',
//     };

//     const value = v.toLowerCase();
//     if (value == 'гадагшаа чиглэсэн байдал') {
//       res = {
//         name: 'Extraversion',
//         name_mn: 'Гадагшаа чиглэсэн байдал (Экстроверт)',
//         key: 'E',
//         description:
//           'Экстроверт буюу гадагшаа чиглэсэн хэв шинжийн хүмүүс нь ихэвчлэн яриасаг, бусадтай нээлттэй, нийтэч, хүмүүсийн дунд байх, нийгэм, олон нийтийн үйл ажиллагаанд оролцох дуртай. Тэд хүмүүсийн дунд байхдаа эрч хүчтэй, өөдрөг, өөртөө итгэлтэй байдаг. Бусад хүмүүс ч мөн адил энэ төрлийн хүмүүсийг эрч хүч, энерги ихтэй, урам зориг, тэмүүлэл өндөртэй, өөртөө итгэлтэй хүмүүс гэж харж, тодорхойлдог. Энэ хэв шинж дээр өндөр оноо авсан хүмүүс мөн сэтгэлийг нь хөдөлгөсөн, хөөргөсөн төрөл бүрийн эрсдэлтэй үйлдэл хийх, зугаа цэнгэл хайх хандлагатай байдаг.\n\nХарин энэ хэв шинж дээр бага оноо авсан хүмүүс нь эсрэгээрээ интроверт буюу дотогшоо чиглэсэн зан төрхтэй байх хандлагатай байдаг. Тэд ганцаараа эсвэл цөөхөн хүмүүстэй хамт байхыг илүүд үздэг бөгөөд олон хүн цугласан арга хэмжээнд оролцох дургүй байдаг. Бусадтай харилцах үедээ мөн харьцангуй болгоомжлосон, дуу цөөтэй байх хандлагатай.Зарим судалгаагаар экстроверт хэв шинж нь ажлын гүйцэтгэл, нийгмийн дэмжлэг зэрэг олон хүчин зүйлтэй холбоотой байж болохыг илрүүлсэн. Тухайлбал экстроверт оноо өндөртэй хүмүүс нийгмийн, хүмүүсийн харилцаа ихээр шаарддаг ажил дээр илүү амжилт гаргах магадлал их байдаг. Мөн түүнчлэн тэд илүү өргөн найз нөхөд, танилын хүрээтэй байх бөгөөд бусадтай харьцуулахад хувийн сэтгэл ханамжийн түвшин харьцангуй өндөр байдаг ажээ.',
//         color: colors.steel,
//         fill: colors.steel,
//         icon: 'implementer',
//         image: 'r',
//         skills:
//           '• Багаж, техник технологи ажиллуулах\n• Загварчлах, зохион бүтээх, засварлах\n• Жолоодох, залах\n• Нарийн, жижиг, анхаарал шаардсан зүйлстэй ажиллах\n• Амьтан, ургамалтай харьцах',
//         insight:
//           'Гарын уртай хэв шинжийн хүмүүс илүү бодит практикт суурилсан, гарын ажиллагаа, ур дүй шаардсан ажил хийх сонирхолтой. Харин бичиг цаас болон хүмүүстэй ажиллах төдийлөн дуртай биш.\n\nГарын уртай төрлийн хүмүүсийн ихэвчлэн идэвхтэй, эрч хүчтэй, сэтгэлийн санааны хувьд тогтвортой зан төлөвтэй. Тэд ихэвчлэн машин техник, зүйлсийг  ажиллуулах, бүтээн босгох, угсрах, засварлах, загварчлах зэрэг гарын ажиллагаа, ур дүй шаардсан ажилд дуртай, ургамал, амьтадтай харьцах, биеийн хүч шаардсан дасгал хөдөлгөөн хийх болон гадаа орчинд ажиллах хүсэлтэй хүмүүс байдаг. Энэ төрлийн хүмүүсийн хувьд анги танхимд хичээл үзэхээс илүүтэй өөрийн бодит амьдрал дээрх туршлага дээр үндэслэн “хийж байж сурах” аргаар асуудалд ханддаг. Тэд өөрсдийгөө биеийн хүч, хөдөлмөр шалгасан ажил, спортод авьяастай, нарийн ур чадвар сайтай гэж тодорхойлдог. \n\nГарын уртай хэв шинжийн хүмүүсийн хувьд цаашид техник ур чадварыг нь дэмжин хөгжүүлэх, бодит үр дүнг бүх боломжтой ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө гар урлал, спорт, цэрэг, хамгаалалтын алба, барилга, төлөвлөлт, засвар, техникийн үйлчилгээ, ургамал/амьтантай ажиллах, өсгөн үржүүлэх болон гадаа орчин нөхцөлд ажиллах боломжтой ажлууд багтана.\n\nТохирох мэргэжлийн салбар, чиглэлүүд: инженерчлэл, техникч, цахилгаан электроник, барилга байгууламж, мужаан, зам тээвэр, машин механизмын ажиллагаа, хөдөө аж ахуй, газар тариалан, мал аж ахуй, малын эмч, төрөл бүрийн спорт болон цэрэг, хамгаалалтын алба гэх мэт орно. \n\nХолбогдох хичээл, салбарууд: Хөдөлмөр, технологи, хөдөө аж ахуй, газар тариалан, цэцэрлэгжүүлэлт, математик, алгебр, геометр, бизнес, физик.',
//       };
//     }
//     if (value == 'нийтэч байдал') {
//       res = {
//         name: 'Openness',
//         name_mn: 'Нөхөрсөг байдал',
//         key: 'I',
//         description: 'Судалгаа шинжилгээ, оюуны хөдөлмөр илүү шаардсан ажил',
//         color: colors.sun,
//         fill: colors.sun,
//         icon: 'plant',
//         image: 'i1',
//         skills:
//           '• Мэдээллийг адлан шинжлэх, нэгтгэн дүгнэх\n• Логик сэтгэлгээ\n• Тооцоолох, бодох\n• Шүүн тунгаах, оношлох\n• Судалж шинжлэх, туршилт явуулах',
//         insight:
//           'Судлаач хэв шинжийн хүмүүс нь сэтгэн бодох, оюуны хүч шаардсан ажил хийх илүү сонирхолтой. Харин эсрэгээрээ биеийн хүчний хөдөлмөр оролцсон эсвэл удирдан чиглүүлэх төрлийн ажилд ихэвчлэн дур сонирхол бага. \n\nСудлаач хэв шинжид голдуу мэдээллийг задлан шинжлэх, нэгтгэн дүгнэх чадвар өндөр, логик болон шүүмжлэлт сэтгэлгээ сайн, оюуны чадвар өндөртэй, гярхай ажиглагч зан төлөвтэй хүмүүс багтдаг. Тэд шинжлэх ухааны талаар уншиж судлах дуртай, тоо баримт дээр ажиллах, юмс үзэгдлийн учир шалтгаан, холбоо хамаарлыг судалж ойлгох, судалгаа, эрдэм шинжилгээний ажил хийж гүйцэтгэх сонирхолтой. Хийсвэр, нарийн төвөгтэй асуудлыг ухаж ойлгох, шийдвэрлэх нь зарим хүнд хэцүү санагддаг бол судлаач хэв шинжийн хувьд харин ч эсрэгээрээ хийх дуртай зүйлс нь юм. Тэд мэдлэг боловсрол, шинжлэх ухааныг эрхэмлэн үздэг бөгөөд өөрсдийгөө илүү мэдлэгтэй, судалгаа хийж гүйцэтгэх, тооцоолох, статистик чадвар сайтай гэж тодорхойлдог. \n\nСудлаач хэв шинжийн хүмүүсийн хувьд судалгаа шинжилгээний ажлын ур чадварыг нь дэмжиж, сайжруулах, шинэ санаа дэвшүүлэх, анхаарлаа төвлөрүүлэх, бие даан ажиллах боломжоор нь хангасан ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө амьд бус зүйлсээс эхлээд амьд амьтан организм, өвчин эмгэг, хүний зан төрх, сэтгэл судлалыг судлах, шинжлэх ажлууд орно. \n\nХолбогдох хичээл, салбарууд: Математик/статистик, мэдээллийн технологи, эрүүл мэндийн тусламж үйлчилгээ, анагаах ухаан, биологи, амьтан болон ургамал судлал, нийгмийн шинжлэх ухаан, физик.',
//       };
//     }
//     if (value == 'тогтвортой байдал') {
//       res = {
//         name: 'Neuroticisim',
//         name_mn: 'Сэтгэлийн тогтвортой байдал (Невротизм)',
//         key: 'A',
//         description: 'Урлаг, уран сайхан, бүтээлч сэтгэлгээ шаардсан ажил',
//         color: colors.rust,
//         fill: colors.rust,
//         icon: 'shaper',
//         image: 'a1',
//         skills:
//           '• Бүтээлч, шинийг санаачлах\n• Дүрслэх, төсөөлөх бодох\n• Урлаг, гоо зүйн мэдрэмж, өвөрмөц авьяас\n• Өөрийгөө илэрхийлэх, тайлагнах',
//         insight:
//           'Уран бүтээлч хэв шинжийн хүмүүс жүжиглэх, хөгжимдөх, зураг зурах,  загвар зохион бүтээх зэрэг урлагийн талын ажилд илүү дур сонирхолтой.\n\nЭнэ хэв шинжид тохирох хүмүүс уран сэтгэмж, зөн совингийн мэдрэмж өндөр, уян хатан, мэдрэмтгий зан төлөвтэй. Тэд ихэвчлэн бүтээлч, шинэлэг байдлыг эрэлхийлдэг, тогтсон хэв загварт баригдах дургүй, сонин содон, өвөрмөц зүйлс дуртай, зохиол бичих, жүжиг туурвих, дуулах, бүжиглэх зэрэг төрөл бүрийн урлаг соёлтой холбоотой ажилд дуртай. Тэд гоо зүйг илүүд эрхэмлэж үздэг бөгөөд өөрсдийгөө бүтээлч, чөлөөт сэтгэлгээтэй, хөгжим, бичих, жүжиглэх зэрэг урлагийн өвөрмөц авьяас чадвартай гэж тодорхойлдог. Ажил, бүтээлээрээ дамжуулан өөрсдийгөө бусдад, нийгэмд илэрхийлэхийг эрэлхийлдэг. \n\nУран бүтээлч хэв шинжийн хүмүүсийн хувьд төсөөлөх, шинийг санаачлах, бүтээлч чадвараа хөгжүүлэх боломжоор нь хангасан, чөлөөтэй ажлын орчин нөхцөл чухал. Энэ төрөлд ерөнхийдөө хөгжимчин, сэтгүүлч, барималчин, жүжигчин, зохиолч, загвар зохион бүтээгч, зураглаач, үсчин, график дизайнер, интерьер дизайн төлөвлөгч, төрөл бүрийн засал чимэглэлтэй холбоотой мэргэжил, хүлээн авалтын зохицуулагч зэрэг ажлууд орно.\n\nХолбогдох хичээл, салбарууд: Дүрслэх урлаг, график дизайн, хэл судлал, тайзны урлаг, хөгжим, уран зохиол, тогооч, хүнс судлал, нийгмийн шинжлэх ухаан, сэтгүүл зүй.',
//       };
//     }
//     if (value == 'хариуцлагатай байдал') {
//       res = {
//         name: 'Social',
//         name_mn: 'Хариуцлагатай байдал',
//         key: 'S',
//         description:
//           'Хүмүүс, олон нийтэд чиглэсэн ажилд сонирхолтой; бусдад туслах, үйлчлэх ажил',
//         color: colors.leaf,
//         fill: colors.leaf,
//         icon: 'teamworker',
//         image: 's',
//         skills:
//           '• Хүмүүст заах, багшлах\n• Зөвлөгөө өгөх\n• Тусламж, үйлчилгээ үзүүлэх\n• Харилцааны ур чадвар\n• Багаар ажиллах',
//         insight:
//           'Нийгмийн идэвхтэй хэв шинжийн хүмүүс нь бусад хүмүүстэй ажиллаж, тэдэнд туслах дуртай. Харин эсрэгээрээ эд зүйлс, техник технологи, хийсвэр мэдээлэлтэй ажиллахаас зайлсхийх хандлагатай. \n\nНийгмийн идэвхтэй хэв шинжид ихэвчлэн хүмүүнлэг энэрэнгүй, нөхөрсөг, тусч, нийтэч, бусдын сайн сайхны төлөө ажиллах хүсэл эрмэлзэл, зан төлөвтэй хүмүүс багтдаг. Тэд хүмүүс хоорондын болон нийгмийн харилцааг илүү анхаарч сонирхдог. Энэ төрлийн хүмүүс бусадтай харилцаж ойлголцох, бусдад зааж зөвлөх, бусдад туслах, дэмжлэг үзүүлэх ажил хөдөлмөрөөс аз жаргал, сэтгэл ханамж авдаг. Ихэнхдээ багаар ажиллах боломжийг эрэлхийлж, харилцааны ур чадвараа ашиглан асуудлыг зөвшилцөж шийдвэрлэхийг эрмэлздэг. Энэ хэв шинжийн хүмүүс өөрсдийгөө голдуу бусдыг сайн ойлгодог, тусч, бусдад заах, багшлах ур чадвар сайтай гэж тодорхойлдог.\n\nНийгмийн идэвхтэй хэв шинжийн хүмүүсийн хувьд багаар ажиллах, бусадтай санал бодлоо солилцох боломжоор хангасан ажлын орчин нөхцөл илүү тохиромжтой. Энэ төрөлд ерөнхийдөө багш, зөвлөгч, боловсролын байгууллагын ажилтан, лам/шашны байгууллагын ажилтан, нийгмийн ажилтан, эрүүл мэндийн ажилтан, нийгмийн эрүүл мэнд судлаач, нийгэм судлаач, хүмүүнлэг, тусламжийн байгууллагын ажилтан, хүний нөөцийн мэргэжилтэн зэрэг ажлууд орно. \n\nХолбогдох хичээл, салбарууд: Нийгэм судлал, эрүүл мэнд, анагаах ухаан, нийгмийн эрүүл мэнд, урлаг судлал.',
//       };
//     }
//     if (value == 'сониуч байдал') {
//       res = {
//         name: 'Enterprising',
//         name_mn: 'Санаачлагч',
//         key: 'E',
//         description:
//           'Удирдах, манлайлах, бусдад нөлөөлөл үзүүлэх чиглэлийн ажил',
//         color: colors.brown,
//         fill: colors.brown,
//         icon: 'completer',
//         image: 'e',
//         skills:
//           '• Бусдад нөлөөлөх, удирдах, манлайлах\n• Зохион байгуулах\n• Шийдвэр гаргах\n• Эрсдэл хүлээх\n• Худалдах, борлуулах\n• Ятгах, сурталчилах',
//         insight:
//           'Санаачлагч хэв шинжийн хүмүүс бизнес эхлүүлэх, хөгжүүлэх, хэрэгжүүлэх, удирдах манлайлах чиглэлийн ажил үйлсэд дуртай. Аливаа зүйлийн талаар удаан хугацаагаар бодохоос илүү санаагаа шууд ажил хэрэг болгохыг илүүд үздэг.\n\nСанаачлагч хэв шинжтэй хүмүүс ерөнхийдөө эрч хүчтэй, урам зориг тэмүүлэлтэй, өөртөө итгэлтэй, адал явдалд дуртай, эрсдэл гаргах, шийдвэр гаргахаас айдаггүй, нийтэч зан төрхтэй байдаг. Тэд бусдад нөлөөлөх, өөртөө ятгаж итгүүлэх, гэрээ хэлэлцээ, борлуулалт хийх, зохион байгуулах, олны өмнө үг хэлэх, илтгэх, удирдан манлайлах зэрэг бусадтай харилцах харилцааны өндөр ур чадвартай. Энэ чадвараа ашиглан зорилгодоо хүрэх, ашиг олохдоо гаргууд сайн бөгөөд маркетинг, борлуулалт, удирдлага, улс төрийн ажилд илүү дуртай. Тэд өөрсдийгөө эрч хүч ихтэй, өөртөө итгэлтэй, бусдыг удирдах чадвартай, уран илтгэх чадвартай гэж тодорхойлдог.\n\nСанаачлагч хэв шинжийн хүмүүсийн хувьд удирдлага, менежмент, худалдаа, маркетингийн чиглэлээр үйл ажиллагаа эрхлэх, шийдвэр гаргах, үр дүнд эсвэл эрх мэдэл, санхүү, албан тушаал хувьд ахин дэвших, урамшуулал авах боломжоор хангасан ажлын орчин нөхцөл илүү тохирно. Энэ төрөлд ерөнхийдөө удирдлага, менежментийн түвшний ажлуудаас гадна бизнес, банк санхүү, үйлдвэрлэл, үйлчилгээ, маркетинг/сургалт сурталчилгаа, улс төр, хууль эрх зүйн чиглэлийн ихэнх ажил, мэргэжлүүд орно. \n\nХолбогдох хичээл, салбарууд: Нийгэм судлал, улс төр, бизнес санхүү менежмент, эдийн засаг, худалдаа үйлдвэрлэл, математик/алгебр.',
//       };
//     }
//     return res;
//   }

//   async template(
//     doc: PDFKit.PDFDocument,
//     result: ResultEntity,
//     firstname: string,
//     lastname: string,
//     exam: ExamEntity,
//   ) {
//     header(doc, firstname, lastname);
//     title(doc, result.assessmentName);
//     info(doc, exam.assessment.author, exam.assessment.description);
//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .lineGap(lh.md)
//       .fillColor(colors.black)
//       .text(
//         'Та өмнө нь яагаад өөрийгөө олон хүн цугласан газраас эрч хүч авдаг вэ? Эсвэл ягаад ганцаараа кофе уунгаа дуртай номоо уншиж суух нь танд илүү дулаахан таатай мэдрэмж өгдөг вэ? гэж эргэцүүлж байсан уу? Зарим хүн яагаад бүхнийг төлөвлөж байж сая нэг санаа амардаг байхад, харин зарим нь яагаад бүхнийг сүүлчийн мөчид амжуулж хийхийг илүүд үздэг юм бол?\n\nҮнэндээ таны өдөр тутамдаа хийдэг эдгээр үйлдлүүд нь огт санамсаргүй тохиолдлын чанартай биш, харин үүний цаана сайтар судлагдсан сэтгэл зүйн онол, загварууд, хувь хүний төрлүүд оршин байдаг. Олон арван жилийн туршид эрдэмтэд, сэтгэл судлаачид хүний зан авир, хэл яриа, үг үйлдлүүдийг судалсны эцэст бүх хүмүүсийг дотор нь таван хэсэгт хувааж, хүний ерөнхий зан авир, шинж төрхийг нь тайлбарлах боломжтойг нээн илрүүлснээр, үндсэн 5-н хувь хүний хэв шинжийн онол (Big 5) бий болжээ. ',
//         marginX,
//         doc.y,
//         {
//           align: 'justify',
//         },
//       )
//       .moveDown(1);
//     doc.font(fontBold).fontSize(13).text('Тестийн тухай').moveDown(0.5);

//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Үндсэн 5-н хэв шинжийн онол нь дэлхий даяар хамгийн түгээмэл хэрэглэгддэг, маш сайн судлагдаж, батлагдсан, хувь хүний зан төрхийн өвөрмөц онцлог, хэв шинжийг судлахад ашиглагддаг онол загвар юм. Сэтгэл судлаачид хүний зан төрхтэй холбоотой өвөрмөц үг, үйлдлүүдийг статистикийн аргаар нарийвчлан судалж, хоорондоо ижил төстэй байдлаар нь бүлэглэхэд, энэхүү үндсэн таван хэв шинж бүх судалгаанд дахин дахин ялгаран гарч иржээ. Эдгээр таван хэв шинж нь:',
//         { align: 'justify' },
//       )
//       .moveDown(0.5);
//     doc
//       .list(
//         [
//           'Гадагшаа чиглэсэн байдал (Экстроверт) - Эрч хүчтэй, бусад хүмүүстэй хамтрах дуртай, бусдыг манлайлах, удирдах дуртай, нийгмийн идэвхтэй;',
//           'Нөхөрсөг байдал - Бусдад санаа тавьдаг, эелдэг нөхөрсөг, эв нэгдлийг эрхэмлэгч, өрсөлдөөнөөс зайлсхийгч, нийцтэй таарамжтай байдлыг эрхэмлэгч;',
//           'Хариуцлагатай байдал - Хариуцлагатай, дэг журамтай, зарчимч, эмх цэгц, зохион байгуулалтыг эрхэмлэгч, нарийн жижиг зүйлстэй ажиллах дуртай;',
//           'Сэтгэлийн тогтвортой байдал (Невротизм) - Амархан сэтгэл хөдөлдөг, стресст өртөхдөө амархан, сэтгэлээр унах, уурлаж бухимдахдаа хурдан;',
//           'Сониуч байдал — Сониуч зантай, шинийг туршигч, шинэ санаа санаачлагд нээлттэй,  хийсвэрлэх, төсөөлөн бодох чадвар өндөр, оюуны хүч шавхсан ажилд дуртай.',
//         ],
//         doc.x + 20,
//         doc.y,
//         {
//           align: 'justify',
//           bulletRadius: 1.5,
//           columnGap: 8,
//         },
//       )
//       .moveDown(0.5);

//     footer(doc);
//     doc.addPage();
//     header(doc, firstname, lastname, 'Тестийн хэрэглээ, анхаарах зүйлс');

//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Эдгээр таван хэв шинжийн аль нэг нь сайн, эсвэл аль нэг нь муу гэсэн ойлголт огт байхгүй. Энэхүү сорилын гол зорилго нь таныг өөрийн өвөрмөц зан төлөвийг тодорхойлж, өөрийгөө илүү сайн, зөвөөр ойлгоход туслах юм. Одоо үндсэн 5-н хэв шинжийн сорил таны талаар юу өгүүлж буйг хамтдаа харцгаая!',
//         marginX,
//         doc.y,
//         { align: 'justify' },
//       )
//       .moveDown(1);
//     doc.font(fontBold).fontSize(13).text('Хөгжүүлэлт').moveDown(0.5);
//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Үндсэн 5-н хэв шинжийг илрүүлэх олон төрлийн тестийн хувилбаруудыг судлаач нар хөгжүүлссэн байдаг.  Бидний одоо ашиглаж буй тест нь доктор Л. Голдберг (1992)-ын боловсруулсан 50 асуулт бүхий олон улсад хамгийн түгээмэл хэрэглэгддэг, сайтар судлагдсан тестийн хувилбар юм (IPIP  BFFM).',
//         { align: 'justify' },
//       )
//       .moveDown(1);
//     doc.font(fontBold).fontSize(13).text('Нарийвчлал').moveDown(0.5);
//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Тестийн оноо, үр дүн нь сайн нарийвчлалтай гарах хэдий ч хэрэв таны оноо хамгийн бага эсвэл хамгийн өндөр тоон утгатай ойр байх үед тестийн нарийвчлал харьцангуйгаар багасна.',
//         { align: 'justify' },
//       )
//       .moveDown(1);
//     doc.font(fontBold).fontSize(13).text('Анхаарах').moveDown(0.5);
//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Уг тестийг ямар ч нөхцөлд сэтгэцийн эмгэгийн оношилгоонд ашиглаж болохгүй. Зөвхөн эмчилгээ, үйлчилгээ эрхлэх зөвшөөрөлтэй, нарийн мэргэжлийн эмч л сэтгэцийн эмгэгийг оношлоно. Тестийн үр дүнд суурилж мэргэжлийн сэтгэл зүй, сэтгэц судлалын зөвлөгөө өгөхгүй байхыг анхаарна уу!',
//         { align: 'justify' },
//       )
//       .moveDown(1);
//     footer(doc);
//     doc.addPage();
//     header(doc, firstname, lastname, 'Сорилын үр дүн');
//     doc
//       .font(fontNormal)
//       .fontSize(12)
//       .fillColor(colors.black)
//       .text(
//         'Үндсэн 5-н хэв шинж тус бүрд харгалзах дундаж оноог тооцоолж графикт үзүүлэв. Хамгийн өндөр оноо (50 оноо) бүхий хэв шинж нь таны хувь хүний үндсэн гол зан төрхийг илэрхийлж буй бол дараа дараагийн хамгийн өндөр оноо бүхий хэв шинж нь таны үг, үйлдэл, зан төрхөд хамгийн их нөлөөлж буй дараачийн хэв шинжүүдийг заана.',
//         { align: 'justify' },
//       );
//     const details: ResultDetailEntity[] = result.details;
//     const indicator = [];
//     const data = [];
//     const results = [];
//     const max = details.reduce(
//       (max, obj) => (parseInt(obj.value) > parseInt(max.value) ? obj : max),
//       details[0],
//     );

//     for (const detail of details) {
//       const result = this.result(detail.value);
//       indicator.push({
//         name: result.name,
//         max: +max.cause,
//         key: result.key, // <-- add this line
//       });
//       data.push(+detail.cause);
//       results.push({ ...result, point: +detail.cause, value: detail.value });
//     }

//     let y = doc.y;
//     const pie = await this.vis.createRadar(indicator, data);
//     let png = await sharp(pie)
//       .flatten({ background: '#ffffff' }) // ил тод байдал → цагаан дэвсгэр
//       .png({ progressive: false }) // interlaceгүй, pdfkit-д найдвартай
//       .toBuffer();
//     doc.image(png, 75, y - 3, {
//       width: doc.page.width - 150,
//     });

//     doc.y += (doc.page.width / 425) * 310 - 150;
//   }
// }
