import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity, ResultDetailEntity } from 'src/entities';
import {
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { SinglePdf } from '../single.pdf';
import { VisualizationService } from '../visualization.service';
import { AssetsService } from 'src/assets_service/assets.service';
const sharp = require('sharp');

interface Result {
  name: string;
  description: string;
  image: string;
  intro: string;
  list: string;
  case1: string;
  case2: string;
  case3: string;
  case4: string;
}
@Injectable()
export class Burnout {
  constructor(
    private single: SinglePdf,
    private vis: VisualizationService,
  ) {}

  public result(v: string) {
    let res: Result = {
      name: '',
      description: '',
      image: '',
      intro: '',
      list: '',
      case1: '',
      case2: '',
      case3: '',
      case4: '',
    };

    const value = v.toLowerCase();
    if (value == 'хувь хүнтэй холбоотой') {
      res = {
        name: 'Хувь хүнтэй холбоотой',
        description:
          'Удаан хугацааны туршид үргэлжилсэн ерөнхий ядарч цуцсан, халшрах байдал (тодорхой шалтгаанаас үл хамаарах)',
        image: 'burnout1',
        intro:
          'Хувь хүнтэй холбоотой ажлаас халшрах байдал нь тодорхой өвөрмөц шалтгаан, нөхцөл байдлаас үл хамаарах өдөр тутмын стресс, бухимдлууд таны бие махбод, сэтгэл санааны байдал, цаашлаад ажлын бүтээмж, гүйцэтгэл, карьерт хэрхэн нөлөөлж буйг тодорхойлж, илүү ойлгомжтой дүр зургийг ерөнхий байдлаар харуулна.\n\nЭнэ хэсэгт бид амьдралд тохиолдох төрөл бүрийн стрессийг авч үзэж болно. Тухайлбал: ажил, гэр бүл, хамаатан садан, гэрлэлт, үерхэл, найз нөхөд, эрүүл мэнд, өвчин эмгэг, санхүүгийн байдал зэрэг олон төрлийн стрессийн шалтгаанууд энд багтана. \n\nХэрэв энэ бүлэгт өндөр оноо авсан бол дараах аргуудыг хэрэглэж үзээрэй:',
        list: '• Өөрийн эрүүл мэнд, сэтгэл санааг анхаарах нь чухал зүйл гэдгийг сайтар эргэцүүлэх, ойлгох\n• Өдөр тутмын жижиг өөрчлөлтөөс эхлэх, өөртөө цаг гаргах (10 минут завсарлах, алхах, сунгалтын дасгал хийх, бясалгах гэх мэт)\n• Хувийн зохион байгуулалт, цаг төлөвлөлтөө сайжруулах\n• Сошиал медиа, цахим хэрэглээгээ хязгаарлах\n• Ядаж нэг сонирхдог зүйл, хоббигоо тодорхойлж, тэр зүйлдээ тогтмол цаг гаргаж, хичээллэх\n• Өөрчилж, сайжруулахыг хүсэж буй нэг дадал зуршлыг сонгож, төвлөрөх (нойр, дасгал хөдөлгөөн, эрүүл хооллолт, хорт зуршил гэх мэт)\n• Шаардлагатай бол цаашид мэргэжлийн зөвлөгөө, дэмжлэг авах',
        case1:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд ажлаас халшрах ямар нэгэн шинж тэмдэг илрээгүй байна. Цаашид сэтгэл санаа, эрүүл мэнддээ анхаарч, энэ хэвээрээ сайн, эрч хүчтэй ажиллаарай.',
        case2:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд дунд түвшний ажлаас халшрах хам шинжийг илтгэж байна. 50 болон түүнээс дээш оноо авсан асуултуудыг тэмдэглээд, танд хамгийн их сөрөг мэдрэмж үүсгэсэн асуултуудын талаар дахин эргэцүүлж бодоорой. Танд энэхүү сөрөг мэдрэмж үүсгэх болсон онцгой шалтгаан, хүчин зүйлс, нөхцөл байдлуудыг жагсааж бичээд, эргэцүүлэн бодоорой. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргэх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case3:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Цаашид хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүд, мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авч болно. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case4:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд маш өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүдтэйгээ ярилцаж, дэмжлэг авч болно.\n\nЦаашид мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авахыг санал болгож байна.\n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай.',
      };
    }
    if (value == 'ажилтай холбоотой') {
      res = {
        name: 'Ажилтай холбоотой',
        description:
          'Ажил мэргэжил, ажлын орчин нөхцөл, дарамт, хэт ачаалал, ажлын стресстэй холбоотой үүссэн бие махбод болон сэтгэл санааны хувьд ядарч цуцсан, халирах байдал.',
        image: 'burnout2',
        intro:
          'Энэ бүлэгт ажлын байран дээрх стрессийг тусгайлан авч үзэж, бие махбод, сэтгэл санаа, ажлын бүтээмж, гүйцэтгэлд үзүүлэх нөлөөллийг нь хэмжсэн. \n\nЭнэ хэсэгт бид ажлын хэт ачаалал, ажлын зохион байгуулалт, үүрэг даалгаврын ойлгомжтой байдал, ажлын орчны эмх цэгцтэй байдал, ажлын орчин дахь дарамт шахалт, ажил дээрээ үнэлэгдэх байдал зэрэг олон төрлийн ажлын стрессийн шалтгаанууд энд багтана. Энэ бүлэгт өндөр авах нь ажил мэргэжилтэй холбоотой асуудал, бэрхшээлүүдээс болж ядарч сульдаж, тэмүүлэл, урам зоригоо алдаж байж магадгүйг илтгэнэ. \n\nХэрэв энэ бүлэгт өндөр оноо авсан бол дараах аргуудыг хэрэглэж үзээрэй: ',
        list: '• Илүү хэрэгжих боломжтой бодит зорилго, төлөвлөгөө гаргах\n• Ажлуудаа жижиг хэсгүүдэд хуваах\n• Ажил болон хувийн амьдрал хоёрын хоорондох заагийг тодорхойлох\n• Ажил, үүрэг даалгавруудаа чухал байдлаар нь эрэмбэлэх, нэн чухал ажил дээр илүүтэй төвлөрөх\n• Зарим ажлаа бусдад даалгах, ажлаа зөв хуваарилах\n• Өөрт ноогдсон ажлын ачаалал, үүрэг даалгаврын талаар удирдлага, багын гишүүдтэйгээ ярилцах, ойлголцох\n• Шаардлагатай үед нэмэлт үүрэг даалгавар авахаас соёлтойгоор татгалзаж сурах',
        case1:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд ажлаас халшрах ямар нэгэн шинж тэмдэг илрээгүй байна. Цаашид сэтгэл санаа, эрүүл мэнддээ анхаарч, энэ хэвээрээ сайн, эрч хүчтэй ажиллаарай.',
        case2:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд дунд түвшний ажлаас халшрах хам шинжийг илтгэж байна. 50 болон түүнээс дээш оноо авсан асуултуудыг тэмдэглээд, танд хамгийн их сөрөг мэдрэмж үүсгэсэн асуултуудын талаар дахин эргэцүүлж бодоорой. Танд энэхүү сөрөг мэдрэмж үүсгэх болсон онцгой шалтгаан, хүчин зүйлс, нөхцөл байдлуудыг жагсааж бичээд, эргэцүүлэн бодоорой. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргэх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case3:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Цаашид хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүд, мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авч болно. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case4:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд маш өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүдтэйгээ ярилцаж, дэмжлэг авч болно.\n\nЦаашид мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авахыг санал болгож байна.\n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай.',
      };
    }
    if (value == 'харилцагч/үйлчлүүлэгчтэй холбоотой') {
      res = {
        name: 'Харилцагч/үйлчлүүлэгчтэй холбоотой',
        description:
          'Харилцагч/үйлчлүүлэгчтэй ажиллахтай холбоотой үүссэн стресс, бие махбод болон сэтгэл санааны хувьд ядарч цуцсан, халшрах байдал.',
        image: 'burnout3',
        intro:
          'Энэ бүлэгт харилцагч, үйлчлүүлэгчтэй холбоотой эсвэл таны оролцоотой асаргаа сувилгаа, дэмжлэг шаардлагатай өдөр тутмын стресс, бухимдлыг тусгайлан авч үзэж, хэмждэг. \n\nЭнэ төрлийн стресс, ажлаас халшрах байдал нь эрүүл мэнд, асаргаа сувилал, цэцэрлэг боловсрол, худалдаа үйлчилгээний салбар болон бусад хүмүүстэй ойлголцох, тэдэнд туслах, үйлчлэх үйлчилгээ үзүүлдэг бүх төрлийн ажил мэргэжилтэй хүмүүст харьцангуй түгээмэл илэрдэг.\n\nХэрэв энэ чиглэлд өндөр оноо авсан бол ажил дээр хүмүүстэй харилцах харилцаанд асуудал, бэрхшээл үүссэн, эсвэл энэ чиглэлийн үүрэг даалгавар хэт ихэссэнээс таны бие махбод, сэтгэл санаанд сөрөг үр нөлөө үзүүлж байгааг илтгэнэ.\n\nХэрэв энэ бүлэгт өндөр оноо авсан бол дараах аргуудыг хэрэглэж үзээрэй: ',
        list: '• Харилцагч, үйлчлүүлэгчтэй харилцах харилцаандаа тодорхой зааг тавих\n• Асуудлыг шийдвэрлэхийн тулд хамт ажиллаж буй ажилчид, зөвлөх, удирдагч, менежерээсээ дэмжлэг, зөвлөгөө авах\n• Шаардлагатай үед “үгүй” гэж хэлж сурах. Таны эрүүл мэнд хамгийн чухал гэдгийг ойлгож, эргэцүүлэх.',
        case1:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд ажлаас халшрах ямар нэгэн шинж тэмдэг илрээгүй байна. Цаашид сэтгэл санаа, эрүүл мэнддээ анхаарч, энэ хэвээрээ сайн, эрч хүчтэй ажиллаарай.',
        case2:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд дунд түвшний ажлаас халшрах хам шинжийг илтгэж байна. 50 болон түүнээс дээш оноо авсан асуултуудыг тэмдэглээд, танд хамгийн их сөрөг мэдрэмж үүсгэсэн асуултуудын талаар дахин эргэцүүлж бодоорой. Танд энэхүү сөрөг мэдрэмж үүсгэх болсон онцгой шалтгаан, хүчин зүйлс, нөхцөл байдлуудыг жагсааж бичээд, эргэцүүлэн бодоорой. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргэх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case3:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Цаашид хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүд, мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авч болно. \n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай. ',
        case4:
          'Таны тест бөглөсөн үр дүнг үнэлэхэд маш өндөр түвшний ажлаас халшрах хам шинж байж магадгүйг илтгэж байна. Та цаашид ажил, амьдралын тэнцвэрээ хадгалах, өөрийн хувийн амьдрал болон ажлын нөхцөл байдал, ажлын ачааллынхаа талаар ямар нэгэн өөрчлөлт хийхгүй бол архаг стресс, сэтгэл гутралд орох эрсдэлтэй байна. Цаашид стресс бууруулах, арилгах менежментийн аргуудад суралцаж, өдөр тутамдаа хэрэглэж, хэвшүүлж болно. Хэрэв боломжтой бол менежер, ахлах ажилтантайгаа ярилцаж, илүү тодорхой үйл ажиллагааны төлөвлөгөө гаргах эсвэл ажлын ачааллаа бууруулах зэрэг арга замуудын талаар ярилцаж болох юм. Хамтран ажиллагчид, найз нөхөд, гэр бүлийн гишүүдтэйгээ ярилцаж, дэмжлэг авч болно.\n\nЦаашид мэргэжлийн сэтгэл судлаачтай холбогдож зөвлөгөө, туслалцаа авахыг санал болгож байна.\n\nӨөрийн бие махбод болон сэтгэл санаандаа дахин сэргээх цаг гаргаж, өөрийн эрүүл мэнддээ анхаарлаа хандуулаарай.',
      };
    }

    return res;
  }

  async template(
    doc: PDFKit.PDFDocument,
    service: AssetsService,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    try {
      header(doc, firstname, lastname, service);
      title(doc, service, result.assessmentName);
      info(
        doc,
        service,
        exam.assessment.author,
        exam.assessment.description,
        exam.assessment.measure,
        exam.assessment.usage,
      );
      doc.font(fontBold).fontSize(13).text('Оршил').moveDown(0.5);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажлаа хийхээс халширсан уу? эсвэл хэт их ажлын ачааллаас болж ядарсан уу?\n\nӨдрийн 15 цаг болж байхад та аль хэдийн гурав дахь аяга кофегоо уух эсэх талаар бодож сууна. Хийх ёстой ажлууд уул овоо шиг их, ажлын цаг дуусах болоогүй хэдий ч та ядарсан, сэтгэл санааны хувьд энэ өдрийг дуусгахад аль хэдийн бэлэн болсон байна. Энэ бүгд ердөө тур зуурын ажлын ачаалал, ажлаа хийгээд дуусахад бүх зүйл эргээд хэвийн байдалдаа орно гэж та өөртөө хэлэх ч, яг үнэндээ ийм байдалтай олон өдөр хоногийг өнгөрсөн байх үед...\n\nЯдарч туйлдсан, сэтгэл санаагаар унасан байдалтай удаан хугацаагаар явах нь зүгээр ч нэг ажил их байгаа, тур зуур залхуурсан, ядарсан хэрэг биш харин илүү ноцтой асуудал болох ажлаас халшрах хам шинжийг зааж байгаа дохио байж болох юм. Ажлаас халшрах хам шинжтэй эсэхээ мэдэхгүй удаан хугацаагаар явах нь ирээдүйд сэтгэл санаа, бие махбод, ажлын бүтээмж, нийгмийн харилцаанд сөргөөр нөлөөлөхөөс эхлээд сэтгэл гутралд өртөх зэрэг олон хортой үр дагаварт хүргэж болно.\n\nЭнэ бүхэн ердөө түр зуурын сэтгэл санааны уналт уу? эсвэл ажлаас халшрах хам шинж үү? гэдгийг таны тестийн үр дүнгээс харцгаая.',
          { align: 'justify' },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Тестийн тухай');

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Дэлхийн Эрүүл Мэндийн Байгууллага болон Өвчний Олон Улсын Ангилалд (ICD-11)-д ажлаас халшрах хам шинжийг тусдаа бие даасан сэтгэц, бие махбодын өвчин эмгэг биш, харин ажил мэргэжилтэй холбоотой илэрдэг тодорхой бүлэг шинж тэмдгүүд буюу хам шинж гэж тодорхойлжээ. Энэхүү хам шинж нь урт хугацаанд үргэлжилсэн ажлын хэт ачаалал, ажлын байранд хуримтлагдсан стрессээс голчлон үүдэлтэй гэж үздэг.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажлаас халшрах хам шинж нь дараах үндсэн гурван бүрэлдэхүүн хэсэгтэй:',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Эрч хүч, тамир тэнхээгүй болох, ядарч туйлдах',
            'Сэтгэл, оюун санааны хувьд ажлаасаа холдож, хөндийрөх, эсвэл ажилтайгаа холбоотой сөрөг бодол, таагүй мэдрэмжүүд төрөх',
            'Ажлын гүйцэтгэл, бүтээмж буурах.',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            //   bulletRadius: 1.5,
            columnGap: 8,
            listType: 'numbered',
          },
        )
        .moveDown(1);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          '1990-өөд оны дунд үед Дани улсад ажилтнууд олноороо ажлаас гарах, урт хугацаагаар чөлөө авах үзэгдэл ихэссэн тул засгийн газраас нь “Ажлаас халшрах хам шинж, ажлын сэтгэл ханамж, мотивацийг судлах төсөл (PUMA)”-ийг эхлүүлсэн байна. Энэхүү төслийн төслийн хүрээнд явагдсан судалгааны үр дүнд Копенхагены ажлаас халшрах хам шинжийг үнэлэх тест (CBI) бий болжээ. Өдгөө энэхүү тестийг ажлаас халшрах хам шинжийн үнэлэх чиглэлд дэлхий даяар өргөнөөр ашиглаж байна.\n\nЭнэхүү тест нь хувь хүн, ажил, харилцагч/үйлчлүүлэгчтэй холбоотой гэсэн гурван чиглэлд ажлаас халшрах хам шинжийг үнэлдэг.',
          marginX,
          doc.y,
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.orange)
        .text('Хувь хүнтэй холбоотой');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Удаан хугацааны туршид үргэлжилсэн ерөнхий ядарч цуцсан, халшрах байдал (тодорхой шалтгаанаас үл хамаарах)',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.orange)
        .text('Ажилтай холбоотой');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажил мэргэжил, ажлын орчин нөхцөл, дарамт, хэт ачаалал, ажлын стресстэй холбоотой үүссэн бие махбод болон сэтгэл санааны ядарч цуцсан, халшрах байдал',
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.orange)
        .text('Харилцагч/ үйлчлүүлэгчтэй холбоотой');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Харилцагч/үйлчлүүлэгчтэй ажиллахтай холбоотой үүссэн стресс, бие махбод болон сэтгэл санааны ядарч цуцсан, халшрах байдал. Жишээлбэл: Эрүүл мэнд, боловсрол, болон бусад хүмүүстэй харилцдаг үйлчилгээний салбарууд үүнд орно.',
          { align: 'justify' },
        )
        .moveDown(1);
      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Тестийн хэрэглээ, анхаарах зүйлс',
      );

      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Хөгжүүлэлт: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажлаас халшрах хам шинжийг үнэлэх, илрүүлэх зорилготой олон төрлийн тестийн хувилбаруудыг судлаач нар хөгжүүлсэн байдаг.  Бидний одоо ашиглаж буй Копенхагены ажлаас халшрах хам шинжийг үнэлэх тест (CBI) нь “Ажлаас халшрах хам шинж, ажлын сэтгэл ханамж, мотивацийг судлах төсөл (PUMA)”-ийн хүрээнд Дани улсын Ажил Мэргэжлийн Орчны Судалгааны Үндэсний төвийн эрдэмтэн судлаач нар олон жилийн судалгааны ажил дээрээ үндэслэж, боловсруулсан гаргасан 19 асуулт бүхий олон улсад өргөнөөр хэрэглэгддэг, сайтар судлагдаж, баталгаажсан тест юм.',
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Анхаарах: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Уг тестийг ямар ч нөхцөлд сэтгэцийн эмгэгийн оношилгоонд ашиглаж болохгүй. Зөвхөн эмчилгээ, үйлчилгээ эрхлэх зөвшөөрөлтэй, нарийн мэргэжлийн эмч л сэтгэцийн эмгэгийг оношилно. Тестийн үр дүнд суурилж мэргэжлийн сэтгэл зүй, сэтгэц судлалын зөвлөгөө өгөхгүй байхыг анхаарна уу!',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(13)
        .text('Тестийн оноог зөв тайлбарлах')
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажлаас халшрах хам шинжийг үнэлэх тестийн үр дүнг тооцохдоо гурван бүлэг тус бүрд харгалзах асуултуудын оноонуудыг хооронд нь нэгтгэж, дундаж оноог ашигласан. Бүлэг тус бүрд нийт авах боломжтой оноо нь 0-ээс 100 онооны хооронд хэлбэлзэнэ. Ажлаас халшрах хам шинжтэй гэж үзэх доод утга 50 онооноос эхэлнэ. Ажлаас халшрах хам шинжийн түвшнийг цаашид ойлгомжтой тайлбарлахын тулд дараах дөрвөн бүлэгт хуваасан. Онооны системийн дэлгэрэнгүй тайлбарыг доорх хүснэгтээс харна уу!',
          { align: 'justify' },
        )
        .moveDown(1);

      const tableData = [
        ['Харгалзах оноо', 'Түвшин/зэрэг'],
        ['0-49', 'Ажлаас халшрах хам шинжгүй'],
        ['50-74', 'Ажлаас халшрах хам шинж: Дунд түвшин'],
        ['75-99', 'Ажлаас халшрах хам шинж: Өндөр түвшин'],
        ['100', 'Ажлаас халшрах хам шинж: Маш өндөр түвшин'],
      ];

      const tableWidth = doc.page.width - 2 * marginX;
      const colWidths = [tableWidth * 0.3, tableWidth * 0.7]; // 30% / 70%
      const rowHeight = 18;

      let startX = marginX;
      let startY = doc.y;

      for (let row = 0; row < tableData.length; row++) {
        let x = startX;
        const y = startY + row * rowHeight;

        for (let col = 0; col < tableData[row].length; col++) {
          const colWidth = colWidths[col];

          doc.rect(x, y, colWidth, rowHeight).strokeColor('black').stroke();

          doc
            .font(row === 0 ? fontBold : fontNormal)
            .fontSize(12)
            .fillColor('black')
            .text(tableData[row][col], x + 5, y + 4, {
              width: colWidth - 10,
              align: 'center',
            });

          x += colWidth;
        }
      }

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Сорилын үр дүн');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ажлаас халшрах хам шинжийг үнэлэх тестийн бүлэг тус бүрд харгалзах оноог тооцоолж дараах графикт нэгтгэн үзүүлэв. Графикаас та өөрийн оноотой танилцаарай.',
          { align: 'justify' },
        )
        .moveDown(1);

      const categories = result.details.map((detail) => detail.value);
      console.log(result.details);
      const values = result.details.map((detail) => Number(detail.cause));
      const divisors = [100, 100, 100];
      const averages = [101, 101, 101];
      console.log(categories.length);
      for (let index = 0; index < categories.length; index++) {
        const category = categories[index];

        if (index > 0) {
          doc.moveDown(3.2);
        }

        const currentY = doc.y;

        doc
          .font(fontBold)
          .fontSize(12)
          .fillColor(colors.black)
          .text(category + ' ', { continued: true })
          .font('fontBlack')
          .fillColor(colors.orange)
          .text(String(values[index]), { continued: false });

        const result =
          values[index] <= 49
            ? 'Ажлаас халшрах хам шинжгүй'
            : values[index] <= 74
              ? 'Ажлаас халшрах хам шинж: Дунд түвшин'
              : values[index] <= 99
                ? 'Ажлаас халшрах хам шинж: Өндөр түвшин'
                : 'Ажлаас халшрах хам шинж: Маш өндөр түвшин';

        doc
          .font(fontBold)
          .fontSize(10)
          .fillColor(colors.black)
          .text(`${result}`, marginX, currentY, {
            width: doc.page.width - marginX * 2,
            align: 'right',
          });

        doc.moveDown(-0.8);
        console.log(index);
        const buffer = await this.vis.bar(
          values[index],
          divisors[index],
          averages[index],
          '',
        );

        doc.image(buffer, {
          width: doc.page.width - marginX * 2,
          height: (130 / 1800) * (doc.page.width - marginX * 2),
        });
      }
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Хамгийн өндөр оноотой бүлэг нь танд давамгайлан илэрч буй ажлаас халшрах хам шинжийн төрөл, шалтгааныг илтгэнэ. Энэхүү тест нь бүлгүүдийн оноог нэгтгэж, нэгдсэн үр дүнг тооцож гаргахгүй болохыг анхаараарай. Та хэрвээ ерөнхий, нэгдсэн үр дүнг сонирхож байгаа бол “хувь хүнтэй холбоотой” бүлгийн оноог сонгон авч энэ зорилгоор хэрэглэж болно. “Хувь хүнтэй холбоотой” бүлэг нь таны сэтгэл санаа, бие махбодын хувьд танд илэрч буй ерөнхий ажлаас халшрах хам шинжийг заадаг.\n\nМөн энэхүү гурван бүлэг нь хоорондоо нягт харилцан холбоо хамааралтай бөгөөд ажил, харилцагчтай холбоотой бүлгүүдийн оноо ихсэх нь эргээд хувь хүнтэй холбоотой бүлгийн оноо өсөхөд нөлөөлнө. Жишээлбэл: Та хувь хүнтэй холбоотой бүлэгт 100 оноо, үлдсэн хоёр бүлэгт тус бүр 0 оноо авч болох хэдий ч эсрэгээрээ ажил, харилцагчтай холбоотой бүлэгт 100 оноо аваад хувь хүнтэй холбоотой бүлэгт 0 оноо авах боломжгүй юм. Өөрөөр хэлбэл хэрэв танд ажил, мэргэжил, ажлын орчинтой холбоотой ажлаас халшрах хам шинж тэмдгүүд илэрсэн бол энэ нь тодорхой хэмжээнд таны хувийн амьдралд, өдөр тутмын амьдралд нөлөөлж, хувь хүнтэй холбоотой ажлаас халшрах хам шинжийн оноо өсөхөд нөлөөлнө.\n\nТа өөрийн авсан оноогоо эргэцүүлж, дараах асуултуудад дотроо хариулаарай.',
          marginX,
          doc.y + 40,
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .list(
          [
            'Таны авсан оноо тест өгөхөөс өмнөх төсөөлөлтэй чинь зөрж байна уу?',
            'Таны авсан оноо болон одоогийн ажил, амьдралын хэв маягаа авч үзвэл, аль хэсэгт нь хамгийн их анхаарал хандуулах ёстой гэж та бодож байна вэ?',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            // bulletRadius: 1.5,
            columnGap: 8,
            listType: 'numbered',
          },
        )
        .moveDown(1);

      footer(doc);

      const details: ResultDetailEntity[] = result.details;
      const results = [];

      for (const detail of details) {
        const result = this.result(detail.value);
        results.push({ ...result, point: +detail.cause, value: detail.value });
      }

      for (const r of results) {
        doc.addPage();
        header(doc, firstname, lastname, r.name);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.description, { align: 'justify' })
          .moveDown(1);

        const startX = marginX;
        let startY = doc.y;
        const tableWidth = doc.page.width - marginX * 2;
        const leftW = tableWidth * 0.35;
        const rightW = tableWidth * 0.65;
        const rowHeight = 180;

        doc.lineWidth(1).strokeColor('#000');

        doc
          .moveTo(startX, startY)
          .lineTo(startX + tableWidth, startY)
          .stroke();
        doc
          .moveTo(startX, startY)
          .lineTo(startX, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX + leftW, startY)
          .lineTo(startX + leftW, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX + tableWidth, startY)
          .lineTo(startX + tableWidth, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX, startY + rowHeight)
          .lineTo(startX + tableWidth, startY + rowHeight)
          .stroke();

        const imgPath = service.getAsset(`icons/${r.image}`);
        const imgSize = Math.min(leftW, rowHeight - 15);
        doc.image(imgPath, startX + 10, startY + 10, {
          width: imgSize,
          height: imgSize,
        });

        const scorePct = Math.round(r.point);
        const pie = await this.vis.doughnut(colors.nonprogress, 100, scorePct);
        const width = (doc.page.width - marginX * 2) / 2;
        doc.image(pie, startX + leftW + 40, startY + 15, { width });

        const xPosition = startX + leftW + 150;
        const yPosition = startY + 104;

        let levelLabel = '';
        let caseText = '';
        let caseTitle = '';

        if (scorePct <= 49) {
          levelLabel = 'ХАМ ШИНЖГҮЙ';
          caseText = r.case1;
          caseTitle = 'Хэрэв илрээгүй бол:';
        } else if (scorePct <= 74) {
          levelLabel = 'ДУНД ТҮВШИН';
          caseText = r.case2;
          caseTitle = 'Дунд түвшин:';
        } else if (scorePct <= 99) {
          levelLabel = 'ӨНДӨР ТҮВШИН';
          caseText = r.case3;
          caseTitle = 'Өндөр түвшин:';
        } else {
          levelLabel = 'МАШ ӨНДӨР ТҮВШИН';
          caseText = r.case4;
          caseTitle = 'Маш өндөр түвшин:';
        }

        const baseX = xPosition + 22;

        const label = 'Таны оноо';
        doc.font(fontNormal).fontSize(12).fillColor(colors.black);
        const labelWidth = doc.widthOfString(label);
        doc.text(label, baseX - labelWidth / 2, yPosition + 30);

        const pct = `${scorePct}%`;
        doc.font('fontBlack').fillColor(colors.orange).fontSize(28);
        const pctWidth = doc.widthOfString(pct);
        doc.text(pct, baseX - pctWidth / 2, yPosition);

        doc.font('fontBlack').fontSize(16).fillColor(colors.orange);
        const levelWidth = doc.widthOfString(levelLabel);
        doc.text(levelLabel, baseX - levelWidth / 2, yPosition + 50);

        doc
          .font(fontBold)
          .fontSize(13)
          .fillColor(colors.black)
          .text(caseTitle, marginX, startY + rowHeight + 20, {
            align: 'justify',
          })
          .moveDown(0.5);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(caseText, {
            align: 'justify',
          })
          .moveDown(1);

        footer(doc);
        doc.addPage();
        header(doc, firstname, lastname, r.name);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.intro, {
            align: 'justify',
          })
          .moveDown(1);
        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.list, doc.x + 20, doc.y, {
            align: 'justify',
          })
          .moveDown(1);
        footer(doc);
      }
    } catch (error) {
      console.log('burnout', error);
    }
  }
}
