import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity, ResultDetailEntity } from 'src/entities';
import {
  assetPath,
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { SinglePdf } from '../single.pdf';
import { VisualizationService } from '../visualization.service';
const sharp = require('sharp');

interface Result {
  name: string;
  description: string;
  intro: string;
  list: string;
  case1: string;
  case2: string;
  case3: string;
  case4: string;
  add: string;
}
@Injectable()
export class Ethic {
  constructor(
    private single: SinglePdf,
    private vis: VisualizationService,
  ) {}

  public result(v: string) {
    let res: Result = {
      name: '',
      description: '',
      intro: '',
      list: '',
      case1: '',
      case2: '',
      case3: '',
      case4: '',
      add: '',
    };

    const value = v.toLowerCase();
    if (value == 'ажилтнуудаас хүлээж буй ёс зүйн хэм хэмжээний хүлээлт') {
      res = {
        name: 'Ажилтнуудаасаа хүлээж буй ёс зүйн хэм хэмжээний хүлээлтээ ойлгуулдаг байх',
        description:
          'Ажилтнууддаа ямар ёс зүйн хэм хэмжээг баримтлах ёстойг хэр тодорхой мэдээлж, ойлгуулдаг вэ гэдгийг үнэлэхтэй холбоотой бүлэг юм.',
        intro:
          'Ажилтнуудаасаа хүлээж буй ёс зүйн хэм хэмжээний хүлээлтээ ойлгуулдаг байхтай холбоотой хөгжүүлэх зөвлөмжүүд:',
        list: '• Ёс зүйн бодлого, кодексыг тодорхой болгож түгээх: Байгууллагын баримталдаг ёс зүйн дүрэм, хэм хэмжээг албан ёсоор боловсруулж, бүх ажилтанд ойлгомжтой байдлаар түгээх нь чухал. Ёс зүйн кодекс болон зан үйлийн стандартуудыг хүн бүр мэддэг, өдөр тутамдаа хэрэгжүүлдэг байх нөцөлийг бүрдүүлээрэй.\n• Нээлттэй ярилцлага, харилцааг дэмжих: Ёс зүйн асуудлаар ажилтнуудтайгаа чөлөөтэй ярилцаж, асуулт асуух, санал бодлоо хуваалцах боломжтой орчныг бий болгоорой. Мөн эргэлзээтэй нөхцөл тулгарсан үед удирдлагаасаа асууж лавлах үед урам өгөх нь ажилтнуудад буруу алхам хийхээс сэргийлэх, санаа зоволгүйгээр санал бодлоо илэрхийлэх боломжийг нээдэг.\n• Шинэ ажилтан, шилжин томилогдсон ажилтнуудад ёс зүйн хүлээлтийг эхнээс нь таниулах: Шинээр ажилд орсон болон шилжин ирсэн ажилтнуудад байгууллагын ёс зүйн дүрэм, үнэт зүйлсийг эхнээс нь тодорхой танилцуулж, баримтлах зарчмуудыг ойлгуулаарай. Уулзалт, сургалтын хөтөлбөрт ёс зүйн сэдвийг оруулах нь үр дүнтэй.  Судалгаагаар шинэ ажилтнуудад ёс зүйн зарчмыг эхнээс нь суулгаж өгөх нь байгууллагад хариуцлага, шударга байдлын соёл төлөвшихөд чухал үүрэгтэй болох нь тогтоогдсон.\n• Тогтмол сануулж зөвлөгөө өгөх арга барилтай болох: Ёс зүйн зарчмуудыг нэг удаа таниулаад орхих биш, тогтсон давтамжтайгаар дахин дахин сануулж байх нь үр дүнтэй. ',
        case1:
          'Та ажилтнууддаа ёс зүйн зарчмыг тогтмол таниулж, сануулдаггүйгээс зарим нь тэдгээрийг бүрэн мэдэхгүй байх магадлалтай. Үүний улмаас ажилтнууд таны хүсэж буй ёс зүйн стандартыг ойлгож чадахгүй, улмаар дүрэм зөрчих эсвэл ашиг сонирхлын зөрчилтэй нөхцөлд буруу сонголт хийх эрсдэл үүсэхийг анхаараарай.',
        case2:
          'Та ёс зүйн дүрэм журмын талаар ажилтнууддаа тогтмол бус, хааяа нэг ойлгуулж сануулдаг байх талтай. Хэрэв удирдлага ёс зүйн талаар огт ярьж, чиглэл өгдөггүй бол ажилтнуудын дунд байгууллагад ёс зүй, үнэт зүйлс төдийлөн чухал биш гэсэн буруу ойлголт төрөх эрсдэлтэйг санаарай. ',
        case3:
          'Та ёс зүйн дүрэм журмын талаар ажилтнууддаа тогтмол бус, хааяа нэг ойлгуулж сануулдаг байх талтай. Хэрэв удирдлага ёс зүйн талаар огт ярьж, чиглэл өгдөггүй бол ажилтнуудын дунд байгууллагад ёс зүй, үнэт зүйлс төдийлөн чухал биш гэсэн буруу ойлголт төрөх эрсдэлтэйг санаарай. ',
        case4:
          'Та багийнхандаа ёс зүйн дүрэм журам, хүлээлтийг ойлгомжтойгоор дамжуулж, тогтмол сануулан чиглүүлдэг удирдлага юм. Иймээс ажилтнууд удирдлагаасаа ирэх ёс зүйн шаардлагыг сайн мэдэж, юу зөв, юу буруу болох талаар тодорхой ойлголттой байдаг. Таны багийнхан аливаа асуудалд хэрхэн ёс зүйтэй хандах ёстойгоо мэддэг нь чухал ач холбогдолтой юм. ',
        add: 'Таны үүрэг бол хамт олондоо "юуг ёс зүйтэй зөв үйлдэлд тооцох, ямар үйлдэл хүлээн зөвшөөрөгдөхгүй вэ" гэдгийг тодорхой ойлгуулж, тогтмол сануулж байх явдал юм.',
      };
    }
    if (value == 'ёс зүйтэй шийдвэр гаргалт') {
      res = {
        name: 'Ёс зүйтэй шийдвэр гаргалт',
        description:
          'Удирдах ажилтан шийдвэр гаргахдаа ёс зүйн зарчмыг хэрхэн харгалзаж үздэгийг үнэлэх бөгөөд зөвхөн ашгийг харсан шийдвэр гаргах уу, эсвэл шударга ёс, хариуцлага, зарчимдаа нийцүүлэн зөвийг эрхэмлэж чаддаг уу гэдгийг хэмжихтэй холбоотой бүлэг. ',
        intro: 'Ёс зүйтэй шийдвэр гаргалттай холбоотой хөгжүүлэх зөвлөмжүүд:',
        list: '• Олон талын үр дагаврыг тооцох: Том, жижиг ямар ч шийдвэр гаргахдаа зөвхөн ашиг болон ажлын гүйцэтгэлийг бус, оролцогч талуудад (ажилтнууд, үйлчлүүлэгчид, олон нийт, хувь нийлүүлэгчид гэх мэт) хэрхэн нөлөөлөхийг бодолцох нь чухал. “Энэ шийдвэрийг гаргавал манай багийнханд, хэрэглэгчдэд ямар нөлөө үзүүлэх вэ? Хэн нэгэнд шударга бус байдал үүсэх үү?” гэж өөрөөсөө асууж байгаарай.\n• Ёс зүйн шалгуур, асуултуудыг ашиглах: Шийдвэр гаргахдаа өөртөө ёс зүйн сорилттой хэд хэдэн асуулт тавьж хэвших нь буруу алхам хийхээс хамгаалдаг. Жишээлбэл: Энэ шийдвэр шударга ёсны зарчимд нийцэж байна уу?, Энэ үйлдлээр хэн нэгэн хохирох уу, эсвэл энэ нөхцөл надад тулгарвал би яаж хандах байсан бол? гэх мэт. \n• Яарсан шийдвэрээс зайлсхийх: Яаралтай тулгамдсан нөхцөлд, ёс зүйн эргэлзээ дагуулсан шийдвэрийг ганцаараа яаран гаргах нь эрсдэлтэй. Ийм үед цаг гаргаж нухацтай тунгааж, итгэлтэй хамтрагч, туршлагатай хүн, эсвэл байгууллагынхаа хууль, ёс зүйн зөвлөхүүдтэй зөвлөлдөөрэй. Гуравдагч хүний харах өнцөг таны үл анзаарсан эрсдэл, алдааг илрүүлэхэд тусална. Шийдвэрээ гаргасны дараа ч тухайн нөхцөлд дахин нэг дүгнэлт хийгээрэй.\n• Байгууллагын үнэт зүйлс, бодлогод нийцүүлж шийдвэрээ тайлбарлах: Шийдвэр гарсны дараа багийнханд болон холбогдох хүмүүст тухайн шийдвэрээ ил тод, ойлгомжтойгоор тайлбарлах. Ялангуяа ёс зүйн үндэслэлээр ашигтай боломжийг татгалзсан бол “Бид богино хугацаанд ашиг олох боломжтой байсан ч энэ ажил манай компанийн үнэт зарчимтай нийцэхгүй тул татгалзлаа” гэж товч тодорхой тайлбарлаж болно. Энэ нь таныг ил тод, хариуцлагатай удирдагчийн жишээ болгон харуулахын зэрэгцээ бусдад ёс зүйн зарчмыг шийдвэртээ хэрхэн нэгдүгээрт тавьж болдгийг харуулж, үлгэр дуурайл болох юм.',
        case1:
          'Та шийдвэр гаргахдаа ёс зүйн шалгуурыг бараг тооцдоггүй бөгөөд богино хугацааны ашиг, байгууллагад тэр даруй ашигтай харагдах үр дүнг урьтал болгодог. Ийм шийдвэрүүд нь ёс суртахуунгүй үр дагаварт хүргэх, эсвэл ажилтнуудын дунд шударга бус гэсэн ойлголтыг бий болгох өндөр эрсдэлтэй.',
        case2:
          'Та ихэнхдээ ёс зүйг баримталж шийдвэр гаргадаг ч тодорхойгүй нөхцөлд заримдаа буруу алхам хийх, эсвэл гадны дарамт шахалтад буулт хийх тохиолдол гарч болзошгүй. Шийдвэр гаргахдаа ёс зүйн зарчмыг байнга хэрэгжүүлдэггүйгээс ажилтнууд зарим шийдвэрийг ойлгомжгүй, эсвэл удирдлага өөртөө ашигтайгаар тайлбарласан мэтээр хүлээн авах эрсдэлтэй.',
        case3:
          'Та ихэнхдээ ёс зүйг баримталж шийдвэр гаргадаг ч тодорхойгүй нөхцөлд заримдаа буруу алхам хийх, эсвэл гадны дарамт шахалтад буулт хийх тохиолдол гарч болзошгүй. Шийдвэр гаргахдаа ёс зүйн зарчмыг байнга хэрэгжүүлдэггүйгээс ажилтнууд зарим шийдвэрийг ойлгомжгүй, эсвэл удирдлага өөртөө ашигтайгаар тайлбарласан мэтээр хүлээн авах эрсдэлтэй.',
        case4:
          'Та аливаа шийдвэрийг гаргахдаа ёс зүйн зарчмыг тогтмол баримталж, ашиг сонирхлын дарамт шахалтаас үл хамааран зөв гэж үзсэндээ үнэнч байдаг удирдлага байна. Энэ нь таны шийдвэрүүд ихэвчлэн шударга, ил тод бөгөөд олон талын ашиг сонирхлыг хангасан “Юу нь зөв бэ? Хэнд хэрхэн нөлөөлөх вэ? Бидний үнэт зүйлд нийцэж байна уу?” гэх мэт асуултыг үргэлж тавьж, ёс зүйн шалгуурыг нэн тэргүүнд тавьдаг. Ийм манлайлал нь байгууллагын урт хугацааны амжилтын үндэс болж, олон нийтийн итгэлийг бэхжүүлж, багийн дотоод эв нэгдлийг бэхжүүлдэг.',
        add: 'Ёс зүйтэй шийдвэр гаргалт гэдэг нь зөвхөн өөрийн болон байгууллагын ашиг сонирхлыг харгалзах бус, нийтийн сайн сайхны төлөө “зөв зүйлийг хийх” үйлдэл юм. Ёс зүйн манлайлалтай удирдагч шийдвэр гаргахдаа хууль, дүрэм журам болон ёс суртахууны зарчимд нийцэж байгаа эсэхийг нэн түрүүнд нягталдаг. Тэд шударга, бодитой, хүн бүрт хүртээмжтэй шийдвэр гаргахыг зорьдог бөгөөд богино хугацааны ашиг бус, урт хугацааны нэр хүнд, хариуцлагыг харгалзан олон талын үр дагаврыг тооцдог.\n\nСудалгаагаар ёс зүйн манлайлалтай удирдагчид зөв шийдвэр гаргахын тулд заримдаа бизнесийн ашиг сонирхлоосоо ухарч, үнэт зүйлс болон ёс зүйн зарчмаа зөрчихгүй байхыг чухалчилдаг нь тогтоогдсон. Өөрөөр хэлбэл, ёс зүйтэй шийдвэр гаргана гэдэг нь ашиг ба ёс суртахууны зааг дээр тулгарахад “ашигтай боловч буруу”сонголтыг бус, “зөв боловч төвөгтэй байж мэдэх” сонголтыг хийх эр зориг, ухамсрыг илэрхийлдэг юм.',
      };
    }
    if (value == 'ёс зүй бол эрхэмлэх үнэт зүйл мөн болох') {
      res = {
        name: 'Ёс зүй бол эрхэмлэх үнэт зүйл мөн болохыг илэрхийлэх',
        description:
          'Удирдлагынхаа хувьд ёс зүй, шударга байдлыг өөрийн эрхэм үнэт зүйл гэж хэр хэмжээнд тунхаглаж, бусдад мэдрүүлдэг байхтай холбоотой бүлэг юм.',
        intro:
          'Ёс зүй бол эрхэмлэх үнэт зүйл мөн болохыг илэрхийлэхтэй холбоотой хөгжүүлэх зөвлөмжүүд: ',
        list: '• Үйлдлээрээ үлгэрлэх, үг үйлдлээ нийцүүлэх: Ёс зүйн дүрэм, хууль журам болон байгууллагынхаа бодлогыг та өөрөө ягштал мөрдөж хэвшээрэй. Жижиг зүйл байсан ч дүрэм зөрчихөөс зайлсхийж, зарчимдаа үнэнч байх нь багийнханд тань хүчтэй үлгэр дуурайлал болно.\n• Ёс зүйн үнэт зүйлсээ ил тод хуваалцах: Өөрийн эрхэмлэдэг ёс зүйн зарчмуудыг (шударга байдал, хариуцлага, ил тод байдал г.м) багийнхандаа тодорхой ойлгуулж байхыг хичээгээрэй. Үүнийг хэрэгжүүлэхдээ ажил хэрэг болгон лекц унших бус харин өдөр тутмын ажлын хүрээнд, шийдвэр гаргах мөчүүддээ өөрийн баримталдаг зарчмыг дурдаж хэвшээрэй. \n• Өөрийн үйлдлээ эргэцүүлэх: Удирдлагын хувиар өөрийн үг, үйлдэл бүрийг үе үе тунгааж, ёс суртахууны зарчимтай нийцэж буй эсэхэд өөртөө хяналт тавиарай. Өдөр тутмын ачаалал дунд анзааралгүй өнгөрөөсөн алдаа гаргасан байх талтай. Иймд та өөрөөсөө "Би өнөөдөр өөрийн үнэт зүйлстээ үнэнч байж чадав уу?" гэж асуугаад үзээрэй. Мөн та өөрийн хамтран ажиллагчид, туслах эсвэл доороо ажилладаг ажилтнуудаасаа өөрийн манлайллын талаар үнэн бодитой санал хүсэлт авч болох юм. Бусдаас сонссон үнэлгээ, санал нь танд анзааралгүй өнгөрөөсөн алдаагаа олж харахад тань тус болно. Энэ байдлаар өөрийгөө хөгжүүлэн, илүү өндөр ёс зүйн манлайлалтай удирдлага болох боломж бүрдэнэ.',
        case1:
          'Та ёс зүйг үнэт зүйл гэж бараг дурддаггүй бөгөөд энэ чиглэлээр манлайлал үзүүлдэггүй гэсэн дохио илэрхийлж байна',
        case2: 'Ёс зүйн манлайлал сул, зөвхөн хааяа нэг хэрэгжүүлдэг байна.',
        case3:
          'Ёс зүйн манлайллыг боломжийн сайн хэрэгжүүлдэг ч тогтмол биш, заримдаа орхигдуулах тохиолдол ажиглагдаж байна.',
        case4:
          'Та ёс зүйг ажилдаа тууштай эрхэмлэж, өдөр тутамдаа ёс суртахууны зарчмуудыг ярьж, үйл хөдлөлөөрөө үлгэрлэн харуулдаг удирдлага байна.',
        add: 'Удирдлагын өдөр тутмын үйлдэл, үг нь багийнхандаа маш хүчтэй дохио болдог. Ажилтнууд удирдлагынхаа юу хэлж, юу хийж байгааг байнга ажиглаж, юуг илүү чухалчилдгийг мэддэг. Та өөрөө ёс зүйгүй авир гаргавал ажилтнууд түүнийг хэвийн зүйл гэж хүлээн авч, даган дуурайх магадлал өндөр байдаг. Харин эсрэгээрээ, та үргэлж шударга, зарчимч байвал “удирдагч ийм байхыг шаарддаг” гэж ойлгон тэр хэмжээгээр ажилтнууд тань ёс зүйтэй байх хандлагад төлөвшинө. Иймээс “Ёс зүй бол эрхэм үнэт зүйл мөн” гэдгийг өөрийн биеэр харуулж, үлгэр дуурайлал болох нь ёс зүйн манлайллын суурь үндэс юм.',
      };
    }
    if (value == 'дотоодын ёс зүйн хөтөлбөр, үйл ажиллагааг дэмжих') {
      res = {
        name: 'Дотоодод хэрэгжиж буй ёс зүйн байдлыг сайжруулахад чиглэсэн үйл ажиллагаа, хөтөлбөрийг хөхүүлэн дэмжих',
        description: '',
        intro:
          'Дотоодод хэрэгжиж буй ёс зүйн байдлыг сайжруулахад чиглэсэн үйл ажиллагаа, хөтөлбөрийг хөхүүлэн дэмжихтэй холбоотой хөгжүүлэх зөвлөмжүүд:',
        list: '• Ёс зүйн сургалт, мэдлэг олгох үйл ажиллагааг тогтмол зохион байгуулах: Ажилтнууддаа зориулан ёс зүйн сэдэвт сургалт, семинар, хэлэлцүүлгүүдийг тодорхой төлөвлөгөөтэйгөөр явуулж байгаарай. Жилдээ нэг удаа ёс зүйн сургалт хийх, түүнчлэн цахим сорил, тест зэргээр мэдлэгийг нь сэргээх нь үр өгөөжтэй. Судалгаагаар тогтмол давтан сургалт нь ажилтнуудад ёс зүйн зарчмуудыг дахин тунгаах, шинэ нөхцөл байдал үүсэхэд хэрхэн зөв шийдэх талаар урьдчилан бэлтгэхэд тустай байдаг. Мөн сургалтыг аль болох сонирхолтой, бодит жишээ, дилемма кейс дээр тулгуурлан явуулах нь илүү үр дүнтэй гэдгийг санаарай. Удирдах ажилтан та өөрөө ч ийм сургалтад биечлэн оролцож, манлайлан суралцаж буйгаа харуулаарай. Менежментийн багийнхан өөрсдөө сургалтад идэвхтэй байвал ажилтнуудад “Ёс зүйн сургалт үнэхээр чухал” гэсэн мессеж очих болно.\n• Ёс зүйн зөрчил, асуудлыг мэдээлэх эрүүл тогтолцоог бий болгох: Ажилтан байгууллагадаа ямар нэг ёс зүйн зөрчил, шударга бус явдал ажиглавал түүнийг зохих хүмүүст нь айдасгүйгээр мэдээлдэг байх “нээлттэй мэдээлэх соёл” маш чухал. Ажилтнууд ёс зүйгүй асуудлыг хаана, хэрхэн мэдэгдэх талаар тодорхой заавар, сувагтай (жишээлбэл, дотоод халуун шугам, итгэдэг менежер, эсвэл бүрэн нэрээ нууцалж болох цахим систем гэх мэт) болгох үүрэгтэй. Тухайлбал, компанийнхаа дотоод сүлжээнд “ёс зүйн зөрчил мэдээлэх булан” нээж, түүгээр ирсэн мэдээллийг авч судлах, түүнийг хариуцан ажиллах хүнийг томилж болно. Хамгийн гол нь зөрчил мэдээлсэн хүнийг ажлын байрны дарамт, ялгаварлалаас  хамгаалах бодлого мөрдөгддөг байх шаардлагатай юм. Ажилтнууддаа шударга зүйлд санаа зовж байгаа бол хамгаалалттай гэдгийг нь тунхаглаж ойлгуулснаар тэд илүү айдасгүй, идэвхтэй мэдээлэх болно (oge.gov). Энэ нь байгууллагад гарч болзошгүй том эрсдэлийг бага дээр нь илрүүлж засах, ил тод байдлыг хангах хамгийн найдвартай арга юм. \n• Ёс зүйн үнэт зүйлсийг байгууллагын удирдлагын бүтэц, хүний нөөцийн бодлоготой уялдуулах: Байгууллагын соёл, бодлого үйл ажиллагаанд ёс зүйн соёлыг шингээх нь тогтвортой өөрчлөлтийг авчирдаг. Удирдах ажилтнуудын ажлын гүйцэтгэлийн үнэлгээнд “ёс зүйн манлайллын үзүүлэлт” оруулах (oge.gov)  эсвэл албан тушаал дэвшүүлэхдээ зөвхөн мэргэжлийн ур чадвараас гадна тухайн хүний ёс суртахууны төлөвшлийг харгалзах, хүний нөөцийн бүрдүүлэлтийн ярилцлагад ёс зүйн асуулт оруулах зэргээр үйл ажиллагаандаа шингээж болно. Мөн аливаа шинэ бодлого, төсөл хэрэгжүүлэхийн өмнө ёс зүйн мэргэжилтэн, хуулийн зөвлөхтэйгөө зөвшилцөж, ёс зүйн эрсдэлийг урьдчилан хэлэлцдэг журмыг боловсруулж болно (oge.gov). Тухайлбал, удирдлагуудын хурал уулзалтаар дотоод ёс зүйн нөхцөл байдлын талаар мэдээлэл сонсож, сайжруулах санаачилгыг ярилцдаг болгох, эсвэл шаардлагатай бол “Ёс зүйн хороо” байгуулах зэргээр институцийн түвшинд нэвтрүүлээрэй. ',
        case1:
          'Та ёс зүйн үйл ажиллагаанд огт сонирхолгүй, эсвэл шаардлагатайг мэдсэн ч төдийлөн анхаарч дэмждэггүй байж болох юм. Үүнээс болж байгууллагын ёс зүйн түвшин сул хэвээр үлдэхээс гадна асуудал гарвал улам гүнзгийрэх хандлагатай. Хэрэв та энэ чиглэлд оноо бага авсан бол өөрөөсөө “Би байгууллагынхаа ёс зүйн соёлыг бэхжүүлэхийн тулд юу хийж чадах вэ?” гэж асууж, дараах алхмуудыг хэрэгжүүлж эхлэхийг зөвлөж байна.',
        case2:
          'Та ёс зүйн хөтөлбөрүүдийг дэмждэг ч тогтмол идэвхтэй санаачлагч биш байна. Энэ нь таны оролцоог илүү тогтвортой, үр нөлөөтэй болгох боломж байгааг харуулж байна.',
        case3:
          'Та ёс зүйн хөтөлбөрүүдийг дэмждэг ч тогтмол идэвхтэй санаачлагч биш байна. Энэ нь таны оролцоог илүү тогтвортой, үр нөлөөтэй болгох боломж байгааг харуулж байна.',
        case4:
          'Та байгууллагын дотоод ёс зүйн байдлыг сайжруулах аливаа санаачилгыг үргэлж сайшааж, шаардлагатай нөөц, дэмжлэгээр хангаж, өөрөө үлгэрлэн оролцдог удирдагч байна. Энэ нь таны манлайлал зөвхөн өөрийн зан төлөвт бус, байгууллагын нийт соёлд эергээр нөлөөлж буйг илтгэнэ.',
        add: 'Байгууллагын ёс зүйн соёлыг дээшлүүлэхэд удирдлагын дэмлэг болон хариуцлагын тогтолцоо хамгийн хүчтэй нөлөө үзүүлдэг нь олон судалгаагаар нотлогдсон. Өөрөөр хэлбэл, удирдагч хүн ёс зүйн хувьд зөв үйлдэл гаргасан ажилтнаа урамшуулж, буруу үйлдэл гаргасан тохиолдолд албан тушаал, нэр хүндээс үл хамааран хариуцлага тооцдог соёл тогтоох нь ёс зүйн орчныг сайжруулах хамгийн үр дүнтэй арга замуудын нэг юм.',
      };
    }

    return res;
  }

  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    try {
      header(doc, firstname, lastname);
      title(doc, result.assessmentName);
      info(
        doc,
        exam.assessment.author,
        exam.assessment.description,
        exam.assessment.measure,
        exam.assessment.usage,
      );
      doc.font(fontBold).fontSize(13).text('Оршил').moveDown(0.5);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          '2012 оны Ёс зүйн Үндэсний Хорооны “Fortune 500–Ethics Survey”–судалгаанаас харахад ажилтнуудын ёс зүйн зөрчил 52%-тай гарсан байдаг. Олон судалгаагаар манлайлагчийн ёс суртахууны хөгжил нь ёс зүйн уур амьсгалын хүчин зүйлстэй хамааралтай болохыг тогтоосон байна.  Манлайлагч байгууллагын ёс зүйн норм болон үйл ажиллагааг тодорхой хэмжээнд бий болгон хадгалах чадвартай гэдэг дээр судлаачид санал нийлдэг байна (Schminke et al. 2005). \n\nЁс зүйн манлайллын гол үүргийг (De Hoogh and Den Hartog’s, 2008) дор өгүүлснээр тодорхойлжээ:',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'ажилчдадаа урам өгч, дэмжлэг үзүүлэх,',
            'хувь хүний зан төлөвт нөлөөлдөг байх,',
            'харилцааны өндөр ур чадвартай байх,',
            'хариуцлагатай байх,',
            'бусдад санаа тавьдаг байх,',
            'ажилчдыг сонсох,',
            'ажилчдад итгэх,',
            'шударга хандах, ',
            'бусдад ижил тэгш хандах,',
            'үүрэг хариуцлагаа ухамсарлах, ',
            'бүрэн эрхийг тохиромжтой түвшинд хуваарилах',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
          },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        'Ёс зүйн манлайлал хэмээх ойлголтыг судлаачид хэрхэн тайлбарладаг вэ?',
      );

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .list(
          [
            'Ёс зүйн зөрчил нь тодорхой зан төлөвийн хэрэгжилтээр дахин давтагдах хэлбэрээр оршсоор удаандаа байгууллагын ашигт ажиллагаанд бодитойгоор нөлөөлж, байгууллагын нэр хүндэд асар ихээр сэв суулгадаг (Mulki, 2007).',
            'Ёс зүйн манлайлал гэдэг нь “Хувь хүн өөрийн үйл хөдлөл болон зан төлөвөөр дамжуулан ёс суртахуунтай байдлыг хэрэгжүүлэхийг хэлнэ”. Дээрх хэрэгжилт манлайлагчийн үйл ажиллагаагаар удирдагдан,  дагалдагч нарт сэдэлжүүлэлт ба шийдвэр гаргалт гэсэн гол 2 арга замаар хүрдэг (Brown, 2005).',
            'Манлайлагч нь дээд зэргийн ёс суртахуунтай байдлыг үг яриа, үйл хөдлөл, шийдвэр гаргалт, хандлага бүртээ хэрэгжүүлж ажилтнуудад өөрийн биеэр үлгэр дууриал үзүүлэхийг хэлнэ. (Toor and Ofori 2009).',
            'Ажилтнуудын ёс суртахууны зан үйлийг бүрдүүлэх нь цэвэр манлайлагчийн шийдэх асуудал юм (Brown, 2005; Toor and Ofori 2009).',
            'Ажилтнуудын ёс зүйн зөрчилтэй байдлыг бууруулахын тулд байгууллага өөрийн ёс зүйн уур амьсгалыг үнэлэх, мөн ёс зүйн манлайлал хэрхэн, яаж, ямар нөлөөтэй байдгийг илрүүлэх нь чухал алхам байдаг (Mayer, 2009).',
            'Ажилтнууд байгууллагаа бизнесийн орчинд хуулийн дагуу зөв үйл ажиллагаа явуулж чадаж байна уу үгүй юу гэдгийг ажиглаж байдаг учир байгууллагад ёс зүйн зан төлөв нь ажилтнуудын хувьд чухал ойлголт байдаг (Fraederich, 1993).',
            'Ёс зүйн манлайлагч нар ажилтнуудаа үргэлж сайн зүйл хийхийг уриалж, дэмжиж, урамшуулж, үнэлж байдаг. Ийм үед ажилтнууд байгууллагын ёс зүйн уур амьсгалыг хүлээн авах чадвартай болдог. (Mayer et al. 2009).',
            'Ёс зүйн манлайлагч нар эерэг зан чанарыг өөртөө шингээснээр бусдад үлгэр жишээ үзүүлж байдаг. Тэд ажилчидтайгаа сэтгэл зүйгээр нь дамжуулан харилцан нөлөө үзүүлж байдаг. Энэ нь ажилчид болон манлайлагч нарын хооронд итгэл найдвар тэгш эрхийг үүсгэдэг зан төлөв юм (Blau 1964).',
            'Манлайлагч нар шударга харилцааг ажилчидтайгаа тогтоож чадсан цагт ажилчид ёсзүйгүй үйлдэл гаргахгүй (Mayer et al. 2009).',
            'Манлайлагч нар ажилчидтайгаа тогтмол харилцсанаар ажилчдынхаа ёс зүйн зан төлвийг сайжруулж чаддаг. Тэд зөв зааварчилгаа өгснөөр ажилчдын ёс зүйн зан төлвийн тухай үзэл бодлыг өөрчилж болдог. (Brown and Trevino 2006).',
            'Байгууллагын ёс зүйн уур амьсгалд нийтлэг үнэт зүйл болон ажилчдын ёс суртахууны асуудалд суурилсан итгэл үнэмшил багтдаг (Trevino et al. 1998).',
            'Ёс зүйн уур амьсгал нь тухайн байгууллагын ёсзүйн үйл ажиллагаа болон дүрэм журмын талаарх тогтвортой, сэтгэл зүйн ач холбогдолтой асуудлыг ажилчид хэрхэн хүлээн авч буйгаас хамааралтай (Schneider 1975; Shepard 1994).',
            'Ёс зүйн тохиромжтой уур амьсгал бүрэлдсэн үед байгууллагын ажилчид дотоод дүрэм журмыг даган мөрдөж, шудрага байдлыг бий болгон хариуцлагатай ханддаг (Luria and Yagil 2008).',
          ],
          doc.x,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
          },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, 'Сорилын үр дүн');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Ёс зүйн манлайллыг үнэлэх тестийн бүлэг тус бүрд харгалзах оноог тооцоолж дараах графикт нэгтгэн үзүүлэв. Графикаас та өөрийн оноотой танилцаарай.',
          { align: 'justify' },
        )
        .moveDown(1);

      const categories = result.details.map((detail) => detail.value);

      const values = result.details.map((detail) => Number(detail.cause));
      const divisors = [4, 4, 4, 4];
      const averages = [5, 5, 5, 5];

      for (let index = 0; index < categories.length; index++) {
        const category = categories[index];

        if (index > 0) {
          doc.moveDown(3.2);
        }

        const currentY = doc.y;

        doc
          .font(fontBold)
          .fontSize(12)
          .fillColor(colors.black)
          .text(category + ' ', { continued: true })
          .font('fontBlack')
          .fillColor(colors.orange)
          .text(String(values[index]), { continued: false });

        const result =
          values[index] <= 1.75
            ? 'Маш сул түвшин'
            : values[index] <= 2.5
              ? 'Дунд зэрэг сул түвшин'
              : values[index] <= 3.25
                ? 'Дунд зэрэг сайн түвшин'
                : 'Өндөр түвшин';

        doc
          .font(fontBold)
          .fontSize(10)
          .fillColor(colors.black)
          .text(`${result}`, marginX, currentY, {
            width: doc.page.width - marginX * 2,
            align: 'right',
          });

        doc.moveDown(-0.8);

        const buffer = await this.vis.bar(
          values[index],
          divisors[index],
          averages[index],
          '',
        );

        doc.image(buffer, {
          width: doc.page.width - marginX * 2,
          height: (130 / 1800) * (doc.page.width - marginX * 2),
        });
      }
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Хамгийн өндөр оноотой бүлэг нь танд давамгайлан илэрч буй ёс зүйн манлайллын бүлгийн шинж чанарыг илтгэнэ. Энэхүү тест нь бүлгүүдийн оноог нэгтгэж, нэгдсэн үр дүнг тооцож гаргахгүй болохыг анхаараарай. Таны авсан оноог бүлэг тус бүрээр дараагийн хуудсуудад дэлгэрэнгүй тайлбарлав.',
          marginX,
          doc.y + 40,
          { align: 'justify' },
        )
        .moveDown(0.5);

      footer(doc);

      const details: ResultDetailEntity[] = result.details;
      const results = [];

      for (const detail of details) {
        const result = this.result(detail.value);
        results.push({ ...result, point: +detail.cause, value: detail.value });
      }

      for (const r of results) {
        doc.addPage();
        header(doc, firstname, lastname, r.name);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.description, { align: 'justify' })
          .moveDown(1);

        const startX = marginX;
        let startY = doc.y;
        const tableWidth = doc.page.width - marginX * 2;
        const leftW = tableWidth * 0.35;
        const rightW = tableWidth * 0.65;
        const rowHeight = 180;

        doc.lineWidth(1).strokeColor('#000');

        doc
          .moveTo(startX, startY)
          .lineTo(startX + tableWidth, startY)
          .stroke();
        doc
          .moveTo(startX, startY)
          .lineTo(startX, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX + leftW, startY)
          .lineTo(startX + leftW, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX + tableWidth, startY)
          .lineTo(startX + tableWidth, startY + rowHeight)
          .stroke();
        doc
          .moveTo(startX, startY + rowHeight)
          .lineTo(startX + tableWidth, startY + rowHeight)
          .stroke();

        const scorePct = Math.round((r.point / 4) * 100);
        const pie = await this.vis.doughnut(colors.nonprogress, 100, scorePct);
        const width = (doc.page.width - marginX * 2) / 2;
        doc.image(pie, startX + leftW + 40, startY + 15, { width });

        const xPosition = startX + leftW + 150;
        const yPosition = startY + 104;

        let levelLabel = '';
        let caseText = '';
        let caseTitle = '';

        if (r.point <= 1.75) {
          levelLabel = 'МАШ СУЛ ТҮВШИН';
          caseText = r.case1;
          caseTitle = 'Маш сул түвшин:';
        } else if (r.point <= 2.5) {
          levelLabel = 'ДУНД ЗЭРЭГ СУЛ ТҮВШИН';
          caseText = r.case2;
          caseTitle = 'Дунд зэрэг сул түвшин:';
        } else if (r.point <= 3.25) {
          levelLabel = 'ДУНД ЗЭРЭГ САЙН ТҮВШИН';
          caseText = r.case3;
          caseTitle = 'Дунд зэрэг сайн түвшин:';
        } else {
          levelLabel = 'ӨНДӨР ТҮВШИН';
          caseText = r.case4;
          caseTitle = 'Өндөр түвшин:';
        }

        const baseX = xPosition + 22;

        const label = 'Таны оноо';
        doc.font(fontNormal).fontSize(12).fillColor(colors.black);
        const labelWidth = doc.widthOfString(label);
        doc.text(label, baseX - labelWidth / 2, yPosition + 30);

        const pct = `${scorePct}%`;
        doc.font('fontBlack').fillColor(colors.orange).fontSize(28);
        const pctWidth = doc.widthOfString(pct);
        doc.text(pct, baseX - pctWidth / 2, yPosition);

        doc.font('fontBlack').fontSize(16).fillColor(colors.orange);
        const levelWidth = doc.widthOfString(levelLabel);
        doc.text(levelLabel, baseX - levelWidth / 2, yPosition + 50);

        doc
          .font(fontBold)
          .fontSize(13)
          .fillColor(colors.black)
          .text(caseTitle, marginX, startY + rowHeight + 20, {
            align: 'justify',
          })
          .moveDown(0.5);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(caseText, {
            align: 'justify',
          })
          .moveDown(1);
        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.add, {
            align: 'justify',
          })
          .moveDown(1);

        footer(doc);
        doc.addPage();
        header(doc, firstname, lastname, r.name);

        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.intro, {
            align: 'justify',
          })
          .moveDown(1);
        doc
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(r.list, doc.x, doc.y, {
            align: 'justify',
          })
          .moveDown(1);
        footer(doc);
      }
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        'EUROSAI – Ёс зүйн манлайллын ач холбогдол',
      );
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'EUROSAI (European Organization of Supreme Audit Institutions) - төрийн аудитын байгууллагуудын хамтын ажиллагааны сүлжээ бөгөөд тэд ёс зүйн манлайллын талаар тусгайлан судалгаа, зааварчилгааг гаргасан байдаг бөгөөд дор орууллаа. ',
          doc.x,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(1);

      const traits = [
        {
          name: 'Зайлсхийх үйлдэл',
          color: colors.blockRed,
          description: 'SAI дотроо ямар нэг ёс зүйн кодгүй байх',
          description2:
            'Шударга байдлыг зөрчиж болзошгүй нөхцөл байдал үүсэхэд мэдээгүй юм шиг өнгөрөөх, дүр эсгэх\n• Шударга байдал зөрчигдөж буйг няцаах, үл тоох\n• Хувь хүмүүст хэт их найдах, “өөрсдөө учраа олцгоох байх” гэсэн бодлоор хандах',
        },
        {
          name: 'Хэвшүүлэх үйлдэл',
          color: colors.green,
          description:
            'SAI дотроо ёс зүйн кодыг боловсруулсан хэрэгжүүлснээр: \n• Үнэт зүйлсээ тодорхой болгоно\n• Бусдыг чиглүүлнэ\n• Зан төлөвийн болон гүйцэтгэлийн хэм хэмжээг тогтооно\n• Хувь эзэмшигчид болон оролцогч талуудын итгэлийг хүлээнэ',
          description2:
            '• “Ёс зүй бол үргэлж эрхэмлэн сахих зүйлсийн нэг мөн” болохыг дотоод дүрэм журмаараа тогтмол илэрхийлж, ухуулга хийдэг байх\n• Ёс зүй бол зайлшгүй чухалчилж авч үзэх шаардлагатай зүйл болохыг дээд удирдлагууд ойлгодог байх\n• Ёсзүйг сайжруулахад чиглэсэн стратегитэй болохуйц ёсзүйн дэд бүтцийг цогцлоох\n• Ёс зүйтэй холбогдох эх үүсвэрүүдийг хуваарилах (цаг хугацаа, ажилтан, орон зай болон бэлтгэл сургуулилт)',
        },
      ];

      const traits2 = [
        {
          name: 'Зайлсхийх үйлдэл',
          color: colors.blockRed,
          description:
            '• Буруу үлгэр үзүүлэх, дүрэм журамд зааснаас эсвэл хэлэлцсэнээс өөрөөр эсвэл эсрэгээр хийх\n• Эрх мэдлээ урвуулан ашиглах\n• Албан тушаалаа хувийн эрх ашигт нийцүүлэн ашиглах, эсвэл ажлын байрыг улс төрийн зорилгоор ашиглах\n• Хувийн, улс төрийн зорилгоор аудитын дүгнэлт, хэрэгжүүлбэл зохих арга хэмжээг гажуудуулах \n• Биеэ тоох: “Би бол дарга. Хүнтэй хүндэтгэлтэй харилцах шаардлага надад байхгүй” гэсэн хандлага\n• Хариуцлагаас зугтаах, зайлсхийх',
        },
        {
          name: 'Хэвшүүлэх үйлдэл',
          color: colors.green,
          description:
            '• Суурь үнэт зүйлсийг тодорхойлж, харуулах\n• Бусдын төлөө санаа зовнидог, түүнийгээ илэрхийлдэг байх\n• Хүн бүрийн оролцоо чухал болохыг тэдэнд ойлгуулж, хүн тус бүрээс шаардагдах хүчин чармайлт, зүтгэлийг тодорхойлж, тэдэнд ойлгуулах\n• Хүнд нөхцөл байдалд ёсзүйтэй шийдвэр гаргадаг байх\n• Менежментийг мэргэжлийн төвшинд хэрэгжүүлдэг байх\n• Бие биедээ зөвлөж, хүндэтгэлтэй харилцдаг байх. Эргэх холбоо үүсгэх\n• Өөрийн болон бусдын зан төлөв, шийдвэр гаргалтад хариуцлагатай ханддаг, хариуцлага хүлээдэг байх\n• Хариуцлага болон ил тод байдлыг өндөр стандартын дагуу хэрэгжүүлж түүндээ нийцэж ажилладаг байх',
        },
      ];

      const traits3 = [
        {
          name: 'Зайлсхийх үйлдэл',
          color: colors.blockRed,
          description:
            '• Танил талаа ажилд авах хандлага\n• Ажилтнуудад тавигдах ур чадваруудыг хэт доогуур тогтоох: тухайн ажлын байранд ур чадвар дутмаг, шаардлага хангахгүй ажилтныг авах\n• Ажилтнуудаа үүргээ гүйцэтгэх хангалттай нөөцөөр хангалгүйгээр тэднээс ихийг шаардах\n• Тодорхой үндэслэлгүйгээр ажилтныг тушаал дэвшүүлэх',
        },
        {
          name: 'Хэвшүүлэх үйлдэл',
          color: colors.green,
          description:
            '• Ёс зүй болон ажлын бүтээмж зэргийг өдөр тутмын удирдлагын үндсэн чанар болгож мөрдөх. Ажилд шинээр авах, гүйцэтгэлийн урамшуулал, мэргэшүүлэх зэрэг хүний нөөцийн үйл ажиллагаа, бодлогод нь тусган оруулах\n• Эерэг зан төлөв бүрийг анзаарч, урамшуулдаг байх\n• Бие биедээ итгэх итгэлцэл бий болгох үйлдлүүдийг хэрэгжүүлдэг байх (ажил үүргээ гүйцэтгэхэд түлхэц болохуйц мэдээ, мэдээллийг биедээ дамжуулдаг байх)',
        },
      ];

      const traits4 = [
        {
          name: 'Зайлсхийх үйлдэл',
          color: colors.blockRed,
          description:
            '• Ажилтан, баг хамт олонтойгоо зөвлөлдөхгүйгээр ганцаар шийдвэр гаргах\n• Бусдын эрх ашиг, хэрэгцээ шаардлага, хүлээлт зэргийг үл ойшоох\n• Ёсзүйтэй холбоотой асуудлуудын талаар ямар нэг хэлэлцүүлэг өрнүүлэхгүй байх\n• Зөвлөгөө, чиглүүлэг олгохдоо сайтар тайлбарлахгүй, хангалттай ойлголтыг өгөхгүй байх',
        },
        {
          name: 'Хэвшүүлэх үйлдэл',
          color: colors.green,
          description:
            '• Бүгдийг оролцуулсан шийдвэр гаргаж, бүрэн мэдээлэл, тайлбар хийдэг байх\n• Шийдвэр гаргахдаа ажилтнуудын санал бодлыг сонсдог байх\n• Ёсзүйтэй холбоотой үүсэж буй асуудал, төөрөгдөл зэргийн талаарх хэлэлцүүлгийг чөлөөтэй өрнүүлэх боломж бүрдүүлж  хэлэлцүүлэг хийх сэдлийг төрүүлдэг байх\n• Нээлттэй харилцан хоёр талаасаа суралцаж, хөгжих орчин, нөхцөлийг бүрдүүлдэг байх\n• Удирдамж, чиглэлээр хангадаг байх\n• Тухайн ажилтан өөрт тулгарсан асуудлынхаа талаар зөвлөгөө авах шаардлагатай үед ёсзүйн зөвлөмж, заавар бүхий гарын авлага, түүний талаар хэлэлцэхэд бэлэн байх',
        },
      ];

      const traits5 = [
        {
          name: 'Зайлсхийх үйлдэл',
          color: colors.blockRed,
          description:
            '• Ёсзүйн зөрчлөөс сэргийлэх арга хэмжээ авахгүй байх\n• Асуудалтай нуур тулгарах ямар нэг эсвэл дорвитой арга хэмжээ авахгүй байх\n• Ёсзүйн кодыг зөрчих\n• Ёсзүйд үл нийцэх нөхцөл байдал үүссэн тохиолдолд ямар нэгэн арга хэмжээ авахгүй байх\n• Ажиллах сахилга батын талаар анхаарал хандуулахгүй байх',
        },
        {
          name: 'Хэвшүүлэх үйлдэл',
          color: colors.green,
          description:
            '• Ёсзүйтэй холбогдон үүсэж болзошгүй эрсдэлүүдийг урьдчилан тодорхойлж шийдвэрлэх арга замыг боловсруулах\n• Ажлын байран дахь зан төлөвүүдэд үнэлгээ хийх, зохистой, зохисгүй хандлагуудыг ангилах дүгнэх\n• Байнга анхаарал хандуулж, хяналт, удирдлагын хэрэгслүүдийг тогтмол ашигладаг байх\n• Шаардлагатай тохиолдолд залруулах дорвитой арга хэмжээг авдаг байх\n• Хэн нэгний санаатайгаар үйлдсэн буруу үйлдлийг цааш мэдээлэх, илчлэх дүрэм, журмуудыг боловсруулж хэвшүүлэх\n• Байнга эргэж нягталдаг байх',
        },
      ];

      async function renderTraitsSection(
        traits: any[],
        title: string,
        marginX: number,
        colors: any,
        isTwoRows = false,
      ) {
        const titleHeight = 26;
        const titleWidth = doc.page.width - marginX * 2;

        doc
          .rect(marginX, doc.y, titleWidth, titleHeight)
          .fill(colors.blockIndigo);
        doc
          .font('fontBlack')
          .fontSize(13)
          .fillColor('#ffffff')
          .text(title, marginX, doc.y + 6.5, {
            width: titleWidth,
            align: 'center',
          });

        const sectionY = doc.y + 2;

        doc
          .moveTo(marginX, sectionY)
          .lineTo(doc.page.width - marginX, sectionY)
          .lineWidth(4)
          .strokeColor(colors.softIndigo)
          .stroke();

        doc.moveDown(0.5);

        let startY = doc.y + 5;
        const colWidth = (doc.page.width - marginX * 2 - 20) / 2;
        const separatorX = marginX + colWidth + 10;

        const descHeights = traits.map((trait) =>
          doc.heightOfString(trait.description, { width: colWidth }),
        );
        const row1Height = Math.max(...descHeights) - 15;

        traits.forEach((trait, i) => {
          const x = marginX + i * (colWidth + 20);
          doc
            .font('fontBlack')
            .fontSize(13)
            .fillColor(trait.color)
            .text(trait.name, x, startY);

          doc
            .font(fontNormal)
            .fontSize(12)
            .fillColor(colors.black)
            .text(trait.description, x, startY + 20, {
              width: colWidth,
            });
        });

        if (isTwoRows) {
          const lineY = startY + 20 + row1Height + 5;
          doc
            .moveTo(marginX, lineY)
            .lineTo(marginX + colWidth * 2 + 20, lineY)
            .lineWidth(1)
            .strokeColor('#cccccc')
            .stroke();

          const secondRowStartY = lineY + 10;
          const desc2Heights = traits.map((trait) =>
            doc.heightOfString(trait.description2 || '', { width: colWidth }),
          );
          const row2Height = Math.max(...desc2Heights);

          traits.forEach((trait, i) => {
            const x = marginX + i * (colWidth + 20);
            doc
              .font(fontNormal)
              .fontSize(12)
              .fillColor(colors.black)
              .text(trait.description2 || '', x, secondRowStartY, {
                width: colWidth,
              });
          });
        }
      }

      await renderTraitsSection(
        traits,
        'Шударга байдлыг сахих',
        marginX,
        colors,
        true,
      );
      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        'EUROSAI – Ёс зүйн манлайллын ач холбогдол',
      );
      await renderTraitsSection(
        traits2,
        'Үлгэр жишээч байх: Өөрөөрөө үлгэрлэх',
        marginX,
        colors,
      );
      doc.y = doc.y + 20;
      await renderTraitsSection(traits3, 'Ёс зүйн менежмент', marginX, colors);
      doc.lineWidth(1);
      footer(doc);

      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        'EUROSAI – Ёс зүйн манлайллын ач холбогдол',
      );

      await renderTraitsSection(
        traits4,
        'Ил тод, нээлттэй байх бодлого',
        marginX,
        colors,
      );
      doc.y = doc.y + 20;

      await renderTraitsSection(traits5, 'Хэрэгжүүлэлт', marginX, colors);
      doc.lineWidth(1);

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, 'Үйл ажиллагааны төлөвлөгөө');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Өөрийн үнэлгээний асуулгад хариулан энэхүү тайлангаар та өөрийн авсан оноог харсан байх. Одоо харин ёс зүйн манлайллаа сайжрлуулах бодитой ажил хэрэг болох үйл ажиллагааныхаа төлөвлөгөөг боловсруулаарай. Та үүнийг ашиглан байгууллагынхаа ёс зүйн уур амьсгалыг сайжруулах гарцуудыг тодорхойлж болно. Мөн уг үнэлгээний аргачлалыг ашиглан өөрийн чадвараа тогтмол үнэлдэг байх нь хувийн ёс зүйн манлайлах чадвараа хэмжих, сайжруулахад бөгөөд дээр дурдсан гарцуудын хэрэгжилтийг хянахад ашиглах боломжтой юм.',
          {
            align: 'justify',
          },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.black)
        .text('Үе шат', {
          align: 'justify',
        })
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .text(
          '1. Өөрийн хариултууддаа үндэслэн ажилтнуудаасаа хүлээж буй ёс зүйн хэм хэмжээний хүлээлтээ ойлгуулдаг байгаарай.',
          marginX,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .text(
          '2. Ёс зүйн луужингийн хэсэг бүр дэх тодорхой нэг үйлдлийг энэ жилийн туршид хөгжүүлэх зорилгоо болгон сонгон авах:',
          marginX,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(0.5);

      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Ёс зүйн манлайллын луужин - Ёс зүйтэй шийдвэр гаргах чадвараа сайжруулах',
            'Ёс зүйн манлайллын луужин - Ажилтнуудаасаа хүлээж буй ёс зүйн хэм хэмжээний хүлээлтээ ойлгуулдаг байхтай холбоотой сайжруулах',
            'Ёс зүйн манлайллын луужин - Ёс зүй бол эрхэмлэх үнэт зүйл мөн болохыг сайжруулах',
            'Ёс зүйн манлайллын луужин - Дотоодод хэрэгжиж буй ёс зүйн байдлыг сайжруулах',
          ],
          marginX + 30,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
          },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .text(
          '3. Хөгжүүлэхээр сонгон авсан үйлдлээ хэрхэн хэрэгжүүлэх талаар сайтар тунгааж тодорхой хэд хэдэн үе шатуудыг бичнэ үү. Ингэж хийхдээ доорхи жишээ загварыг уншиж үзээрэй.',
          marginX,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(0.5);
      doc.image(assetPath(`icons/ethic`), {
        width: doc.page.width - marginX * 2,
      });
      doc
        .font(fontNormal)
        .fontSize(12)
        .text(
          'Ёс зүйн манлайллын өөрийн үнэлгээний хэрэгслийн үр дүнгээс та өөрийн давуу болон сайжруулах шаардлагатай талуудаа тодорхойлсон байх. Өндөр үнэлгээ авсан чиглэлүүдээ улам бататгаж, сул тал илэрсэн чиглэлүүддээ анхаарлаа хандуулснаар та илүү шударга, итгэл даасан, ёс зүйгээр манлайлагч удирдагч болж чадна. Ёс зүйгээр манлайлна гэдэг нь зөвхөн өөрийн үйлдлийг зөв байлгаад зогсохгүй, бусдыг ёс зүйтэй байхад нь уриалж, нэгэн зорилготой соёлыг цогцлоох үйлс юм. Энэ үйлсэд тань амжилт хүсье!',
          marginX,
          doc.y + 145,
          {
            align: 'justify',
          },
        )
        .moveDown(0.5);
      footer(doc);
    } catch (error) {
      console.log('ethic', error);
    }
  }
}
