import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity, ResultDetailEntity } from 'src/entities';
import {
  assetPath,
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { SinglePdf } from '../single.pdf';
import { VisualizationService } from '../visualization.service';
const sharp = require('sharp');

@Injectable()
export class Inappropriate {
  constructor(
    private single: SinglePdf,
    private vis: VisualizationService,
  ) {}

  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    header(doc, firstname, lastname);
    title(doc, result.assessmentName);
    info(
      doc,
      exam.assessment.author,
      exam.assessment.description,
      exam.assessment.measure,
      exam.assessment.usage,
    );
    doc.font(fontBold).fontSize(13).text('Оршил').moveDown(0.5);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Ажлын байран дахь зохисгүй зан төлөв нь ажилтнуудын хувьд  байгууллагын нийтлэг хэм хэмжээг дагахыг сэдэлжүүлэх нөхцөл дутагдсанаас эсвэл эсрэгээр нь зохисгүй үйлдэл гаргахыг сэдэлжүүлж буй байгууллагын юм уу нийгмийн хэм хэмжээнээс хамаардаг. (Kaplan, 1975) Эдгээр үйл хөдлөл байгууллагын дэд соёл, ажлын бүлгийн нийтлэг хэм хэмжээнээс илүү зохисгүй үйлдлийг дэмжих давамгайлах нөлөөлөл үзүүлж буй учир шалтгааныг олж илрүүлэх зорилготой юм. (Kaplan, 1975)\n\nАжлын байран дахь зохисгүй зан төлөвийн судалгаа нь ёс зүйн судалгаанаас ялгаатай бөгөөд байгууллагын нийтлэг итгэл үнэмшлийн эсрэг үйлдэлд илүү төвлөрдөг, зөв бурууг ялгасан шударга ёс, хууль эрх зүй, ёс суртахуун лаг байдлыг бий болгохыг оролдсон нийгмийн зааварчилгааг даган мөрдөж буй байдлыг судалдаг. (Lewis, 1985)  Тодорхой үйлдэл нь байгууллагын хувьд зохисгүй үйлдэл биш боловч нийгэмд нийтээр ёс суртахуунгүй үйлдэл байж болох талтай.\n\nМэдээж тодорхой нэг зан төлөв нь нэг дор зохисгүй дээр нь ёс зүйгүй байж болно, энэ 2 хоорондоо зайлшгүй холбогдох албагүй юм. Жишээ нь, Голын усанд хортой хаягдал хаях нь тухайн байгууллагын бодлоготой нийцэж байгаа бол үүнийг байгууллагын зохисгүй үйлдэл биш гэж үзэх нь. Харин бараг бүх л хүмүүсийн хувьд энэ нь суртахуунгүй үйлдэл мөн билээ. ',
        { align: 'justify' },
      )
      .moveDown(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Тестийн тухай');

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Ажлын байран дахь зохисгүй зан төлөв нь байгууллагын болон байгууллагын гишүүдийг аль алиныг нь хохиролд оруулж болох юм. Зохисгүй зан төлөв гэдэг нь тодорхой нэг хэм хэмжээг зөрчиж буй үйлдэл (Cohen, 1966), үр дүнд нь хүлээн зөвшөөрөгдөөгүй үйлдлүүд бий болно. (Best, 1982).\n\nҮүнээс үзэхэд ажлын байран дээрх зохисгүй зан төлөв нь байгууллагын үйл ажиллагааг тогтвортой байхын эсрэг чиглэгддэг. Мөн ажлын байрны зохисгүй зан төлөв нь нийгмийн хэм хэмжээний жижиг хэсгүүдийг хамруулдаггүй. Тухайлбал, ажлын байран дээр буруу хувцаслалт гэх мэт байгууллагын үйл ажиллагаанд бүхэлд нь тийм ч сөрөг нөлөө үзүүлээгүй тохиолдлуудыг заавал хамруулах шаардлагагүй юм.\n\nДээрхээс дүгнэхэд ажлын байран дахь зохисгүй зан төлөв гэдэг нь “байгууллагын гишүүдийн нийтлэг мөрдөж буй хэм хэмжээг зөрчих, улмаар байгууллагын үйл ажиллагаа, үр ашигт сөргөөр нөлөөлдөг ажилтнуудын гаргаж буй үйлдлийн нэгдлийг хэлнэ” хэмээн тодорхойлж болно.',
        { align: 'justify' },
      )
      .moveDown(1);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Robinson & Bennett нарын боловсруулсан тус хэмжүүрийг ашигласан судалгаануудын нийтлэг үр дүн:',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .list(
        [
          'Ажлын үр дүнд үзүүлэх нөлөө: Ажлын байран дээр дүрэм зөрчиж, сөрөг авир гаргадаг ажилтнуудын бүтээмж ерөнхийдөө доогуур байдаг. Байгууллагын хэмжээнд зохисгүй зан төлөв өндөр түвшинд байх нь харилцагчийн сэтгэл ханамж буурах, ашигт ажиллагаа болон бүтээмж унах хандлагатай байдаг (qic-wd.org).',
          'Ажилтны хандлага, сэтгэл зүйд үзүүлэх нөлөө: Зохисгүй зан төлөв нь ихэвчлэн сөрөг хандлагын илрэл байдаг тул ажилтны сэтгэл ханамж, байгууллагатайгаа холбогдох мэдрэмжтэй шууд хамааралтай. Ажилдаа сэтгэл ханамж өндөр, байгууллагадаа үнэнч (commitment), өөрийгөө чухал гэж мэдэрдэг (identification) ажилтнууд зохисгүй зан төлөв бага гаргадаг бол эсрэгээрээ ажлын стресс ихтэй үүнээсээ болж ажлаасаа гарах сэдэл өндөртэй ажилтнууд зохисгүй зан төлөв илүү гаргадаг (qic-wd.org).',
          'Ёс зүйн орчны нөлөө: Ажилтнууд байгууллагын ёс зүйн хэм хэмжээ өндөр гэж үзэх тусам хулгай, дүрэм зөрчих зэрэг зохисгүй зан төлөв гаргах нь багасдаг. Харин байгууллага нь шударга бус, ажилтнуудыг мөлжиж байна гэсэн ойлголт давамгайлах үед алдаа гаргах, эсэргүүцлийн шинжтэй зан төлөв үзүүлэх нь нэмэгддэг (ijstr.org).',
          'Стрессийн нөлөө: Ажлын байрны стресс (ачаалал, дарамт, зохисгүй харилцаа г.м.) нэмэгдэхийн хэрээр ажилтнууд сэтгэл зүйгээ хамгаалах үүднээс дүрэм зөрчих, ажлаас хоцрох, ажлын чанарыг санаатайгаар бууруулах зэрэг зан төлөв гаргах хандлага их байдгийг олон судалгаа баталсан байна (scienceforwork.com).',
        ],
        doc.x + 20,
        doc.y,
        {
          align: 'justify',
          //   bulletRadius: 1.5,
          columnGap: 8,
          listType: 'numbered',
        },
      )
      .moveDown(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Сорилын үр дүн');
    const categories = [
      'НИЙТ',
      ...result.details.map((detail) => detail.value),
    ];

    const values = [
      Number(result.value),
      ...result.details.map((detail) => Number(detail.cause)),
    ];
    const divisors = [5, 5, 5, 5, 5];
    const averages = [6, 6, 6, 6, 6];

    for (let index = 0; index < categories.length; index++) {
      const category = categories[index];

      if (index > 0) {
        doc.moveDown(3.8);
      }
      const currentY = doc.y;

      doc
        .font(fontBold)
        .fontSize(12)
        .fillColor(colors.black)
        .text(category + ': ', { continued: true })
        .font('fontBlack')
        .fillColor(colors.orange)
        .text(String(values[index]), { continued: false });

      let level = '';
      const score = values[index];

      if (category === 'НИЙТ') {
        if (score <= 1.9) level = 'Маш бага';
        else if (score <= 2.9) level = 'Бага';
        else if (score <= 3.9) level = 'Дунд';
        else level = 'Өндөр';
      } else {
        level = '';
      }

      doc
        .font(fontBold)
        .fontSize(10)
        .fillColor(colors.black)
        .text(level || ' ', marginX, currentY, {
          width: doc.page.width - marginX * 2,
          align: 'right',
        });

      doc.moveDown(-0.8);

      const buffer = await this.vis.bar(
        values[index],
        divisors[index],
        averages[index],
        '',
      );

      doc.image(buffer, {
        width: doc.page.width - marginX * 2,
        height: (130 / 1800) * (doc.page.width - marginX * 2),
      });
    }
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Эдгээр оноо нь ерөнхий чиг баримжаа бөгөөд үнэлгээг байгууллагын онцлог, салбар, ажилтнуудын тоо зэрэг хүчин зүйлтэй уялдуулан тайлбарлах нь зүйтэй юм. Тайлангийн дараагийн хэсэгт зан төлөв бүрээр үр дүнг тайлбарлан, ямар арга хэмжээг хэрэгжүүлэх боломжтой талаар орууллаа.\n\nОлон ажилтнаас авсан асуулгын хариултыг нэгтгэхдээ байгууллагын хэмжээнд зохисгүй зан төлөвийг дундажлан хэмжихээс гадна, асуулт болон зан төлөв бүрийн дундаж оноог тооцоолж аль зан төлөв илүү давамгай байгааг тодорхойлох боломжтой. Жишээлбэл, бүх ажилтнуудын хариултын дундаж production deviance-ийн асуултууд дээр 4.0, харин personal aggression-ийн асуултууд дээр 1.5 гарсан бол бүтээмжтэй холбоотой зөрчил түгээмэл, харин хувь хүний шинжтэй зохисгүй зан төлөв бараг ажиглагддаггүй гэж дүгнэж болно. Мөн асуулт бүрийн түвшинд дүн шинжилгээ хийснээр ямар зан төлөвийг илүү сайжруулах шаардлагатайг тодорхойлох боломжтой. Жишээ нь: “цайны цагаа хэтрүүлэх” хамгийн түгээмэл зөрчил байхад, харин “ажлын байран дээрээсээ эд зүйл хулгайлах” маш ховор тохиолддог болохыг харж болно.',
        marginX,
        doc.y + 45,
        { align: 'justify' },
      )
      .moveDown(0.5);

    footer(doc);

    doc.addPage();
    header(
      doc,
      firstname,
      lastname,
      'Ажлын байрны зохисгүй зан төлөвийн төрлүүд',
    );
    const titleHeight = 26;
    const titleWidth = doc.page.width - marginX * 2;

    const rectY = doc.y;
    doc.rect(marginX, rectY, titleWidth, titleHeight).fill(colors.blockIndigo);

    doc
      .font('fontBlack')
      .fontSize(13)
      .fillColor('#ffffff')
      .text('Бүтээмжтэй холбоотой зохисгүй зан төлөв', marginX, rectY + 6.5, {
        width: titleWidth,
        align: 'center',
      });

    const sectionY = rectY + titleHeight;

    doc
      .moveTo(marginX, sectionY)
      .lineTo(doc.page.width - marginX, sectionY)
      .lineWidth(4)
      .strokeColor(colors.softIndigo)
      .stroke();

    const imgPath = assetPath('icons/inapp1');
    const imgHeight = 40;
    doc.image(imgPath, marginX + 5, rectY + (titleHeight - imgHeight) / 2, {
      height: imgHeight,
    });

    doc.moveDown(1.25);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Бүтээмжтэй холбоотой зохисгүй зан төлөв гэдэг нь “гүйцэтгэх ёстой ажлыг зааж өгсөн албан ёсны хамгийн бага чанар болон хамгийн бага хийж гүйцэтгэх тоо норм хэмжээг зөрчихийг хэлнэ.  Ажлаас хоцрох, ажил тарах цагаас өмнө гарч явах, амралтын цагийг хэтрүүлэх, хүчин чармайлт гаргахгүй байх, нөөцүүдийг үр дүнгүй ашиглах, ажлын байран дээр мансууруулах бодис, согтууруулах ундааны зүйлс хэрэглэх, ажил таслах зэрэг нь бүтээмжтэй холбоотой гарах зохисгүй зан төлөвийн төрөлд орно (Robinson & Bennet, 1995). Хүчин чармайлт гаргахгүй байна гэдэг нь ажилтан ажилтайгаа холбоотой хийгдэх даалгавруудыг өөрийн авьяас чадвараа маш бага ашиглан хийж байгааг хэлнэ  (Robinson & Bennet, 1995). Тэдгээр нь байгууллагын бүтээмжид сөргөөр нөлөөлж байдаг. Ажлаасаа хоцордог ажилчид, ихэнхдээ ажлаа байнга тасалдаг  (Kidwell, 1995).',
        { align: 'justify' },
      )
      .moveDown(1);

    const rectY2 = doc.y + 15;
    doc.rect(marginX, rectY2, titleWidth, titleHeight).fill(colors.blockOrange);

    doc
      .font('fontBlack')
      .fontSize(13)
      .fillColor('#ffffff')
      .text('Бодлоготой холбоотой зохисгүй зан төлөв', marginX, rectY2 + 6.5, {
        width: titleWidth,
        align: 'center',
      });

    const sectionY2 = rectY2 + titleHeight;

    doc
      .moveTo(marginX, sectionY2)
      .lineTo(doc.page.width - marginX, sectionY2)
      .lineWidth(4)
      .strokeColor(colors.amberOrange)
      .stroke();

    const imgPath2 = assetPath('icons/inapp2');
    doc.image(imgPath2, marginX + 5, rectY2 + (titleHeight - imgHeight) / 2, {
      height: imgHeight,
    });

    doc.moveDown(1.25);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Бодлоготой холбоотой зохисгүй зан төлөв гэдэг нь нийгмийн харилцаанд орохдоо бусдыг хувь хүн болон эрх талаас нь сул дорой байдалд оруулж буй зан төлөвийг хэлнэ. Ажлын байран дээр бусдыгаа гомдоох, бусдад тал засах, хамтран ажиллагчийнхаа талаар цуурхал тараах, шударга бусаар өрсөлдөх зэрэг нь бодлоготой холбоотой гарах зохисгүй зан төлөвт хамаарна. (Robinson & Bennet, 1995)\n\n	Бусдыг гомдоох гэдэг нь санаатай болон санамсаргүйгээр хэн нэгэнтэй бүдүүлэг харилцах, хүндэтгэлгүй харилцах харилцааг хэлнэ. Аль нэг хамтран ажиллагчаа ярьж байхад нь саад болох, ялгаварлан гадуурхсан утга бүхий захиа өгөх, тусалж дэмжлэг үзүүлэхэд нь талархалгүй хандах зэрэг олон харилцаанууд байна. Энэ нь маш өргөн дэлгэр тохиолддог. Судалгаагаар ажилчдын 55% нь хамтран ажиллагчдаа ямар нэгэн гомдоох үг хэллэг хэлсэн гэсэн байдаг. Үүнээс гарах сөрөг үр дагавар маш аюултай байдаг. Ийм төрлийн зан авиртай ажилчид ажилдаа ханамж багатай, ажлаасаа гарах өндөр магадлалтай хүмүүс байдаг. Мөн сэтгэлээр унасан, бачимдуу, сэтгэлийн түгшүүртэй ажилчид байдаг. Ажлын байран дээр гаргаж буй бусдыг гомдоох байдал зарим нэг зохисгүй зан төлөвийн шалтгаан болж байдаг. Ажил таслах, хулгай хийх, ажлыг санаатайгаар буруу хийх, түрэмгий зан гаргах зэрэг нь бүдүүлэг зан авирын үр дүн юм. Хэдийн чинээ хүчтэй байна төдий чинээ үр дагавартай сөрөг үйлдлийг дагуулдаг. Жижиг гэлтгүй энэ нь цааш цаашдын аюултай сөрөг үр дагаварт хүргэж байдаг (Everton, W.J, Jolton, J.A & Mastrangelo, P.M, 2007).   ',
        { align: 'justify' },
      )
      .moveDown(1);
    doc.lineWidth(1);

    footer(doc);
    doc.addPage();
    header(
      doc,
      firstname,
      lastname,
      'Ажлын байрны зохисгүй зан төлөвийн төрлүүд',
    );
    doc.rect(marginX, rectY, titleWidth, titleHeight).fill(colors.blockTeal);

    doc
      .font('fontBlack')
      .fontSize(13)
      .fillColor('#ffffff')
      .text(
        'Эд хөрөнгөтэй холбоотой зохисгүй зан төлөв',
        marginX,
        rectY + 6.5,
        {
          width: titleWidth,
          align: 'center',
        },
      );

    doc
      .moveTo(marginX, sectionY)
      .lineTo(doc.page.width - marginX, sectionY)
      .lineWidth(4)
      .strokeColor(colors.turquoise)
      .stroke();

    const imgPath4 = assetPath('icons/inapp4');
    doc.image(imgPath4, marginX + 5, rectY + (titleHeight - imgHeight) / 2, {
      height: imgHeight,
    });

    doc.moveDown(1.25);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        '	Эд хөрөнгөтэй холбоотой зохисгүй зан төлөв гэдэг нь ажилтан компанийн биет хөрөнгө болон эд зүйлсийг ямар нэгэн зөвшөөрөлгүйгээр эзэмшиж, ашиглах болон эвдэж сүйтгэх тохиолдлуудыг хэлнэ (Robinson & Bennet, 1995). Эд хөрөнгөтэй холбоотой зохисгүй зан төлөв нь байгууллагыг нэлээд ноцтой хохирол учруулдаг. Багаж, тоног төхөөрөмжийг эвдэж сүйтгэх, хахууль авах, ажилласан цагаа худал мэдээлэх, компанийн нууц мэдээллийг задруулах, санаатайгаар алдаа гаргах, бэлэн мөнгөний кассыг буруугаар ашиглах, компаниас хулгай хийх зэрэг нь бүгд эд хөрөнгөтэй холбоотой гарах зохисгүй зан төлөвт хамаарна. Эвдэрсэн тоног төхөөрөмжийг шинээр худалдаж авч солино гэдэг нь компанийн хувьд шууд зардал байдаг. Цаашлаад энэ нь ажлын гарцад нөлөөлдөг. Учир нь тоног төхөөрөмжийг сольж байрлуулах хугацаанд ямар нэгэн байдлаар ажил хийгддэггүй  (Robinson & Bennet, 1995) (Everton, W.J, Jolton, J.A & Mastrangelo, P.M, 2007). \n\n	Хулгай гэдэг нь ажилтан даалгаврыг гүйцэтгэж, ажлаа хийж байх хугацаандаа компанийн мөнгө, эд хөрөнгийг зөвшөөрөлгүйгээр авах, ашиглах, шилжүүлэх зэргээр гаргаж буй зүй бус үйлдлийг хэлнэ (Greenberg, L & Barling, J, 1996). Нэгэн судалгаагаар ажилчдын 75% байгууллагын эд хөрөнгөнөөс 1 удаа хулгай хийсэн байдаг гэжээ. Ажилчдын хийж байгаа хулгайг бизнес эрхлэгчид хянах бараг боломжгүй зардал гэж үздэг. Зарим тохиолдолд ажилтан болон ажил олгогч хулгайн талаар өөр өөр бодолтой байдаг. Жишээлбэл, хоол буюу рестораны үйлчилгээ үзүүлэгч компанийн ажилтан хоол авч явахыг хулгай гэж үзэхгүй байтал ажил олгогч нь хулгай гэж үзэх гэх мэт. Өөр нэг төрлийн хулгай нь компанийн эд хөрөнгийг бусдад “найр тавьж” өгөх хэлбэр юм. Энэ нь компанийн эд хөрөнгийг ямар нэгэн төлбөр мөнгө авахгүйгээр, эсвэл хөнгөлөлттэй үнээр, ерөнхийдөө түншүүдтэйгээ нийгмийн харилцаагаа сайжруулах зорилгоор өгөх хэлбэр юм (Greenberg, L & Barling, J, 1996).\n\n	Өмч шамшигдуулах гэдэг нь АНУ –ын Холбооны мөрдөх товчооны томьёолсноор “хэн нэгэн эрх олгогдсон болон хуулийн дагуу итгэмжлэл буюу эрх мэдэл олгогдсон этгээд мөнгө болон эд хөрөнгийг буруугаар ашиглах” гэжээ. Өмч шамшигдуулах нь хэн нэгэн санхүүгийн эрх мэдэлтэй хүн эд хөрөнгийг буруугаар, хувийн зорилгоор ашигладаг гэдгээрээ бусад төрлийн хулгайгаасаа ялгаатай (Anonymous, 2005, P.41). \n\n	Байгууллагын хэмжээ хэдий чинээ том байна төдий чинээ хулгай хийх явдал их байдаг. Эсрэгээрээ холбоо харилцаа сайтай, жижиг компанид хулгай хийх явдал бага байна (Levitt & Dubner, S.J, 2005).',
        { align: 'justify' },
      )
      .moveDown(1);
    doc.lineWidth(1);

    footer(doc);
    doc.addPage();
    header(
      doc,
      firstname,
      lastname,
      'Ажлын байрны зохисгүй зан төлөвийн төрлүүд',
    );
    doc.rect(marginX, rectY, titleWidth, titleHeight).fill(colors.blockRed);

    doc
      .font('fontBlack')
      .fontSize(13)
      .fillColor('#ffffff')
      .text(
        'Хувь хүний зан төлөвтэй холбоотой зохисгүй зан төлөв',
        marginX,
        rectY + 6.5,
        {
          width: titleWidth,
          align: 'center',
        },
      );

    doc
      .moveTo(marginX, sectionY)
      .lineTo(doc.page.width - marginX, sectionY)
      .lineWidth(4)
      .strokeColor(colors.crimson)
      .stroke();

    const imgPath3 = assetPath('icons/inapp3');
    doc.image(imgPath3, marginX + 5, rectY + (titleHeight - imgHeight) / 2, {
      height: imgHeight,
    });

    doc.moveDown(1.25);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Хүчирхийлэл байдаггүй байгууллага, салбар, ажилтан гэж байдаггүй. Хувь хүний зэрлэг зан авир гэдэг нь бусад хүмүүстэй ширүүн, түрэмгий, дээрэлхсэн байдлаар харилцах харилцааг хэлдэг. Ажлын байран дахь бэлгийн дарамт, хүчин, хэл амаар доромжлох, бие махбодод халдах, хамтран ажиллагчийнхаа ажлыг санаатайгаар сүйтгэх, хамтран ажиллагчаасаа хулгай хийх, хамтран ажиллагчийнхаа эд хөрөнгийг эвдэж сүйтгэх, хамтран ажиллагчаа аюул оруулах зэрэг нь бүгд хувь хүнтэй холбоотой гарах зохисгүй зан төлөвүүд юм. (Robinson & Bennet, 1995) (Everton, W.J, Jolton, J.A & Mastrangelo, P.M, 2007). \n\nИйм төрлийн зохисгүй зан төлөвтэй ажилчид нь бие махбодын болоод сэтгэцийн эрүүл мэндийн ямар нэг асуудалтай байдаг бөгөөд ажилладаг байгууллагадаа хандах хандлага багатай хүмүүс байдаг. Эдгээр ажилтнууд бусад ажилтнуудыг бодвол ажлын ханамж багатай, сэтгэлээр унасан хүмүүс байна. Ийм төрлийн зан төлөвтэй хүмүүсийг дэмжиж ажиллах тохиолдолд тэд илүү хичээл зүтгэлтэй болж, ямар нэгэн дэмжлэг аваагүй нэгнээс илүү эсрэг бодолтой болдог (Everton, W.J, Jolton, J.A & Mastrangelo, P.M, 2007). Компани дээрх зохисгүй зан төлөвтэй ажилчдын үйлдлээс болж их хэмжээтэй зардал гаргах хэрэгтэй болно. Жишээлбэл, бүтээмж муутай хийгдсэн ажил, дэмий үрэгдсэн ажлын цаг, ажлын чанар, эрүүл мэндийн болон шүүх цагдаагийн зардлууд болон олон нийтийн дунд компанийн имижээ алдах зэрэгт зардал гаргах шаардлагатай болдог (Fleet & Griffen, 2006).\n\n	Эрэгтэй ажилчдыг бодвол эмэгтэй ажилчид илүү өртөмтгий байдаг. Ажлын байран дээрээ амиа алдсан ажилчдын 50% ийм төрлийн хүчирхийллийн золиос болсон гэсэн тоон мэдээлэл байна. 2005 оны Америкийн хөдөлмөрийн яамны мэдээлснээр 2004 оны байдлаар ажлын байран дахь золгүй явдлын 10% нь хүн амины хэрэг байсан бөгөөд АНУ –ийн хувьд ийм төрлийн гэмт хэрэг өсөх хандлагатай байна гэсэн байна (Fleet & Griffen, 2006). Хэл амаар доромжилж дайрах байдал нь ихэнхдээ ажлын байран дээр тохиолддог. Тиймээс хувь хүн, байгууллагын хувьд аюултай үзэгдэл юм.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Дээрх 4 хэмжүүрийг ашиглан ажлын байран дээрээ хэрэгжүүлэх боломжтой зүйлс:',
        { align: 'justify' },
      )
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .list(
        [
          'Байгууллагын эрсдэлийн үнэлгээ: Зохисгүй зан төлөвийн тархалтыг тооцох.',
          'Соёлын оношилгоо: Дотоод соёлд үл нийцэх зан төлөв ямар түвшинд, ямар хэлбэрээр илэрч байгааг илрүүлэх.',
          'Хүний нөөцийн бодлого боловсруулах: Сургалт, дүрэм журам, урамшууллын системийг сайжруулахад суурь мэдээлэл өгөх.',
          'Сургалтын хэрэгцээ тодорхойлох: Ёс зүй болон байгууллагын үнэт зүйлсийн сургалтын хэрэгцээг тодорхойлох.',
          'Хяналт, мониторинг: Хэсэг хугацааны дараа дахин үнэлгээ хийж, өөрчлөлтийг хэмжих.',
        ],
        doc.x,
        doc.y,
        {
          align: 'justify',
          bulletRadius: 1.5,
          columnGap: 8,
          // listType: 'numbered',
        },
      )
      .moveDown(1);
    doc.lineWidth(1);

    footer(doc);
  }
}
