import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity } from 'src/entities';
import {
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { SinglePdf } from '../single.pdf';
@Injectable()
export class MBTI {
  static pattern = {
    Шинжээч: ['ISTJ'],
    Хамгаалагч: ['ISFJ'],
    Зөвлөгч: ['INFJ'],
    Төлөвлөгч: ['INTJ'],
    Мэргэжилтэн: ['ISTP'],
    Аялагч: ['ISFP'],
    Эвлэрүүлэгч: ['INFP'],
    Судлаач: ['INTP'],
    Санаачлагч: ['ESTP'],
    Хөгжөөгч: ['ESFP'],
    Зохицуулагч: ['ENFP'],
    Мэтгэлцэгч: ['ENTP'],
    Удирдагч: ['ESTJ'],
    Туслагч: ['ESFJ'],
    Нөлөөлөгч: ['ENFJ'],
    Тушаагч: ['ENTJ'],
  };
  constructor(private single: SinglePdf) {}

  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    header(doc, firstname, lastname);
    title(doc, result.assessmentName);
    info(doc, exam.assessment.author, exam.assessment.description);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Та өмнө нь яагаад өөрийгөө олон хүнтэй үдэшлэгт очих дургүй атлаа гэртээ ганцаараа дуртай киногоо үзэхийг илүүд үздэг юм бол гэж бодож байсан уу? Яагаад зарим хүн лифтэнд хамт суусан танихгүй хүнтэй шууд, нээлттэй ярилцаж чаддаг байхад бусад нь тэгж чаддаггүй вэ? Яагаад зарим хүн чанга дуу чимээтэй, олон хүнтэй газраас эрч хүчээ авдаг байхад, харин энгийн жижиг чимээ ч хүртэл анхаарлыг чинь сарниулдаг юм бол?\n\nҮнэндээ таны өдөр тутамдаа хийдэг эдгээр үйлдлүүд нь огт санамсаргүй тохиолдлын чанартай биш, харин үүний цаана сайтар судлагдсан сэтгэл зүйн онол, загварууд, хувь хүний төрлүүд оршин байдаг.\n\nШинжлэх ухааны түүхэнд тод мөрөө үлдээсэн алдарт сэтгэл судлаач Карл Юнг одоогоос зуу гаруй жилийн өмнө сэтгэл судлал, зан төрхийн хувьд хүмүүс дотроо тодорхой төрөл, бүлгүүдэд хуваагддаг талаар өөрийн онолыг танилцуулж байжээ. Үүнээс хойш олон судлаачид энэхүү онол дээр суурилан, хүний хэв шинж, зан төрхийг илрүүлэх төрөл бүрийн тестүүдийг хөгжүүлж, гаргажээ. Энэ төрлийн тестүүдээс хамгийн ихээр олон хүнд хүрсэн, алдартай болсон, дэлхий даяар өргөнөөр ашиглагддаг тест бол хувь хүний 16 хэв шинжийг тодорхойлох тест юм.',
        { align: 'justify' },
      )
      .moveDown(1);

    doc
      .font(fontBold)
      .fontSize(13)
      .text('Тестийн тухай', marginX, doc.y)
      .moveDown(0.5);

    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Алдарт Швейцарын сэтгэл судлаач, философич Карл Юнг (1875-1961)-ын дэвшүүлсэн хувь хүний хэв шинжийн талаарх анхны онолыг Кэтрин Бриггс болон түүний охин Изабел Майерс нар цаашид тест болгон хөгжүүлж, өөрсдийн нэрээр Майерс-Бриггсийн зан төрхийн тест (MBTI) хэмээн нэрлэсэн нь дэлхий даяар олонд хүнд түгээж, маш их алдартай болжээ. Энэхүү тест нь хувь хүний зан төрхийн өвөрмөц онцлогийг үндсэн 4 хэмжээсээр үнэлж, хүмүүсийг 16 хэв шинжид хуваадаг. Монголчууд бидний олонх нь дөрвөн темперамент (холерик, сангвиник, флегматик, меланхолик)-ын онол загартай аль хэдийн танил болсон билээ. Тэгвэл дэлхий дахинд хувь хүний 16 хэв шинжийн онол нь энэхүү дөрвөн темпераментын онолтой адил маш их алдартай бөгөөд, сүүлийн үед хэрэглээ нь улам ихэссээр байна. ',
        { align: 'justify' },
      );
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Тестийн тухай');
    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(result.result + '+' + result.value, { align: 'justify' });
  }
}
