import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity } from 'src/entities';
import {
  assetPath,
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { SinglePdf } from '../single.pdf';
import { VisualizationService } from '../visualization.service';
@Injectable()
export class MBTI {
  static values = [
    {
      title: 'Энерги, анхаарлаа зарцуулах байдал:',
      color: colors.blockTeal,
      values: [
        {
          name: 'Экстроверт',
          name_full: 'Extraversion',
          key: 'E',
          color: colors.turquoise,
          description:
            'Экстроверт төрлийн хүмүүс бусадтай хамтарсан, багаар хийх үйл ажиллагаанд дуртай, илүү нийгмийн идэвхтэй. Хүмүүстэй уулзах, нийгмийн харилцаанд орсноор илүү эрч хүчтэй болдог. Интроверт хүмүүстэй харьцуулахад сэтгэл хөдлөл ихтэй, аливаа зүйлд амархан сэтгэл нь хөдөлдөг.',
        },
        {
          name: 'Интроверт',
          name_full: 'Introversion',
          key: 'I',
          color: colors.lightTeal,
          description:
            'Интроверт төрлийн хүмүүс ганцаараа бие даан хийж болох ажил, хөдөлмөрийг илүүд үздэг. Интровертуудын хувьд өөрсдийн дотоод ертөнц, төсөөлөлдөө илүү ач холбогдол өгч, анхаарлаа, энергиэ зарцуулдаг. Тэд дуу чимээ, хурц үнэр зэрэг гаднын нөлөөнд илүү эмзэг, мэдрэмтгий байдаг.',
        },
      ],
    },
    {
      title: 'Мэдээллийг хүлээж авах байдал:',
      color: colors.blockIndigo,
      values: [
        {
          name: 'Бодит байдал',
          name_full: 'Sensing',
          key: 'S',
          color: colors.softIndigo,
          description:
            'Бодит мэдээлэлд чиглэсэн буюу ажиглагч байдлын хүмүүс илүү практикт суурилсан, бодит байдалд тулгуурласан, ажиглалт, туршлага, хэмжилтэд суурилсан мэдээллийг чухалчилдаг.',
        },
        {
          name: 'Хийсвэр байдал',
          name_full: 'Intuition',
          key: 'N',
          color: colors.lavenderIndigo,
          description:
            'Хийсвэр мэдээлэлд чиглэсэн буюу төсөөлөмтгий хүмүүс нь илүү юмыг төсөөлөн бодох, хийсвэрлэх сэтгэлгээ сайтай, аливаа шинэ санаа санаачлагд нээлттэй ханддаг, сониуч байдаг. Энэ төрлийн хүмүүс хуучинсаг, тогтсон хэв загварт дургүй бөгөөд мэдээллийн цаад далд утга учир, ирээдүйн боломжит хувилбаруудыг анхаарч үздэг.',
        },
      ],
    },
    {
      title: 'Шийдвэр гаргах байдал:',
      color: colors.blockRed,
      values: [
        {
          name: 'Бодох',
          name_full: 'Thinking',
          key: 'T',
          color: colors.crimson,
          description:
            'Учир шалтгаан, логик сэтгэлгээ, объектив мэдээлэл, бодит үр дүнд үндэслэн шийдвэр гаргадаг хүмүүс. Энэ төрлийн хүмүүс шийдвэр гаргахдаа сэтгэл хөдлөлөө дарж, хүмүүстэй хамтрахаас илүү үр ашигтай ажиллах байдлыг илүү чухалчилж үздэг. ',
        },
        {
          name: 'Мэдрэх',
          name_full: 'Feeling',
          key: 'F',
          color: colors.rose,
          description:
            'Энэ төрлийн хүмүүс илүү мэдрэмтгий, сэтгэл хөдлөл ихтэй, бусад хүнийг ойлгох чадвар сайтай, урлагийн мэдрэмж өндөртэй, бусадтай нийтэч, нийцтэй байхыг эрхэмлэдэг.\nТэд субьектив мэдээлэл, өөрсдийн мэдрэмж, сэтгэл хөдлөл, үзэл дээр тулгуурласан шийдвэрийг илүүтэй гаргадаг.',
        },
      ],
    },
    {
      title: 'Гадаад орчин, хүмүүст хандах байдал:',
      color: colors.blockOrange,
      values: [
        {
          name: 'Зарчимч',
          name_full: 'Judging',
          key: 'J',
          color: colors.amberOrange,
          description:
            'Энэ төрлийн хүмүүс шийдэмгий, хариуцлагатай, хувийн эмх цэгц, зохион байгуулалтыг эрхэмлэдэг. Тэд аливаа зүйлс тодорхой, ойлгомжтой, төлөвлөгөөний дагуу явагдах нь зүйтэй гэж үздэг.',
        },
        {
          name: 'Зохицогч',
          name_full: 'Perceiving',
          key: 'P',
          color: colors.gold,
          description:
            'Энэ төрлийн хүмүүс аливаа зүйлд хандахдаа илүү уян хатан, нээлттэй ханддаг бөгөөд дасан зохицох, хөрвөх чадвар сайтай. Тэд боломжийг олж харах, бий болгохдоо сайн.',
        },
      ],
    },
  ];
  static pattern = {
    Шинжээч: ['ISTJ'],
    Хамгаалагч: ['ISFJ'],
    Зөвлөгч: ['INFJ'],
    Төлөвлөгч: ['INTJ'],
    Мэргэжилтэн: ['ISTP'],
    Аялагч: ['ISFP'],
    Эвлэрүүлэгч: ['INFP'],
    Судлаач: ['INTP'],
    Санаачлагч: ['ESTP'],
    Хөгжөөгч: ['ESFP'],
    Зохицуулагч: ['ENFP'],
    Мэтгэлцэгч: ['ENTP'],
    Удирдагч: ['ESTJ'],
    Туслагч: ['ESFJ'],
    Нөлөөлөгч: ['ENFJ'],
    Тушаагч: ['ENTJ'],
  };

  static names = {
    E: 'Экстроверт',
    I: 'Интроверт',
    S: 'Бодит байдал',
    N: 'Хийсвэр байдал',
    T: 'Бодох',
    F: 'Мэдрэх',
    J: 'Зарчимч',
    P: 'Зохицогч',
  };

  static desc = [
    {
      name: 'Шинжээч',
      code: 'ISTJ',
      desc: 'ISTJ буюу шинжээч хэв шинжийн хүмүүс үг дуу цөөтэй, практик, бодит, баримт нотолгоонд илүү суурилдаг, үнэнч, хариуцлагатай, хөдөлмөрч, хичээл зүтгэлтэй, хэлсэн үгэндээ хүрч, амлалтаа биелүүлэх гэж хичээдэг, эхэлсэн ажлаа заавал дуустал нь хийж, зорилгодоо хүрч байж санаа нь амардаг. ISTJ хүмүүс хувийн амьдралдаа өндөр зохион байгуулалттай. Аливаа зүйлсийг урьдаас сайтар төлөвлөдөг, эсрэгээрээ ойлгомжгүй, тааварлашгүй гэнэтийн нөхцөл байдалд дургүй. Тэдний хувьд үүрэг хариуцлагыг маш их чухалчилж үзэх бөгөөд өөрсдөө ч мөн адил хариуцлагатай байж, хэлсэн үгэндээ хүрэх гэж ихэд хичээдэг зантай. Тиймээс юмсыг системтэй харсан, нарийн анхаарал шаардсан ажлыг тэд маш сайн хийж чадна. ISTJ төрлийн хүмүүс гэр бүл, хамт олон, байгууллагууддаа үнэнч, шударга хандахыг чухалчилдаг. Тэдний энэхүү өндөр хариуцлагатай, үнэнч зан чанар нь магадгүй тогтвортой, уламжлалт үзэл, ёс заншлыг дэмждэг байдалтай нь холбоотой байж болох юм. Хэдийгээр ISTJ төрлийн хүмүүс олны өмнө гарах, бусдын анхаарлыг татах дургүй ч гэсэн хэрвээ тогтвортой, бат бэх байдлыг хангахад шаардлагатай юу ч байсан хийж магадгүй.\n\nШинжээч хэв шинжийн хүмүүс тогтсон, тодорхой бүтэцтэй ажиллах, сурах орчныг илүүд үздэг, илүү амжилттай ажилладаг. Бие даан ажиллах чадвар, байгууллагын соёл, дүрмийг дагаж мөрдөх, эрхэмлэх чанар нь удирдлага, менежмент, хууль сахиулах, санхүү, нягтлан бодох бүртгэл зэрэг салбарт ажиллахад тохиромжтой. Тогтвортой, үнэнч шударга байдлыг эрхэмлэдэг чанар нь тэднийг байгууллагын амин сүнс, тулгуур багана болгодог. ISTJ төрлийн хүмүүс эсрэгээрээ олон хүнтэй харилцах, сэтгэл хөдлөл шаардсан эсвэл хийсвэрлэл, төсөөлөн бодох сэтгэлгээ шаардсан ажилд дур сонирхолгүй. \n\nХарилцааны хувьд ISTJ хүмүүс нь илүү нууцлагдмал, олон хүнтэй харилцахаас илүүтэй цөөн тооны, ойр дотнын найз нөхдийн хүрээллийг илүүд үздэг. Тэд багаасаа л бусдад сэтгэл хөдлөлөө илэрхийлэх, бусдын сэтгэл хөдлөлийг ойлгохдоо тааруу байдаг. Гэхдээ нэгэнт тогтсон нөхөрлөлдөө үнэнч, хариуцлагатай ханддаг. Үгээр бус үйлдлээрээ хайр халамжаа харуулдаг бөгөөд хайртай хүмүүстээ өгсөн амлалтаа биелүүлэхийн тулд асар их хүчин чармайлт гаргадаг.',
      image: 'istj',
    },
    {
      name: 'Хамгаалагч',
      code: 'ISFJ',
      desc: 'ISFJ буюу хамгаалагч хэв шинжийн хүмүүс үг дуу цөөтэй, үүрэг хариуцлагаа маш сайн ухамсарладаг, үнэнч шударга зантай, итгэл даадаг, хэлсэн, зорьсондоо хүрэхийн тулд ихээхэн хичээл зүтгэл гаргадаг, шаргуу хичээнгүй, ажигч гярхай, аливаад сэтгэлээсээ ханддаг. Тэд нөхөрсөг, тусч, бусдын төлөө гэсэн сэтгэлтэй, ихэвчлэн альтуризмын үзэл баримтлалтай байдаг. Тэд уламжлал, ёс заншил, тогтвортой байдлыг эрхэмлэдэг, тогтсон зохион байгуулалт, дэг журам, бүтцийг дэмжиж, ажилдаг. Тиймээс өгсөн үүрэг даалгаврыг биелүүлэх, зохион байгуулах, нарийн анхаарал шаардсан ажлыг тэд маш сайн хийж чадна. Энэ хэв шинжийн хүмүүс өөрсдийн үзэл бодолдоо үнэнч, түүнээсээ урам зориг авдаг, хурцлагддаг. Тэд тайзны ард, бусдын анхаарлаас хол ажиллахыг илүүд үздэг, чимээгүй, нам гүм, тайван байдлыг чухалчилдаг. Тэд байгалиас заяасан бусдыг ойлгох, сэтгэл хөдлөлийг мэдрэх, бусдын оронд өөрийгөө тавьж үзэх, бусдын зовлонг ойлгох чадвартай. Энэ чадвар нь тэднийг сайн сонсогч, зөвлөгч болгодог.\n\nГэхдээ нөгөө талаар, хамгаалагч хэв шинжийн хүмүүс ихэвчлэн бусдын хэрэгцээ, шаардлагыг өөрийнхөөсөө дээгүүр тавьдаг, өөрийгөө золиослох хандлагатай бөгөөд заримдаа болгоомжтой хандахгүй бол сэтгэл санааны хувьд сөрөг үр дагаварт хүргэх эрсдэлтэй.\n\nХарилцааны хувьд ISFJ төрлийн хүмүүс үнэнч, тусч, анхаарал халамжтай, урт хугацааны тогтвортой харилцааг чухалчилдаг. Хайртай хүмүүсийнхээ төлөө үргэлж нэг алхам илүү алхахад бэлэн байдаг. Тэд эв найрамдлыг эрхэмлэдэг, ямар нэгэн маргаан, зөрчилдөөнөөс зайлсхийдэг. Зарим тохиолдолд үл ойлголцол, маргаан дэгдээхээс сэргийлэхийн тулд өөрийн сэтгэл хөдлөл, үзэл бодлоо нуух, дарах, шийдвэрлэх ёстой асуудлаас бултахад хүртэл хүргэж магадгүй.\n\nТэд ажил дээр болон гэртээ эмх цэгцтэй, халуун дулаан уур амьсгал бүрдүүлэхийн тулд цаг ямагт хичээж байдаг.',
      image: 'isfj',
    },
    {
      name: 'Зөвлөгч',
      code: 'INFJ',
      desc: 'INFJ буюу зөвлөгч хэв шинжийн хүмүүс мөрөөдөмтгий, амбиц ихтэй байдал ба бусдад туслах, энэрэх гүнзгий сэтгэл хосолсон өвөрмөц зан төлөвтэй. Тэд үг дуу цөөтэй, зарчимч, өндөр зөн совин, мэдрэмжтэй, шинэчлэл өөрчлөлтийг дэмждэг, өөрийн үзэл бодолдоо үнэнч, тэвчээр хатуужилтай. Тэд амжилтыг мөнгө, эрх мэдэл бус харин зорилгодоо хүрэх, бусдад туслах, нийгэмд нөлөөлөх байдлаар хэмждэг. Тэд дэлхий ертөнцийг илүү сайн сайхан  болгох, өөрчлөхийн төлөө ажиллах нь амьдралын гол утга учир, зорилго гэж үздэг. Том зорилго, амбицтай ч INFJ хүмүүсийг хоосон мөрөөдөгчид гэж андуурч болохгүй. Энэ хэв шинжийн хүмүүс голдуу өөрсдийн бодол, зөв совиндоо үнэнч, бусдын нөлөөнд бага ордог, өөртөө чухал гэж үзсэн зорилгодоо хүрэх хүртлээ тууштай явдаг. \n\nINFJ хэв шинжтэй хүмүүсийн бусдаас ялгарах нэг онцлог шинж чанар нь тэд бусдын сэтгэл хөдлөл, зовлонг мэдрэх, бусдын оронд өөрийгөө тавьж ойлгохдоо онцгой сайн. Тэд хүмүүсийг, орчин тойрноо маш сайн, хурдан мэдэрч, ойлгодог. Энэхүү эмпати өндөртэй чадвар нь тэднийг сайн сонсогч, зөвлөгөө өгөгч, итгэлтэй найз нөхөд, хамтрагч болоход тусалдаг. Зөвлөгч хэв шинжийн зан төлөв нь тэднийг тушаал өгдөг дарга, удирдагчдаас өөр ялгаатай, чимээгүй, харизма өндөртэй манлайлагч, нөлөөлөөгчид байхад илүү тохирдог. \n\nINFJ хүмүүсийн дотоод ертөнц нь ойлгоход төвөгтэй, зөрчилдөөнөөр дүүрэн. Тэд дотогшоо чиглэсэн, интроверт хүмүүс хэдий ч бусдын сайн сайхны төлөө зовдог. Хэдийгээр идеалист, мөрөөдөмтгий боловч шаардлагатай үед реалистик, бодит байдалд тулгуурлаж чаддаг. Эелдэг зөөлөн, бусдыг өрөвдөх, энэрэнгүй сэтгэлтэй боловч итгэл үнэмшлийнхээ төлөө тэмцэхдээ эрс шийдэмгий. Энэхүү нарийн төвөгтэй, ээдрээтэй байдал нь ихэвчлэн INFJ-г илүү нууцлагдмал, сонирхолтой хүмүүс болгодог.',
      image: 'infj',
    },
    {
      name: 'Төлөвлөгч',
      code: 'INTJ',
      desc: 'INTJ буюу төлөвлөгч  хэв шинжийн хүмүүс сониуч, мэдлэгт дурласан, нарийн төвөгтэй асуудал бэрхшээлийг судлах, таавар таах дуртай. Энэ төрлийн хүмүүс өөртөө маш итгэлтэй, логик, аналитик, нухацтай сэтгэлгээний чадвар маш сайтай, төлөвлөгөө зохиохдоо гаргууд, үг дүү цөөтэй, бие даах чадвар маш сайн, бүтээлч, үнэнч шударга, тавьсан зорилго, төлөвлөгөөндөө хүрэхийн тулд тууштай зүтгэдэг. Нийгмийн тогтсон хэм хэмжээ, бусдын зааврыг дагахаас илүүтэй өөрсдийн оюун ухаан, сэтгэн бодох ур чадварт илүү найддаг. INTJ хүмүүсийн тархи нь зогсолтгүйгээр шинэ санаа, санаачилга гаргахад ажиллаж байдаг.\n\nТэд алдаа дутагдал, үр ашиггүй байдлыг илрүүлэх, асуудлын шийдвэрийг хайж олохдоо гойд сайн. Эдгээр чадваруудыг авч үзвэл төлөвлөгч хэв шинжийн хүмүүс нь төлөвлөгөө зохиох, дүн шинжилгээ гаргах төрлийн ажилд илүү тохирно. Дотогшоо чиглэсэн, интровертед зан төлөвөөс үл хамааран, зөн совин, мэдлэгтээ тулгуурлан, маш сайн бие дааж шийдвэр гаргаж ажиллаж чадах авьяастай. Энэ төрөлд багтах хүн өөртөө болон бусдад маш өндөр шаардлага тавьдаг, өндөр чанартай гүйцэтгэлийг бусдаас шаарддаг.\n\nНийгмийн харилцааны хувьд төлөвлөгч төрлийн хүмүүсийг ойлгож, танихад харьцангуй төвөгтэй. Тэд олон хүн цугласан уулзалт, цугларалтад оролцох дургүй, ганцаараа эсвэл цөөн дотнын найз нөхөдтэй хамт байхыг илүүд үздэг. INTJ хүмүүс гүн гүнзгий, оюунлаг яриа хөөрөөнд дуртай, харин энгийн өдөр тутмын яриаг үзэн яддаг, сэтгэл хөдлөл, хувийн сонирхолд автдаггүй. Энэхүү шинж чанар нь тэднийг заримдаа бусдаас сондгой, этгээд мэт харагдуулдаг болов ч, тэд дотнын найз нөхөд, хайртай хүндээ туйлын үнэнч, тэдэнд туслахын тулд маш их хичээдэг.',
      image: 'intj',
    },
    {
      name: 'Мэргэжилтэн',
      code: 'ISTP',
      desc: 'ISTP буюу мэргэжилтэн хэв шинжийн хүмүүс практик, бодит байдалд суурилсан, бие даасан бөгөөд аливаа асуудлыг бүтээлч, уран аргаар шийдвэрлэх онцгой ур чадвартай. Мэргэжилтэн төрлийн хүмүүс үг дүү цөөтэй, дотогшоо чиглэсэн, аливаа зүйлд ул суурьтай ханддаг, орчин тойрноо гярхай ажиглаж, өөрийн биеэр мэдэрч, гараар хүрч үзэх, судалж шинжлэх дуртай, сониуч зантай. ISTP төрлийн хүмүүс бол байгалиасаа юмыг зохион бүтээхээр төрсөн хүмүүс бөгөөд нэг ажлаас нөгөө ажилд шилжихдээ шинэ орчноосоо үргэлж суралцаж байдаг. Тэдний хувьд бол гар хуруугаа хөдөлгөж, эд зүйлсийг салгаж, буцааж угсарч, засаж сайжруулахаас илүү баяр хөөртэй зүйл үгүй. Энэ төрлийн хүмүүсийн хувьд ихэвчлэн өөрийн биеэр гардан хийх боломжтой ажил төрөлд сонирхолтой бөгөөд сайн уран бүтээлч, инженерүүд ийм зан төлөвтэй байх нь элбэг. \n\nISTP-г тодорхойлогч онцлог чанаруудын нэг нь тэдний адал явдал, эрсдэлд дурладаг зан. Тэд үргэлж шинэ зүйл туршиж үзэх, сэтгэл хөдөлгөсөн зүйл хийхийг оролддог. Энэ зан төлөв нь тэднийг нөхцөл байдлыг өөрчлөгдөхөд хурдан дасан зохицож, уян хатан байхад тусалдаг. \n\nӨөр бас нэгэн онцлог шинж чанар ISTP хүмүүсийн бусад хүмүүстэй харилцахдаа шууд асуудал руу ордог, нялуун бус шулуун, шударга байх зан. Энэхүү зан нь асуудлыг хурдан, шуурхай шийдвэрлэхэд тусалдаг бөгөөд бусад хүмүүс энэ чадварыг нь үнэлдэг. \n\nХарилцааны хувьд ISTP-ууд ихээхэн бие даасан байдалтай бөгөөд өөрсдийнх нь орон зай, эрх чөлөөг хүндэтгэдэг найз, хосыг хайдаг. Тэд сэтгэл хөдлөлөө удирдах тал дээр төдийлөн сайн биш. Сэтгэл хөдлөлөө бусдад илэрхийлэх болон бусдын сэтгэл хөдлөлийг ойлгохдоо бэрхшээлтэй тулгардаг байх магадлалтай. Гэхдээ тэд дотно, хайртай хүндээ үнэнч, бүх зүйлээ хуваалцдаг, халамж сайтай эхнэр/нөхөр байж чаддаг.',
      image: 'istp',
    },
    {
      name: 'Аялагч',
      code: 'ISFP',
      desc: 'ISFP буюу аялагч хэв шинжийн хүмүүс нь үг дуу цөөтэй, мэдрэмтгий, уян хатан ханддаг, бүтээлч, маш их авьяаслаг, гоо зүйн мэдрэмж өндөртэй хүмүүс байдаг. Энэ төрлийн хүмүүс ихэвчлэн өөрсдийн мэдрэмж, сэтгэл хөдлөлдөө тулгуурлан сонголт, шийдвэр гаргадаг. Тэд бусад хүмүүсийн олж харж чадаагүй амьдралын гоо сайхан байдлыг олж харж, ажиглахдаа онцгой. Тэд бол төрөлхийн уран бүтээлчид бөгөөд амьдрал өөрөө тэдний хувьд ураан бүтээлээ туурвих талбар нь юм. Аялагч төрлийн хүмүүс өмссөн хувцас, хийж буй үйлдлээрээ өөрийн өвөрмөц зан төрхөө илэрхийлдэг. Өөрийн гэсэн хувийн орон зай, цаг хугацааг бий болгож, эрхэмлэдэг. \n\nТэд ирээдүйг төлөвлөх эсвэл, өнгөрсөн дурсамжууддаа автахаас илүүтэй яг одоо болж буй зүйлд анхаарлаа төвлөрүүлж, одоо цагт амьдардаг. Энэ шинж чанарынхаа ачаар ямар ч нөхцөлд хурдан дасан зохицож, амьдралын тааварлашгүй байдлаас аз жаргалыг олж авч чаддаг. ISFP-уудад бүтээлч сэтгэлгээ, үзэл бодлоо чөлөөтэй илэрхийлэх боломжтой, урлагийн салбарт илүүтэй амжилт гаргах магадлалтай.\n\nДутагдалтай тал гэвэл тэд зөвхөн урдах ажилдаа төвлөрдөг, өөрсдийгөө дутуу үнэлдэг, хэт их даруу төлөв зан нь юм. ',
      image: 'isfp',
    },

    {
      name: 'Эвлэрүүлэгч',
      code: 'INFP',
      desc: 'INFP буюу эвлэрүүлэгч хэв шинжийн хүмүүсийн онцлог шинж нь үнэнч шударга, гүнзгий төсөөлөх, хийсвэр бодох чадвар юм. Энэ төрлийн хүмүүс их сониуч, бүтээлч, аливаа зүйлд нээлттэй ханддаг зан төрхтэй, хүрээлэн буй дэлхийн ертөнцийг гүн гүнзгий ойлгож мэдрэх, аливаа зүйлсийн цаад утга учрыг олохыг эрмэлздэг. Хэдийгээр гадна талаас нь өнгөц харахад дотогшоо чиглэсэн, үг дуу цөөтэй хүмүүс мэт харагдах хэдий ч дотроо өөрсдийн маш их баялаг ертөнцтэй, олон төрлийн санаа бодол, төсөөллөөр дүүрэн байдаг хүмүүс юм. Чимээгүйхнээр дотроо олон зүйлийг мөрөөдөн, өөрөө өөртөөгөө ярилцаж, янз бүрийн түүх зохиож, түүндээ уусаж чаддаг хүмүүс юм.\n\nЗаримдаа хэт их өнгөрснөө санан дурсдаг мэт санагдавч энэ нь тэднийг аз жаргалтай болгодог зүйлсийн нэг бөгөөд өөрт нь тохиолдсон онцгой дурсгалт зүйлс, явдлыг тод санаж, дотроо нандигнаж явдаг. Тэд нарийн ширийн, жижиг зүйлээс илүү том дүр зураг дээр илүү анхаарч, өөрийгөө нээж, илрүүлэх, өсөж хөгжихийг хичээдэг. Мөн түүнчлэн эвлэрүүлэгч төрлийн хүмүүс өөрсдийн үзэл баримтлал дээрээ бат зогсдог, тууштай бөгөөд бусад туслах, нийгэмд өөрийн хувь нэмрээ оруулах хүсэлтэй байдаг.\n\nНийгмийн харилцааны хувьд, INFP хүмүүс олон хүн цугларсан эвент, үйл ажиллагаанд оролцохоос илүү ойр дотын цөөн найз нөхөхтэйгөө цагийг зугаатай өнгөрөөхийг илүүд үздэг. Эвлэрүүлэгч төрлийн хүмүүс бусдыг ойлгох, эмпати чадвар өндөртэй, үргэлж бусдад туслахыг хичээж байдаг. Тэд бол маш сайн сонсогч, найдвартай итгэл даагч нар юм. Өөрийн үзэл бодол болон өөрт нь чухал, хайртай хүмүүстэй үнэнч. \n\nТэдний дутагдалтай тал нь заримдаа хэт их хүлээлттэй байдгаас урам хугарахдаа амархан, шүүмжлэлд эмзгээр ханддаг, өөрийгөө хэт их шүүмжлэх, буруутгах хандлагатай, шийдвэр гаргахдаа удаан зэрэг зан чанарууд нь болно. ',
      image: 'infp',
    },
    {
      name: 'Судлаач',
      code: 'INTP',
      desc: 'INTP буюу судлаач хэвж шинжийн хүмүүс нь аливаа зүйлийг хийсвэрлэн төсөөлөх, сэтгэн бодохдоо сайн, логик, аналитик болон шүүмжлэлт сэтгэлгээний чадвар өндөртэй, өвөрмөц үзэл бодолтой. Орчиндоо дасан зохицох, асуудалд уян хатан хандах чадвар сайн, дотогшоо чиглэсэн, үг дуу цөөтэй, нягт нямбай, нухацтай, шүүмжлэгч зан төлөвтэй. Судлаач хэв шинжийн хүмүүс аливаа зүйлс ягаад оршин байдаг, хэрхэн яаж ажилладгийг мэдэж, цаад учир шалтгааныг нээн илрүүлэхийг хүсдэг. Энэ хэв шинжийн хүмүүс гаднаас мэдээллийг шууд бус аргаар, хийсвэр онол загвар, схем дээр тулгуурлан хүлээн авч, ангилж, боловсруулдаг. Цаашид энэхүү загвар, ойлголтоо ашиглан ээдрээтэй, төвөгтэй санааг ч энгийн байдлаар хүнд тайлбарлаж, ойлгомжтой хүргэж чаддаг. Тэдний хувьд ертөнцийн нууцуудыг тайлж ойлгохын тулд тархи нь үргэлж ажиллаж байдаг. Тиймээс хүн төрөлхтний түүхэн дэх хамгийн алдартай философич, эрдэмтэн судлаач нарын олонх нь INTP хэв шинжтэй байсанд гайхах зүйлгүй юм. Тиймээс энэ төрлийн хүмүүс ихэвчлэн шинжлэх ухаан, философи, хууль, архитектур зэрэг салбарт ажилладаг байна.\n\nТэд бусад хүмүүстэй ажиллахаас илүүтэй, удаан хугацаагаар анхаарлаа төвлөрүүлэн, бие даан ажиллах, асуудлыг гүн гүнзгий судалж, шийдвэрлэхийг илүүд үздэг. Мөн судлаач нар туйлын бүтээлч, шинийг санаачлагч хүмүүс байдаг бөгөөд өөрсдийн үзэл бодол, санаагаа бусдын өмнө илэрхийлэхээс огтхон ч айдаггүй. INTP төрлийн хүмүүс хэдийгээр сэтгэл хөдлөл, дотоод мэдрэмж нь чухал гэдгийг ойлгож, заримдаа бусад хүмүүст сэтгэлээ уудалдаг болов ч, хэзээ ч өөрт нь ашиггүй үед сэтгэл хөдлөлөө илэрхийлдэггүй, шийдвэр гаргахдаа сэтгэл хөдлөлөөс ангид байх ёстой гэж үздэг. ',
      image: 'intp',
    },
    {
      name: 'Санаачлагч',
      code: 'ESTP',
      desc: 'ESTP буюу санаачлагч хэв шинжийн хүмүүс маш их эрч хүчтэй, гадагшаа чиглэсэн, нөхөрсөг, нийтэч, практик бодит байдалд тулгуурласан, асуудлыг хурдан шуурхай шийдвэрлэхийг хичээдэг. ESTP төрлийн хүмүүс өнгөрсөн, ирээдүйн явдлаас илүү одоо цаг мөчид анхаарлаа төвлөрүүлж, адал явдалд дуртай, амьдралаас аз жаргалыг олж авдаг хүмүүс байдаг. Тэд яриа хөөрөө сайтай, бусдыг хөгжөөж чаддаг. ESTP төрлийн хүмүүс онол, дүрэм журамд баригдахаас илүү аливаа зүйлийг шууд өөрийн биеэр хийж үзэх явцдаа давхар суралцаж, алдаагаа засах нь дээр нь гэж үздэг. Энэ төрлийн хүмүүсийн хувьд хийсвэр мэдээлэл, төсөөлөл багатай, харин өөрсдийн практик ур чадвараа ашиглах болохуй, илүү тодорхой зорилготой, үр дүнг нь хурдан хугацаанд харж, хэмжиж болохуйц ажил мэргэжил хийх дуртай. Тэдний хувьд өрсөлдөх дуртай, өрсөлдөөн бол амжилтад хүрэхэд чухал томьёонуудын нэг гэж үздэг.',
      image: 'estp',
    },
    {
      name: 'Хөгжөөгч',
      code: 'ESFP',
      desc: 'ESFP буюу хөгжөөгч хэв шинжийн хүмүүс нь нөхөрсөг, нийтэч, нийгмийн өндөр идэвхтэй, олны анхаарлын төвд байх, олон хүн цугласан үдэшлэг, арга хэмжээнд оролцох дуртай, хүмүүсийг хөгжөөх, эерэг уур амьсгал бүрдүүлэхдээ авьяастай, тоглоом наадамд дуртай. Хэрэв дуулах бүжиглэх бол тэд хамгийн түрүүнд явдаг. Энэ төрлийн хүмүүс маш сайн ажигч, гярхай бөгөөд ялангуяа бусад хүмүүст юу хүсэж буйг сайн мэдэрч, хүмүүст анхаарлаа хандуулж чаддаг. Тэд амьдралын хором мөч бүрийг аз жаргалтай, хөөрөн баясалтай өнгөрүүлэхийг хүсдэг бөгөөд бусад хүмүүсийг ч гэсэн өөртэй нь адилхан мэдрэмж аваасай гэж хүсдэг. Хөгжөөгч төрлийн хүмүүс шиг үргэлж бусдад туслах, цаг зав, эрч хүчээ харамгүй бусдад зориулдаг хэв шинж гэж байхгүй.\n\nХүмүүс хоорондын харилцааны хувьд ESFP нь нөхөрсөг, дотно, бусдыг ойлгох, энэрэх сэтгэлтэй. Тэд бусадтай хамтарч ажиллах дуртай. Бусдын сайн сайхны төлөө чин сэтгэлээсээ санаа тавьж, альл болох тав тухтай байлгахыг хичээдэг. Тийсээс энэ төрлийн хүмүүс сайн найз нөхөд, хамтрагч байж, хэзээ ч хамаагүй тусламжийн гараа сунгахад бэлэн байдаг. Тэд ихэвчлэн өргөн цар хүрээ бүхий найзын хүрээлэлтэй, хүмүүстэй найзалж нөхөрлөхдөө амархан. \n\nESFP хүмүүсийн анхаарах ёстой зүйл бол тэдний хэт их эрч хүчтэй, нийтэч байдал заримдаа төлөвлөгөөний дагуу ажиллах дуртай эсвэл дотогшоо чиглэсэн, интроверт хүмүүсийг тав тухгүй болгож, таагүй мэдрэмж төрүүлэх магадлалтай.',
      image: 'esfp',
    },
    {
      name: 'Зохицуулагч',
      code: 'ENFP',
      desc: 'ENFP буюу зохицуулагч хэв шинжийн хүмүүс нь эрч хүчтэй, нээлттэй, үнэнч, өөдрөг, амьдралыг боломжоор дүүрэн гэж хардаг, гадагшаа чиглэсэн, сониуч, төсөөлөн бодох хийсвэр сэтгэлгээ сайтай. Энэ төрлийн хүмүүс маш бүтээлч сэтгэлгээтэй, тогтсон дэг журмаас гадуур сэтгэж, шинэ санаа, шинэ боломжийг нээж илрүүлэхдээ гаргууд сайн. Эрч хүчтэй, өөдрөг байдал нь бусад хүмүүст баяр хөөр, эерэг уур амьсгал бэлэглэдэг. \n\nENFP төрлийн хүмүүс бусдын сэтгэл хөдлөлийг сайн мэдэрч, ойлгодог, эмпати өндөртэй, мэдрэмжтэй бөгөөд бусад хүмүүст урам зориг өгч, идэвхжүүлэхдээ авьяастай. Тэд хэдийгээр гадагшаа чиглэсэн, бусад хүмүүстэй харилцаа тогтоохдоо сайн ч гэсэн гүнзгий, дотно, утга учиртай холбоо тогтоохыг илүү чухалчилдаг. \n\nТэд нэг тогтсон хэм хэмжээ, дэг журамд, хатуу хуваарьд дургүй. Эсрэгээрээ хувийн эрх чөлөөг эрхэмлэдэг, хувийн зүгээс өсөх дэвших боломжийг илүү чухалчилж үздэг.',
      image: 'enfp',
    },
    {
      name: 'Мэтгэлцэгч',
      code: 'ENTP',
      desc: 'ENTP буюу мэтгэлцэгч хэв шинжийн хүмүүс нь ярих, илтгэхдээ сайн, хурдан шаламгай, эрч хүчтэй. Мэтгэлцэгч төрлийн хүмүүс бусадтай санал уралдуулах, мэтгэлцэх, тогтсон дэг журам, дүрмийг сөрж зогсох, эсэргүүцэхээс айж эмээдэггүй. Энэ зангаас нь болоод бусад хүмүүс тэднийг хэрүүлч, өөнтөгч гэж харж магадгүй. Яг үнэндээ тэдний хувьд маргаанд ялахаас илүү өөрийн үзэл санаагаа илэрхийлэх нь цаад жинхэнэ сэдэл нь байдаг. Тэд шинэ санаа, санааачлагууд дэвшүүлэх дуртай, хошин мэдрэмж сайтай. Хүмүүстэй харилцахдаа үнэнч, шударга зантай, хэзээ ч өөрсдийн бодлоо бусдын өмнө илэрхийлэхээс цааргалахгүй. Мэтгэлцэгч хэв шинжийн хүмүүс олон талын авьяас авхаалж самбаатай, шинэ орчин дасан зохицох чадвартай. Аливаа маргаан, сэдвийг олон талаас нь харж, шинжих чадвартай, сониуч, асуудлыг шийдвэрлэхдээ сайн.\n\nНийгмийн харилцааны хувьд, ENTP хүмүүс гадагшаа чиглэсэн, нийтэч, олон танилын хүрээтэй. Хэдийгээр хүмүүстэй их харилцдаг ч гэсэн мэтгэлцэгч нарын гаргадаг алдаа нь ярьж буй сэдэв, үзэл санаандаа хэт автаад бусад хүмүүсийн мэдрэмжийг үл тоомсорлох хандлагатай байдаг. Энэ төрлийн хүмүүс дүрэм журмыг дагаж мөрдөхдөө тааруухан, олон төрлийн сэдвүүдийг барьж сонирхон судалдаг болов ч нэг зүйл дээр удаан хугацаагаар төвлөрч суухад төвөгтэй, гүйцэтгэл муутай байх хандлагатай, аливаа зүйлээс амархан уйддаг. ',
      image: 'entp',
    },
    {
      name: 'Удирдагч',
      code: 'ESTJ',
      desc: 'ESTJ буюу удирдагч хэв шинжийн хүмүүс нь хариуцлагыг маш ихээр чухалчилж үздэг, найдвартай, итгэл даадаг, дэг журам, төлөвлөгөө, зохион байгуулалтай байдлыг эрхэмлэдэг. Аливаа зүйлст хандах, шийдвэр гаргахдаа шийдэмгий, практик, бодит байдал, системтэй төлөвлөгөө, логик сэтгэлгээнд дээр үндэслэдэг. Уламжлалт хандлага, ёс жаяг, тогтсон дэг журам, үнэнч шударга байдал, нэр төрийг хүндэтгэн үздэг, сайтар дагаж мөрддөг. Эдгээр зан чанар нь ESTJ хэв шинжийн хүмүүсийг баг,  төслийг удирдан, төлөвлөгөөний дагуу үр ашигтай ажиллуулах, зааж, чиглүүлэх зэрэг удирдлагын түвшний ажил хийхэд таарч тохирдог. Удирдагч хэв шинжийн хүмүүс хариуцлагыг өндөр мэдрэмжтэй бөгөөд найдвартай, хариуцлагатай зан чанар нь баг дотор бусад хүмүүст хүндлэгдэх, хүлээн зөвшөөрөгдөхөд нь тусалдаг.  \n\nESTJ хүмүүс харилцааны хувьд тойруу бус, ойлгомжтой, шулуун байхыг илүүд үздэг бөгөөд үзэл санаагаа чөлөөтэй илэрхийлдэг. Тэдний хувьд энэхүү  шулуун харилцаа нь  цаг хөнгөвчилж, байгууллагын үр бүтээмжийг нэмэгдүүлэхэд чухал нөлөөтэй хэдий ч зарим хүмүүст энэ үйлдэл нь бүдүүлэг эсвэл мэдрэмжгүй мэт сэтгэгдэл төрүүлж магадгүй.',
      image: 'estj',
    },
    {
      name: 'Туслагч',
      code: 'ESFJ',
      desc: 'ESFJ буюу туслагч хэв шинжийн хүмүүс нь гадагшаа чиглэсэн, хувийн зохион байгуулалт сайтай, туйлын нөхөрсөг, нийтэч зантай. Энэ төрлийн хүмүүс бусад хүмүүсийн сэтгэл хөдлөл, мэдрэмжийг ойлгохдоо гаргууд, энэрэх, бусдад туслах гүнзгий хүсэл эрмэлзэлтэй. Туслагч төрлийн хүмүүс үл ойлголцол, маргаан үүсгэхээс аль болох үүсгэхээс зайлсхийдэг, эв эеийг эрхэмлэдэг, аливаа маргаан, зөрчилдөөнийг намдааж, талуудын хооронд зуучлагч хийж, бүх талуудын дуу хоолойг сонсож чаддаг. ESTJ хүмүүсийн тууштай, итгэл даадаг, үүрэг, даалгаврыг цагт нь, бүрэн гүйцэт биелүүлдэг. Энэ зан чанарыг нь авч үзвэл тэд сайн багын гишүүн, удирдагч, манлайлагч байж чаддаг. Тэдний хувьд бусдад туслах, үйлчлэх төрлийн ажил мэргэжил илүүтэй тохирно. Нийгмийн харилцааны хувьд идэвхтэй, эрч хүчтэй,  хүмүүсийн анхаарлын төвд байх дуртай. ESFJ нь хүмүүсийн нэр ус болон бусад нарийн ширийн мэдээллийг санахдаа сайн, бусад хүмүүст өөрсдийг нь үнэ цэнтэй гэдгийг нь мэдрүүлж чадах өвөрмөц авьяастай.\n\nESFJ-ын сул тал нь тэд юмс таамаглашгүй, тодорхойгүй байхад дургүй, ийм нөхцөл тэднийг тав тухгүй болгодог.',
      image: 'esfj',
    },
    {
      name: 'Нөлөөлөгч',
      code: 'ENFJ',
      desc: 'ENFJ буюу нөлөөлөгч хэв шинжийн хүмүүс нь бусдыг ойлгох, сэтгэл хөдлөлийг нь мэдрэхдээ сайн, эмпати өндөртэй, гэр бүл, найз нөхдийнхөө хэрэгцээ шаардлагаа өөрөөсөө түрүүнд тавьдаг. Тэд бол байгалиас өгөгдсөн өөртөө итгэх итгэл, харизматай, бусад нөлөөлөх, урам зориг өгөх, манлайлагч, удирдагч болох авьяастай. Заах, зааварлах, зөвлөгөө өгөх зэрэг хүмүүстэй харилцах, бусдад үйлчлэх, нөлөөлөх төрлийн ажил мэргэжлүүд энэ хэвшилд илүү тохирно. \n\nENFJ нар мөн гүнзгий хийсвэр сэтгэлгээтэй, идеалистик хүмүүс байдаг. Хүмүүст туслах, илүү сайн сайхан нийгэм, ертөнцийг цогцлоох, бүтээх, бусад хүмүүст хөгжиж дэвшихэд нь туслах гүнзгий хүсэл эрмэлзэлтэй. ENFJ нар зүгээр нэг хоосон мөрөөдөгчид биш, харин бодсоноо хийж гүйцэтгэдэг, үл ялиг эерэг өөрчлөлтийг ч авчрахын төлөө тууштай зүтгэдэг төрлийн хүмүүс юм. Тэд зөвхөн бусдад тусалж тусалж, бусдын төлөө ажиллахаас гадна өөрсдөө ч бас хувь хүнийхээ хувьд тогтмол өсөж дэвшихийг хичээдэг. \n\nХувь хүнийхээ хувьд үнэнч, шударга байдлыг эрхэмлэдэг, зарчимч, өндөр ёс суртахуунтай, өөрсдийн зөв гэж бодсон зүйлийнхээ араас тууштай явдаг. Эдгээр зан чанараас нь болж хүмүүс заримдаа нөлөөлөгч нарыг зөрүүд, өөрийнхөөрөө зүтгэдэг гэж харах нь тохиолдол бий. Хэрэв ENFJ хүмүүсийн өндөр шаардлага нийцээгүй, санал зөрсөн тохиолдолд заримдаа үл ойлголцол, маргаан дагуулах эрсдэлтэй.',
      image: 'enfj',
    },
    {
      name: 'Тушаагч',
      code: 'ENTJ',
      desc: 'ENTJ буюу тушаагч хэв шинжийн хүмүүс нь өөртөө итгэлтэй, эрч хүчтэй, харизматай, төрөлхийн удирдагч, манлайлагч нар юм. Тэд баг, төсөл удирдан, хариуцаж ажиллах, зорилго тодорхойлох, төлөвлөгөө зохиох, төлөвлөгөөний дагуу тууштай ажиллахдаа гаргууд сайн. Тиймээс тушаагч төрлийн хүмүүс бизнес, менежментийн салбарт амжилт олох магадлал өндөр. \n\nENTJ хүмүүс аливаа асуудлыг нухацтай, шүүмжтэй, логик сэтгэлгээгээр, дэс дараалалтай авч үздэг, тулгарч болох эрсдэлийг үнэлэх, ирээдүйг таамаглахдаа сайн. Тэд баримт, нотолгоонд илүүтэй суурилж шийдвэр гаргадаг, сэтгэл хөдлөлдөө автах нь бага. Гэхдээ зарим тохиолдолд энэхүү хэт их үр дүнд суурилсан байдал нь тэднийг бусдын сэтгэл хөдлөл, үзэл санааг үл тоох, үл ойлголцолд хүргэх эрсдэлтэй. \n\nХүмүүсийн харилцааны хувьд ENTJ төрлийн хүмүүс илтгэх, ярих чадвар сайн, өөрийн үзэл бодлоо бусдад ойлгуулах, ятгахдаа сайн. Тэд шинэ санаа дэвшүүлэх, бусадтай санал уралдуулах, мэтгэлцэхдээ сайн, өөрсдийг нь хурцалж, өдөөдөг хүмүүст дуртай. \n\nЭнэ төрлийн хүмүүс үр бүтээмжгүй байдал, залхуу эвсэл мэдлэг, чадвар муутай хүмүүсийг тэвчдэггүй. Заримдаа хэт шүүмжлэгч, хэт өндөр шаардлага тавьдаг, бусдаас хэт ихийг шаарддаг сул талтай. ',
      image: 'entj',
    },
  ];
  constructor(private vis: VisualizationService) {}

  async template(
    doc: PDFKit.PDFDocument,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    header(doc, firstname, lastname);
    title(doc, result.assessmentName);
    info(
      doc,
      exam.assessment.author,
      exam.assessment.description,
      exam.assessment.usage,
    );

    doc
      .font('fontBold')
      .fontSize(16)
      .fillColor(colors.orange)
      .text('Тестийн тухай', marginX, doc.y);
    doc
      .moveTo(40, doc.y + 2)
      .strokeColor(colors.orange)
      .lineTo(100, doc.y + 2)
      .stroke()
      .moveDown();

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Та өмнө нь яагаад өөрийгөө олон хүнтэй үдэшлэгт очих дургүй атлаа гэртээ ганцаараа дуртай киногоо үзэхийг илүүд үздэг юм бол гэж бодож байсан уу? Яагаад зарим хүн лифтэнд хамт суусан танихгүй хүнтэй шууд, нээлттэй ярилцаж чаддаг байхад бусад нь тэгж чаддаггүй вэ? Яагаад зарим хүн чанга дуу чимээтэй, олон хүнтэй газраас эрч хүчээ авдаг байхад, харин энгийн жижиг чимээ ч хүртэл анхаарлыг чинь сарниулдаг юм бол?\n\nҮнэндээ таны өдөр тутамдаа хийдэг эдгээр үйлдлүүд нь огт санамсаргүй тохиолдлын чанартай биш, харин үүний цаана сайтар судлагдсан сэтгэл зүйн онол, загварууд, хувь хүний төрлүүд оршин байдаг.\n\nШинжлэх ухааны түүхэнд тод мөрөө үлдээсэн алдарт сэтгэл судлаач Карл Юнг одоогоос зуу гаруй жилийн өмнө сэтгэл судлал, зан төрхийн хувьд хүмүүс дотроо тодорхой төрөл, бүлгүүдэд хуваагддаг талаар өөрийн онолыг танилцуулж байжээ. Үүнээс хойш олон судлаачид энэхүү онол дээр суурилан, хүний хэв шинж, зан төрхийг илрүүлэх төрөл бүрийн тестүүдийг хөгжүүлж, гаргажээ. Энэ төрлийн тестүүдээс хамгийн ихээр олон хүнд хүрсэн, алдартай болсон, дэлхий даяар өргөнөөр ашиглагддаг тест бол хувь хүний 16 хэв шинжийг тодорхойлох тест юм.',
        { align: 'justify' },
      )
      .moveDown(1);

    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Алдарт Швейцарын сэтгэл судлаач, философич Карл Юнг (1875-1961)-ын дэвшүүлсэн хувь хүний хэв шинжийн талаарх анхны онолыг Кэтрин Бриггс болон түүний охин Изабел Майерс нар цаашид тест болгон хөгжүүлж, өөрсдийн нэрээр Майерс-Бриггсийн зан төрхийн тест (MBTI) хэмээн нэрлэсэн нь дэлхий даяар олонд хүнд түгээж, маш их алдартай болжээ.',
        { align: 'justify' },
      )
      .moveDown(1);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Хувь хүний 16-н шинж');

    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Энэхүү тест нь хувь хүний зан төрхийн өвөрмөц онцлогийг үндсэн 4 хэмжээсээр үнэлж, хүмүүсийг 16 хэв шинжид хуваадаг. Монголчууд бидний олонх нь дөрвөн темперамент (холерик, сангвиник, флегматик, меланхолик)-ын онол загвартай аль хэдийн танил болсон билээ. Тэгвэл дэлхий дахинд хувь хүний 16 хэв шинжийн онол нь энэхүү дөрвөн темпераментын онолтой адил маш их алдартай бөгөөд, сүүлийн үед хэрэглээ нь улам ихэссээр байна.\n\nЭдгээр 16 хэв шинжийг дараах 4 хэмжээсний хослолоор үнэлдэг:',
        { align: 'justify' },
      )
      .moveDown(1);
    for (let i = 0; i < MBTI.values.length; i++) {
      const dim = MBTI.values[i];

      const titleHeight = 24;
      const titleWidth = doc.page.width - marginX * 2;

      doc.rect(marginX, doc.y, titleWidth, titleHeight).fill(dim.color);

      doc
        .font('fontBlack')
        .fontSize(13)
        .fillColor('#ffffff')
        .text(dim.title, marginX, doc.y + 6.5, {
          width: titleWidth,
          align: 'center',
        });

      const sectionY = doc.y;

      doc
        .moveTo(marginX, sectionY)
        .lineTo(doc.page.width - marginX, sectionY)
        .lineWidth(4)
        .strokeColor(dim.values[0].color)
        .stroke();

      doc.moveDown(0.5);

      const colWidth = (doc.page.width - marginX * 2 - 20) / 2;
      let startX = marginX;
      let startY = doc.y;

      for (const trait of dim.values) {
        doc
          .font('fontBlack')
          .fontSize(13)
          .fillColor(trait.color)
          .text(trait.name, startX, startY);

        doc
          .font(fontBold)
          .fontSize(12)
          .fillColor(trait.color)
          .text(trait.name_full, startX, startY + 15);

        const circleRadius = 12;
        const circleX = startX + colWidth - circleRadius * 2 + 12;
        const circleY = startY;

        doc
          .circle(circleX, circleY + circleRadius, circleRadius)
          .fill(trait.color);

        doc
          .font('fontBlack')
          .fontSize(12)
          .fillColor('#fff')
          .text(trait.key, circleX - circleRadius + 1, circleY + 6, {
            width: circleRadius * 2 - 2,
            align: 'center',
          });

        doc
          .moveDown(1)
          .font(fontNormal)
          .fontSize(12)
          .fillColor(colors.black)
          .text(trait.description, startX, doc.y, {
            width: colWidth,
            align: 'justify',
          });

        startX += colWidth + 20;
      }

      doc.moveDown(2);

      if (i === 1) {
        doc.lineWidth(1);
        footer(doc);
        doc.addPage();
        header(doc, firstname, lastname, 'Хувь хүний 16-н хэв шинж');
      }
    }

    doc
      .font(fontNormal)
      .fontSize(12)
      .lineGap(lh.md)
      .fillColor(colors.black)
      .text(
        'Энэхүү 4 хэмжээсний төрөл бүрийн хослолоос нийт 16-н өвөрмөц, хоорондоо ялгаатай хэв шинжүүд үүсдэг. Жишээлбэл: Хэрэв та INTJ хэв шинжтэй бол энэ нь Интроверт - Хийсвэр байдал - Бодох - Зарчимч гэсэн 4 төрлийн хослолыг илэрхийлэх бөгөөд хэв шинжийн төрлүүдийг агли нэрийн эхний үсгээр нь кодлогдож хэрэглэх нь түгээмэл байдаг (INTJ -Introversion - Intuition -  Thinking - Judging).\n\nЭдгээр 16-н хэв шинжийн аль нэг нь сайн, эсвэл аль нэг нь муу гэсэн ойлголт огт байхгүй. Энэхүү сорилын гол зорилго нь таныг өөрийн өвөрмөц зан төлөвийг тодорхойлж, өөрийгөө илүү сайн, зөвөөр ойлгоход туслах юм. Одоо таны хэв шинж таны тухай юу өгүүлж буйг харцгаая!',
        marginX,
        doc.y,
        { align: 'justify' },
      )
      .moveDown(1);
    doc.lineWidth(1);
    footer(doc);

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Тестийн хэрэглээ, анхаарах зүйлс');

    doc
      .font(fontBold)
      .fillColor(colors.black)
      .fontSize(12)
      .text('Хөгжүүлэлт: ', { continued: true });
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Хувь хүний 16-н хэв шинжийн тест буюу Юнгын тест нь MBTI буюу Майер-Бриггсийн хувь хүний хэв шинжийг тодорхойлох тесттэй адил төстэй. Бидний ашиглаж буй тестийн хувилбар нь Карл Юнгын онолд суурилагдсан, Эрик Жоргенсоны боловсруулж, хөгжүүлсэн, нийт 32 асуулт бүхий тестийн хувилбар юм (Open Extended Jungian Type Scales 1.2). Энэхүү тест түгээмэл хэрэглэгддэг, харьцангуй судлагдсан.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc.font(fontBold).fontSize(12).text('Анхаарах: ', { continued: true });
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Уг тестийг ямар ч нөхцөлд сэтгэцийн эмгэгийн оношилгоонд ашиглаж болохгүй. Зөвхөн эмчилгээ, үйлчилгээ эрхлэх зөвшөөрөлтэй, нарийн мэргэжлийн эмч л сэтгэцийн эмгэгийг оношилно. Тестийн үр дүнд суурилж мэргэжлийн сэтгэл зүй, сэтгэц судлалын зөвлөгөө өгөхгүй байхыг анхаарна уу!\n\nХэдийгээр 16-н хэв шинжийн тест нь дэлхий даяар маш их алдартай, өргөнөөр тархсан болов ч академик судалгаанд энэ төрлийн тестийг төдийлөн ашигладаггүй болохыг анхаарна уу.\n\nБидний ашиглаж буй тест нь Майер-Бриггсийн тестээс ялгаатай өөр хувилбар бөгөөд энэ тесттэй холбоотой ямар нэгэн зохиогчийн болон худалдааны эрхийг зөрчөөгүй болно.',
        { align: 'justify' },
      )
      .moveDown(1);
    doc
      .font(fontBold)
      .fontSize(13)
      .text('Тестийн оноог зөв тайлбарлах')
      .moveDown(0.5);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Хувь хүний хэв шинж тус бүрд харгалзах тестийн оноог ойлгомжтой, дэлгэрэнгүй тайлбарлахын тулд 4-н хэмжээс тус бүр дээр график үүсгэж, хоорондоо эсрэг тэсрэг хослолуудыг графикийн хоёр талд харуулсан. График дээрээс давамгайлан илэрч буй хэмжээсний төрлийг хувиар илэрхийлсэн.',
        { align: 'justify' },
      )
      .moveDown(2);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text('44% - Интроверт', { align: 'center' });
    const imgPath2 = assetPath('icons/bar');
    const imgWidth2 = doc.page.width - 2 * marginX;

    doc.image(imgPath2, marginX, doc.y - 1, { width: imgWidth2 });
    const leftLabel = 'E - Экстроверт';
    const rightLabel = 'I - Интроверт';

    const y = doc.y + 24;

    doc
      .font('fontBlack')
      .fontSize(12)
      .fillColor(colors.black)
      .text(leftLabel, marginX, y, { align: 'left' });

    doc
      .font('fontBlack')
      .fontSize(12)
      .fillColor(colors.black)
      .text(rightLabel, marginX, y, { align: 'right' });

    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Сорилын үр дүн');
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(
        'Үндсэн 4 хэмжээст харгалзах таны тестийн оноог хувиар тооцоолж графикт үзүүлэв.',
        { align: 'justify' },
      )
      .moveDown(1);

    const desiredOrder = ['I-E', 'S-N', 'F-T', 'J-P'];

    const detailMap = result.details.reduce(
      (acc, detail) => {
        acc[detail.value] = Number(detail.cause);
        return acc;
      },
      {} as Record<string, number>,
    );

    const categories = desiredOrder;

    const values = categories.map((cat) => detailMap[cat] ?? 0);
    const percentages = values.map((value) => Math.round((value / 40) * 100));
    const divisors = [100, 100, 100, 100];

    const bar_color_start = ['#FF7F50', '#1E90FF', '#32CD32', '#9370DB'];
    const bar_color_end = ['#FF4500', '#00BFFF', '#228B22', '#8A2BE2'];

    for (let index = 0; index < categories.length; index++) {
      const names = ['Экстроверт', 'Хийсвэр байдал', 'Бодох', 'Зохицогч'];
      const names_start = [
        'E - Экстроверт',
        'N - Хийсвэр байдал',
        'T - Бодох',
        'P - Зохицогч',
      ];
      const names_end = [
        'I - Интроверт',
        'S - Бодит байдал',
        'F - Мэдрэх',
        'J - Зарчимч',
      ];

      const category = names[index];
      const value = Number(values[index]);

      const pct = Math.round((value / 40) * 100);
      const userText = `${pct}% - ${category}`;

      if (index > 0) {
        doc.moveDown(0.75);
      }

      const buffer = await this.vis.bar2(
        percentages[index],
        divisors[index],
        bar_color_start[index],
        bar_color_end[index],
        userText,
      );

      doc.image(buffer, {
        width: doc.page.width - marginX * 2,
        height: (130 / 1800) * (doc.page.width - marginX * 2),
      });
      const y = doc.y + 29;

      doc
        .font('fontBlack')
        .fontSize(12)
        .fillColor(colors.black)
        .text(names_end[index], marginX, y, { align: 'left' });

      doc
        .font('fontBlack')
        .fontSize(12)
        .fillColor(colors.black)
        .text(names_start[index], marginX, y, { align: 'right' });
    }
    doc.moveDown(1);
    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text('Таны хувь хүний хэв шинж бол', { align: 'justify' });

    doc
      .font('fontBlack')
      .fontSize(16)
      .fillColor(colors.orange)
      .text(result.value)
      .moveDown(0.5);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text('Таны хувь хүний хэв шинжид тохирох код бол');

    const baseX = doc.x;
    const baseY = doc.y;

    const codeWidth = doc
      .font('fontBlack')
      .fontSize(18)
      .fillColor(colors.orange)
      .widthOfString(result.result.toString());

    const buyuuWidth = doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .widthOfString(' буюу ');

    doc
      .font('fontBlack')
      .fontSize(18)
      .fillColor(colors.orange)
      .text(result.result.toString(), baseX, baseY);

    doc
      .font(fontNormal)
      .fontSize(12)
      .fillColor(colors.black)
      .text(' буюу ', baseX + codeWidth + 1, baseY + 4.5);

    const namesMN = result.result
      .split('')
      .map((letter) => MBTI.names[letter])
      .join(', ');

    console.log(namesMN);

    doc
      .font('fontBlack')
      .fontSize(14)
      .fillColor(colors.orange)
      .text(namesMN, baseX + codeWidth + 1 + buyuuWidth, baseY + 3.5)
      .moveDown(0.75);
    footer(doc);
    doc.addPage();
    header(doc, firstname, lastname, 'Таны хувь хүний хэв шинж');
    const mbtiDesc = MBTI.desc.find((d) => d.code === result.result);

    if (mbtiDesc) {
      const imgPath = assetPath(`icons/mbti/${mbtiDesc.image}`);
      const imgWidth = 130;
      const imgHeight = 130;
      const startX = marginX;
      const startY = doc.y;

      doc.image(imgPath, startX - 2, startY - 5, {
        width: imgWidth,
        height: imgHeight,
      });

      const titleX = startX + imgWidth + 15;
      const titleY = startY + imgHeight / 2 - 20;

      doc
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(result.result, titleX, titleY);
      doc
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(result.value, titleX, titleY + 15);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(mbtiDesc.desc, marginX, doc.y + 60, {
          align: 'justify',
        });

      doc.moveDown(1);
      doc.y = startY + imgHeight + 10;
    }

    footer(doc);
  }
}
