import { Injectable } from '@nestjs/common';
import { ResultEntity, ExamEntity } from 'src/entities';
import {
  colors,
  fontBold,
  fontNormal,
  footer,
  header,
  info,
  lh,
  marginX,
  title,
} from 'src/pdf/formatter';
import { AssetsService } from 'src/assets_service/assets.service';
import { VisualizationService } from '../visualization.service';
@Injectable()
export class Nicotine {
  constructor(private vis: VisualizationService) {}

  async template(
    doc: PDFKit.PDFDocument,
    service: AssetsService,
    result: ResultEntity,
    firstname: string,
    lastname: string,
    exam: ExamEntity,
  ) {
    try {
      header(doc, firstname, lastname, service);
      title(doc, service, result.assessmentName);
      info(
        doc,
        service,
        exam.assessment.author,
        undefined,
        undefined,
        undefined,
        undefined,
        undefined,
        true,
      );
      doc.font(fontBold).fontSize(13).text('Оршил').moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Яагаад тамхинаас гарах бидэнд хэцүү санагддаг вэ? Яагаад хүмүүс хортой гэдгийг нь мэдсээр байж тамхийг үргэлжлүүлэн татсаар байдаг юм бол? Тэгвэл эдгээр асуултуудын хариулт нь никотин юм.',
          marginX,
          doc.y,
          {
            align: 'justify',
          },
        )
        .moveDown(1);
      doc.image(service.getAsset(`icons/nicotine1`), marginX, doc.y, {
        width: (doc.page.width - marginX * 2) / 4,
      });
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Никотин гэж юу вэ? ', marginX + 145, doc.y + 15, {
          continued: true,
        });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотин нь тамхины ургамалд агуулагддаг, донтуулах өндөр идэвхтэй химийн нэгдэл юм. Никотин нь янжуур, электрон тамхи, вэйп, халаадаг тамхи зэрэг бүх төрлийн тамхи, тамхин бүтээгдэхүүнд агуулагддаг, донтолтыг үүсгэгч үндсэн бүрэлдэхүүн хэсэг юм. Никотин агуулсан бүх төрлийн тамхи, тамхин бүтээгдэхүүн нь донтуулах эрсдэлтэй. Учир нь никотин нь тархины үйл ажиллагаанд нөлөөлж, тамхи дахин хэрэглэх сэдлийг хүчтэй өдөөдөг.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Никотин яагаад хортой вэ? ', doc.x, doc.y + 25, {
          continued: true,
        });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Тамхи, тамхин бүтээгдэхүүнийг хэрэглэх үед ялгарч буй утаанд 7000 гаруй төрлийн химийн хортой бодисууд агуулагддаг. Эдгээр химийн бодисууд нь уушгины архаг бөглөрөлт өвчин, хорт хавдар үүсгэхээс эхлээд хүний эрүүл мэндэд олон төрлийн ноцтой сөрөг нөлөөлөл үзүүлдэг. Ялангуяа никотин нь хүмүүсийг донтуулж, тамхи, тамхин бүтээгдэхүүнийг дахин дахин хэрэглэх сэдлийг төрүүлснээр эдгээр хорт бодисын нөлөөг нөхцөлдүүлж өгдөг.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Никотины ач холбогдолтой тал? ', doc.x, doc.y + 20, {
          continued: true,
        });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотин орлуулах эмчилгээ (NRT) буюу никотиныг маш бага хэмжээгээр агуулсан наалт, бохь, эм зэргийг ашиглаж тамхи, тамхин бүтээгдэхүүнд донтсон хүмүүс тамхинаас гарах боломжтой. Хэрэв зөв хэрэглэж чадвал энэ төрлийн эмчилгээнүүд нь хүмүүсийг тамхинаас гарах магадлалыг хоёр дахин нэмэгдүүлдэг байна.',
          { align: 'justify' },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Тестийн тухай');

      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Никотины хамаарал гэж юу вэ? ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотин агуулсан бүтээгдэхүүнийг давтан хэрэглэх үед бие махбод, сэтгэл зүйн хувьд никотиноос хараат болж, донтолт үүсэж, эрүүл мэндэд сөрөг нөлөө үзүүлж байгааг үл харгалзан хэрэглээгээ зогсоож чадахгүй, хортой албадмал хэрэглээнд шилжихийг никотины хамаарал гэж үздэг. Тамхи татдаг хүмүүсийн ихэнх нь тамхинаас гарах хүсэлтэй байдаг бөгөөд тэдгээрийн 50 гаруй хувь нь сүүлийн нэг жилийн хугацаанд тамхинаас гарахыг ямар нэгэн байдлаар оролдлого хийсэн байдаг. Харамсалтай нь ердөө 10 хүн тутмын 1 нь л амжилттай тамхинаас гарч чаддаг байна. Үүний цаад шалтгаан нь тамхинаас гарахад шаардлагатай зөвлөгөө, дэмжлэг хангалтгүй, эмчилгээний хүртээмж дутмаг байдагтай холбоотой гэж АНУ-ын Өвчний Хяналт, Урьдчилан Сэргийлэх Төв онцолсон байдаг.\n\nОлон жилийн турш судлаачид тамхи татах зан үйл, никотины бие махбодод үзүүлэх нөлөөг судалсны үндсэн дээр никотины хамаарлын түвшнийг үнэлэх энгийн бөгөөд найдвартай аргуудыг боловсруулжээ. Үүний нэг нь Фагерстромийн тест буюу тамхи (никотин)-ны хамаарлыг үнэлэх тест юм. Энэхүү тест нь таны тамхи татах зуршилд тулгуурлан, никотинд хэр зэрэг хамааралтай болсныг илрүүлнэ.\n\nОдоо таны тестийн үр дүнтэй танилцъя.',
          { align: 'justify' },
        )
        .moveDown(1);

      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Тестийн хэрэглээ, анхаарах зүйлс',
      );
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('Хөгжүүлэлт: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотин, тамхинаас хамааралт байдлыг үнэлдэг олон төрлийн асуумж, үнэлгээний хэрэгслүүдийг судлаачид хөгжүүлсэн байдаг. Бидний одоо ашиглаж буй тест нь Карл-Олоф Фагерстромын анх 1978 онд боловсруулж, хожим нь Тодд Хийтертон нарын судлаачид 1991 онд нэмэлтээр боловсруулсан Фагерстромийн Никотины Хамаарлыг Үнэлэх Тест (FTND) юм. Энэхүү тест нь олон улсад өргөн хэрэглэгддэг, найдвартай байдал болон үнэн зөв чанар нь олон судалгаагаар баталгаажсан стандарт аргад тооцогддог.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc.font(fontBold).fontSize(12).text('Анхаарах: ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Уг тестийг мэргэжлийн сэтгэл засалч, сэтгэцийн эмчийн хяналт, зөвшөөрөлгүйгээр ямар ч нөхцөлд сэтгэл зүй болон сэтгэц судлалын оношилгоо, эмчилгээ хийх, зөвлөгөө өгөх байдлаар ашиглахад зориулаагүй! Зөвхөн эмчилгээ, үйлчилгээ эрхлэх зөвшөөрөлтэй, нарийн мэргэжлийн эмч л сэтгэцийн эмгэгийг оношилно.',
          { align: 'justify' },
        )
        .moveDown(1);

      doc
        .font(fontBold)
        .fontSize(13)
        .text('Тестийн оноог зөв тайлбарлах')
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Фагерстромын тестийн оноог тооцоолохдоо тийм/үгүй гэсэн хариулттай асуултуудыг 0–ээс 1 оноогоор, харин олон сонголттой асуултуудыг 0–ээс 3 хүртэлх оноогоор үнэлдэг. Нийт оноог тооцохдоо асуулт тус бүрт харгазлах оноог хооронд нь нэмнэ. Нийт 0–ээс 10 хүртэлх оноо авах боломжтой, оноо өндөр байх тусам тухайн хүнд никотины хамаарал илүү хүчтэй байгааг илтгэнэ.',
          { align: 'justify' },
        )
        .moveDown(1);

      const tableData = [
        ['Нийт оноо', 'Ангилал/тайлбар'],
        ['0-2 оноо', 'Маш бага хамааралтай'],
        ['3-4 оноо', 'Бага зэргийн хамааралтай'],
        ['5 оноо', 'Дунд зэргийн хамааралтай'],
        ['6-7 оноо', 'Их хамааралтай'],
        ['8+ оноо', 'Маш өндөр хамааралтай'],
      ];

      const tableWidth = doc.page.width - 2 * marginX;
      const colWidths = [tableWidth * 0.3, tableWidth * 0.7]; // 30% / 70%
      const rowHeight = 18;

      let startX = marginX;
      let startY = doc.y;

      for (let row = 0; row < tableData.length; row++) {
        let x = startX;
        const y = startY + row * rowHeight;

        for (let col = 0; col < tableData[row].length; col++) {
          const colWidth = colWidths[col];

          doc.rect(x, y, colWidth, rowHeight).strokeColor('black').stroke();

          doc
            .font(row === 0 ? fontBold : fontNormal)
            .fontSize(12)
            .fillColor('black')
            .text(tableData[row][col], x + 5, y + 4, {
              width: colWidth - 10,
              align: 'center',
            });

          x += colWidth;
        }
      }

      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Сорилын үр дүн');

      const results = [
        {
          name: 'Маш бага хамааралтай',
          description:
            'Таны бие махбод  никотинд харьцангуй сул хамааралтай байгааг илтгэнэ. Энэ түвшинд никотин орлуулах эмчилгээ хийх шаардлагагүй. \n\nТаны хувьд тамхи, тамхин бүтээгдэхүүний хэрэглээгээ багасгах эсвэл тамхинаас  гарахаар оролдох үед тамхи татах хүсэл төрөх, илүү цочромтгой болох, анхаарал төвлөрөл буурах гэх мэт тамхинаас гарах үед илэрдэг шинж тэмдгүүд богино хугацаанд илэрч болзошгүй. Иймд өөрийн биеийн болон сэтгэлзүйн байдалд анхааралтай, хүлээцтэй хандаж, өөрийгөө хянаж байх нь зүйтэй.',
        },
        {
          name: 'Бага зэргийн хамааралтай',
          description:
            'Таны бие махбод никотинд дунджаас харьцангуй бага хамааралтай байгааг илтгэнэ. Энэ түвшинд никотин орлуулах эмчилгээг хэрэглэх боломжтой.\n\nТаны хувьд тамхи, тамхин бүтээгдэхүүний хэрэглээгээ багасгах эсвэл тамхинаас бүр мөсөн гарахаар оролдох үед тамхи татах хүсэл төрөх, илүү цочромтгой болох, анхаарал төвлөрөл буурах гэх мэт тамхинаас гарах үед илэрдэг шинж тэмдгүүд тодорхой хугацаагаар илэрч болзошгүй. \n\nТиймээс цаашид никотиныг бага хэмжээгээр агуулсан наадаг наалт, бохь, эм, цацлага зэрэг никотин орлуулах эмчилгээнээс сонгон, хэрэглэх боломжтой. Таны хувьд эмчилгээний ямар хэлбэр, тун илүү тохирохыг сонгохдоо тамхи татах дадал, өдөрт татдаг тамхины тоо, давтамж, зэрэг хүчин зүйлсийг харгалзан үзэж, мэргэжлийн эмчийн хяналт, зөвлөгөө дор эмчилгээг сонгож, эхлүүлэх нь зүйтэй.',
        },
        {
          name: 'Дунд зэргийн хамааралтай',
          description:
            'Таны бие махбод никотиноос тодорхой хэмжээнд хамааралтай болсон, тамхи татахгүй байх эсвэл хэрэглээгээ багасгах, тамхинаас гарахаар оролдох үед тамхи татах хүсэл төрөх, илүү цочромтгой болох, анхаарал төвлөрөл буурах гэх мэт тамхинаас гарах үед илэрдэг шинж тэмдгүүд харьцангуй их, тодоор илэрч болно.\n\nЭнэ түвшинд та өөрийн тамхи татах хүслийг бие даан хянахад бэрхшээлтэй байж болзошгүй тул ихэвчлэн никотин орлуулах эмчилгээг санал болгодог. Мөн тамхинаас гарах үед илэрдэг шинж тэмдгүүдийг бууруулах, хянахын тулд никотин агуулсан наалт, бохь, эмүүдийг хослуулан хэрэглэх нь энэ үед илүү тохиромжтой юм.\n\nТаны хувьд эмчилгээний ямар хэлбэр, тун илүү тохирохыг таны тамхи татах дадал, өдөрт татдаг тамхины тоо, давтамж, зэрэг хүчин зүйлүүдийг харгалзан үзэж, мэргэжлийн эмчийн хяналт, зөвлөгөөнд тулгуурлан сонгох нь чухал.',
        },
        {
          name: 'Их хамааралтай',
          description:
            'Таны бие махбод никотиноос харьцангуй өндөр хэмжээнд хамааралтай болсныг илтгэж байна. Тамхи татахгүй байх эсвэл хэрэглээгээ багасгах, тамхинаас гарахаар оролдох үед тамхи татах хүсэл төрөх, илүү цочромтгой болох, анхаарал төвлөрөл буурах гэх мэт тамхинаас гарах үед илэрдэг шинж тэмдгүүд харьцангуй их, хүчтэй илэрч болно.\n\nЭнэ түвшинд та өөрийн тамхи татах хүслийг бие даан хянахад бэрхшээлтэй байж болзошгүй тул ихэвчлэн никотин орлуулах эмчилгээг санал болгодог. Мөн тамхинаас гарах үед илэрдэг шинж тэмдгүүдийг бууруулах, хянахын тулд никотин агуулсан наалт, бохь, эмүүдийг хослуулан хэрэглэх нь энэ үед илүү тохиромжтой.\n\nТаны хувьд эмчилгээний ямар хэлбэр, тун илүү тохирохыг таны тамхи татах дадал, өдөрт татдаг тамхины тоо, давтамж, зэрэг хүчин зүйлүүдийг харгалзан үзэж, мэргэжлийн эмчийн хяналт, зөвлөгөөнд тулгуурлан сонгох нь чухал.',
        },
        {
          name: 'Маш өндөр хамааралтай',
          description:
            'Та уг тестийг бөглөөд 8 ба түүнээс дээш оноо авсан байна. Энэ нь таны никотинд хамаарах бие махбодын хамаарал маш өндөр түвшинд хүрсэн болохыг харуулна. \n\nНикотины өндөр хэрэглээ нь таны дадал, зан үйлийн тогтолцоонд хүчтэй нөлөөлөл үзүүлсэн байх магадлалтай тул тамхи татахгүй байх эсвэл хэрэглээгээ багасгах, тамхинаас гарахаар оролдох үед тамхи татах хүсэл төрөх, илүү цочромтгой болох, анхаарал төвлөрөл буурах гэх мэт тамхинаас гарах үед илэрдэг шинж тэмдгүүд илүү их хүчтэй, удаан хугацаанд үргэлжилж болно.\n\nЭнэ түвшинд та өөрийн тамхи татах хүслийг бие даан хянахад бэрхшээлтэй байж болзошгүй тул ихэвчлэн никотин орлуулах эмчилгээг санал болгодог. Мөн тамхинаас гарах үед илэрдэг шинж тэмдгүүдийг бууруулах, хянахын тулд никотин агуулсан наалт, бохь, эмүүдийг хослуулан хэрэглэх нь энэ үед илүү тохиромжтой.\n\nТаны хувьд эмчилгээний ямар хэлбэр, тун илүү тохирохыг таны тамхи татах дадал, өдөрт татдаг тамхины тоо, давтамж, зэрэг хүчин зүйлүүдийг харгалзан үзэж, мэргэжлийн эмчийн хяналт, зөвлөгөөнд тулгуурлан сонгох нь чухал.',
        },
      ];

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text('Таны үнэлгээний оноо ', marginX, doc.y, {
          align: 'justify',
          continued: true,
        })
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(result.point.toString(), doc.x, doc.y - 3, { continued: true })
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(' буюу ', marginX, doc.y + 3, {
          align: 'justify',
          continued: true,
        })
        .font('fontBlack')
        .fontSize(16)
        .fillColor(colors.orange)
        .text(`${result.result.toString().toUpperCase()}`, doc.x, doc.y - 3, {
          continued: true,
        })
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text('-г илтгэж байна. ', marginX, doc.y + 3, {
          continued: false,
        })
        .moveDown(1);

      doc.x = marginX;

      doc
        .font(fontBold)
        .fontSize(12)
        .fillColor(colors.black)
        .text('Таны авсан оноо: ' + ' ', { continued: true })
        .font('fontBlack')
        .fillColor(colors.orange)
        .text(String(result.point), { continued: true })
        .fillColor(colors.black)
        .text('/' + String(10));

      doc.moveDown(-0.8);

      const buffer = await this.vis.bar(result.point, 10, 15, '');

      doc
        .image(buffer, {
          width: doc.page.width - marginX * 2,
          height: (130 / 1800) * (doc.page.width - marginX * 2),
        })
        .moveDown(3);

      const desc = results.find((res) => res.name === result.result);

      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(desc.description, startX, doc.y, {
          align: 'justify',
        })
        .moveDown(1);
      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Электрон тамхи, вэйп хортой юу?',
      );
      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.black)
        .text(
          '“Электрон тамхи буюу вэйп нь янжуур тамхитай адил хэмжээтэй никотиныг агуулдаг”',
          { align: 'center' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотиноос гадна электрон тамхинд төрөл бүрийн амт оруулагч, пропилен гликол, глицерин болон бусад хортой химийн нэгдлүүдийг орсон байдаг. Сүүлийн үед электрон тамхиуд нь төрөл бүрийн нэр, хэлбэр, хэмжээгээр шинээр худалдаанд гарч байна. Жишээлбэл:',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          ['Электрон тамхи, цахилгаан тамхи', 'Вейп, вейп үзэг, под, жүүль'],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(0.5);
      doc.image(service.getAsset(`icons/nicotine2`), marginX, doc.y, {
        width: doc.page.width - marginX * 2 - 30,
      });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'ДЭМБ болон АНУ-ын Өвчний Хяналт, Урьдчилан Сэргийлэх Төв (CDC)-ийн тодорхойлсноор электрон тамхи нь бусад тамхи, тамхин бүтээгдэхүүнүүдтэй адилаар никотин агуулсан, донтуулагч бүтээгдэхүүн юм. Ихэнх вейп, электрон тамхи бүхий бүтээгдэхүүнүүд никотиныг өндөр тунгаар агуулсан байдаг.\n\nУламжлалт янжуураас ялгаатай нь электрон тамхины төхөөрөмжүүд  нь шаталт үүсгэхгүйгээр, шингэнийг халааж ууршуулдаг. Гэвч энэхүү халаах процессын үр дүнд нарийн ширхэгт аэрозол (бичил агаарын дуслууд) бүхий төрөл бүрийн химийн нэгдлүүд шинээр үүсдэг. Үүнд никотиноос гадна хорт хавдар үүсгэгч бодис, дэгдэмхий органик нэгдлүүд, хүнд металл зэрэг олон төрлийн хортой химийн нэгдлүүд орно. Мөн электрон тамхи нь зүрхний цохилт, цусны даралтад нөлөөлдөг ба электрон тамхинаас үүдэлтэй уушгины гэмтэл (EVALI) үүсгэж, улмаар зарим тохиолдолд үхэлд хүргэх боломжтой.\n\nХэдийгээр зарим хүмүүс электрон тамхийг янжуур тамхинаас гарах арга болгон ашиглах тохиолдол байдаг ч гэсэн хүн амын түвшинд электрон тамхи нь үнэхээр тамхинаас гарахад туслах үр дүнтэй арга болохыг нотолсон хангалттай баримт, нотолгоо одоогоор байхгүй байгааг СDC-ээс дүгнэсэн байдаг. Электрон тамхи нь уламжлалт тамхинаас өөр технологитой боловч адилхан никотины хамаарал үүсгэдэг, эрүүл мэндэд хортой бүтээгдэхүүн тул ялангуяа өсвөр насныхан, жирэмсэн эмэгтэйчүүд хэрэглэхгүй байхыг олон улсын эрүүл мэндийн байгууллагуудаас зөвлөсөөр байна.',
          marginX,
          doc.y + 160,
          { align: 'justify' },
        )
        .moveDown(0.5);
      footer(doc);
      doc.addPage();
      header(
        doc,
        firstname,
        lastname,
        service,
        'Хүүхэд, залуучуудад илүү их эрсдэлтэй юу?',
      );
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Өсвөр насныхан, залуучууд никотинд донтох хамгийн их эрсдэлтэй байдаг. Энэ үед тархины хөгжил идэвхтэй явагдаж байгаа тул донтолт үүсэхэд илүү хялбар байдаг байна. Тамхи татаж эхэлсэн нас бага байх тусам цаашид донтолт үүсэх эрсдэл өндөр байдаг ажээ.\n\nВейп, электрон тамхинд агуулагдах никотины өндөр тун хэмжээ, хэрэглээний өндөр давтамжаас шалтгаалж вейп, электрон тамхи хэрэглэдэг өсвөр насныхан янжуур тамхинаас илүү хурдан никотинд донтох магадлалтай гэж үздэг. Мөн түүнчлэн, электрон тамхины нэмэлт амт, үнэр нь өсвөр насны хүүхэд, залуучуудыг илүү удаан, олон удаа вейп татах сэдлийг төрүүлж, никотины донтолт үүсэх эрсдэлийг улам их нэмэгдүүлдэг.',
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fontSize(13)
        .fillColor(colors.black)
        .text(
          '“Электрон тамхи, вэйпнээс ялгарсан никотин 10 секундийн дотор таны тархинд хүрж, нөлөөлдөг”',
          { align: 'center' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Улмаар никотин агуулсан бүтээгдэхүүн хэрэглэдэг өсвөр насныхан дунд анхаарал төвлөрөлт багасах, суралцах чадамж буурах, ой санамжид муудах зэрэг олон сөрөг нөлөө удаан хугацааны туршид үргэлжлэх боломжтой.\n\nХэрвээ дараах асуултуудын аль нэгэнд тийм гэж хариулж байвал та аль хэдийн электрон тамхинаас хараат болж эхэлсэн бөгөөд тусламж авах цаг болсон  байна гэсэн үг.\n\nТа эсвэл таны таньдаг хэн нэгэн...',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Дөнгөж сэрсний дараа эсвэл хичээлийн үеэр вэйп татмаар санагдах',
            'Вейп татахгүй бол сэтгэл түгших эсвэл уурлаж бухимдах',
            'Анхаарал төвлөрөлт муудсан, эсвэл унтахад бэрхшээлтэй болсон',
            'Эрүүл мэндэд муу гэдгийг мэдэж байсан ч зогсоож чадахгүй байх',
            'Өөрөө анзаараагүй үедээ вейпдээ хүрэх, татах',
            'Өдрийн туршид вейп татах тухай бодлууд толгойд орж ирэх',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(1);
      footer(doc);
      doc.addPage();
      header(doc, firstname, lastname, service, 'Нэмэлт зөвлөгөө, мэдээлэл');
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Амьдралын хэв маягаа өөрчлөх, сайжруулах, тамхинаас гарах шийдвэр гаргахдаа тестийн үр дүн дээр суурилбал илүү үр дүнтэй байдаг. Никотины хамаарал нь бие махбодоос гадна хүний сэтгэл зүй, дадал зуршил, тархины урамшууллын тогтолцоотой нягт холбоотой байдаг учир ихэнх хүний хувьд тамхинаас гарах үйл явц төдийлөн амар хялбар байдаггүй.',
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('1. Нөхцөл байдлаа үнэлэх. ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотин нь хүний тархины урамшууллын системийг хүчтэй өдөөдөг, тамхи дахин дахин татах хүслийг өдөөдөг. Таны тамхи татах давтамж, хэв маяг, нөхцөл байдлаас шалтгаалан энэхүү холбоо хамаарлын хүч тодорхойлогдоно.',
          { align: 'justify' },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('2. Эмчилгээ ба дэмжлэг авах боломжууд. ', { continued: true });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Никотины хамаарлыг арилгахын тулд зөвхөн тамхи татахаа зогсоохоос гадна амьдралын бусад хэв маягаа аажмаар өөрчилж, эрүүл дадал хэвшил бий болгох нь чухал. Та дараах аргуудыг хэрэглэж үзээрэй.',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Никотин орлуулах эмчилгээ. Тамхи татах хүсэл, тамхинаас гарах үед илрэх шинж тэмдгүүдийг багасгах зорилгоор никотин агуулсан наалт, шахмал, бохь, эмүүдээс сонгон хэрэглэх боломжтой.',
            'Эмийн эмчилгээ. Вареницлин, бупропион зэрэг эмүүд нь хүний тархин дахь донтолттой холбоотой химийн процессуудыг саатуулж, тамхинаас гарах үеийн шинж тэмдгийг багасгахад тусалдаг.',
            'Сэтгэл зүйн зөвлөгөө. Тамхи татахад нөлөөлж буй зан үйл, шалтгаан, өдөөгч хүчин зүйлсийг үнэлж, стрессийг бууруулах, хянахад чиглэсэн сэтгэл зүй, сэтгэл судлалын дэмжлэг, зөвлөгөө авч болно. ',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(1);
      doc
        .font(fontBold)
        .fillColor(colors.black)
        .fontSize(12)
        .text('3. Эрүүл дадал зуршлуудыг үүсгэх. ', marginX, doc.y, {
          continued: true,
        });
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Дараах дадал, зуршлууд нь тамхинаас гарах, тамхины хэрэглээг багасгахад тусална.',
          { align: 'justify' },
        )
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .list(
          [
            'Тогтмол дасгал хөдөлгөөн хийх – Стрессийг бууруулж, тамхи татах хүслийг дарахад тусална. ',
            'Уураглаг хоол илүү хэрэглэх, ус их уух – Таны бие махбодын үйл ажиллагааг дэмжиж, тамхинаас гарах үед илэрдэг шинж тэмдгүүдийг багасгахад тусална. ',
          ],
          doc.x + 20,
          doc.y,
          {
            align: 'justify',
            bulletRadius: 1.5,
            columnGap: 8,
            listType: 'bullet',
          },
        )
        .moveDown(1);

      doc.x = marginX;
      doc
        .font(fontBold)

        .fontSize(13)
        .fillColor(colors.black)
        .text('Эх сурвалж, ашигласан материал')
        .moveDown(0.5);
      doc
        .font(fontNormal)
        .fontSize(12)
        .fillColor(colors.black)
        .text(
          'Carolina Center for Recovery. (2024). Nicotine addiction: Signs, causes, diagnosis, treatment, and prevention.\n\nSharma, M. K., Suman, L. N., Srivastava, K., Suma, N., & Shivakumar, A. (2021). Psychometric properties of Fagerstrom Test of Nicotine Dependence: A systematic review.\n\nHeatherton, T. F., Kozlowski, L. T., Frecker, R. C., & Fagerström, K.-O. (1991). The Fagerström Test for Nicotine Dependence: A revision of the Fagerström Tolerance Questionnaire. British Journal of Addiction, 86(9), 1119–1127.',
          { align: 'justify' },
        );
      footer(doc);
    } catch (error) {
      console.log('nicotine', error);
    }
  }
}
